{
  "jobs": [
    {
      "title": "Python with SQL Experience",
      "company": "The Dignify Solutions, LLC",
      "location": "Charleston, SC",
      "url": "https://www.linkedin.com/jobs/view/python-with-sql-experience-at-the-dignify-solutions-llc-4297005443?position=1&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=SHGUXf8dxWUW5uDWjrbK0w%3D%3D",
      "post_date": "2025-09-10",
      "scraped_at": "2025-10-21T01:41:00.340849",
      "source": "public_api",
      "details": {
        "description": "Must Have SkillsPython - Creating pipeline to read different file formats (DAT, CSV) & ingesting to SQL serverSQL Server - Data Ingestion to SQL Server from different file formats (CSV, DAT etc.). Writing Stored procedure, Views, ETL Pipeline)PowerShell scriptingGitHub. Should Have:Azure CloudSSISData ModelingGood to HaveData lakeQualifications: 6-10 Years experience in Python, Data Integration, PowerShell Scripting & SQL ServerGood communication skills and experience of client facingImmediate Joiner with valid Work Permit\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Azure",
          "SQL",
          "Python"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "AI/ML Product Manager",
      "company": "Global Business Ser. 4u",
      "location": "Phoenix, AZ",
      "url": "https://www.linkedin.com/jobs/view/ai-ml-product-manager-at-global-business-ser-4u-4315854455?position=2&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=BuGjA49KpLmkuynipql8qA%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T01:41:00.340849",
      "source": "public_api",
      "details": {
        "description": "Job Title : AI/ML Product ManagerLocation: Phoenix, Az Onsite Relocation will workFull-Time OnlyExperience Required - 10+ YearsMust Have Technical/Functional Skills 5 years of product management experience, ideally in travel, financial services, or lifestyle-oriented platforms Hands on experience with data driven products and working knowledge of ML principles and Model lifecycle Strong understanding of customer segmentation, targeting, recommendation, and real time personalization engines Experience participating in large scale planning, annual planning, PI planning, and working with Agile environment Ability to synthesize complex data and communicate clear product narrative to technical and non-technical stakeholders Proficiency with tools such as SQL, JIRA, Confluence, Tableau/PowerBI familiarity a plus, Python basic understanding Familiarity with ML concepts, ML Studio, Copilot, github, elastic search Understanding of Model development and software development lifecycle Familiarity with Model explaianbility tools (SHAP, LIME etc) Understanding of Big data, Data pipeline, ETL/ELT processes Understanding of Cloud Platforms (GCP, (Big Table, Lumi, Big Query, Vertex All) Security and compliance awareness GDPR, data privacy regulations, Model Governance, compliance review process, Model Risk Management Strong communication and stakeholder management skills Excellent communication skills with the ability to engage, influence, and inspire partners to drive collaboration and alignment. Able to create PPT for presentations. Has a successful record of leading and coordinating business, delivery, and technology teams to define, prioritize, and deliver on a product roadmap Strong product management skills that will take full ownership from analysis through implementation.Roles & Responsibilities Product Strategy and Roadmap Define the long-term product vision and roadmap for data driven and AI/ML driven products that enables personalization at scale. Champion customer centricity through data and insights, identifying high-impact use cases that improve relevancy, engagement and satisfaction AI/ML integration and Data insights Collaborate with Data Science and Engineering teams to build, deploy, and monitor ML Models for personalization, segmentation, predictive experiences Translate dat a signals and model outputs into actionable, personalized product features across Planning, booking, marketing, servicing and lifestyle use cases Partner with Data science team to define model requirements and interpret model outcomes Collaborate with Privacy, Compliance, Legal, Model Governance teams to ensure compliance, Risk mitigation, Model approvals. Enable data pipelines, experimentation frameworks, and real time personalization engines in collaboration with engineering Stakeholder Influence and Adoption Act as a strategic partner to stakeholders across business units, advocating the use of data and AI Powered tools Partner with Marketing, Online, Servicing and Personalization, Analytics, Risk, Customer support, Big Data, Data Governance, Data science, Engineering stakeholders to drive adoption of AI powered solutions Translate complex data and AI concepts into clear business value for non-technical audiences PI Planning Actively participate in Agile PI Planning sessions- prioritizing features, identifying dependencies, and ensuring team capacity is aligned with delivery expectations Manage cross-functional collaboration across organization ( data, engineering, compliance, experience design, data science etc) Requirements, Delivery & Measurement Lead Product Delivery and requirements definition using user insights, market research, and data signals Lead end-to-end product lifecycle management: discovery, definition, prototyping, testing, development and rollout Define success metrics and KPIs tied to personalization effectiveness, customer outcomes and Business impact Continuously improve the product based on data, customer behavior and market trends and model performance Gather, document, and validate detailed product requirements Functional and non-functional requirements) Monitor Product health Metrics post launch, product performance, API performance, SLA etc Collaborate with Data science, engineering and UX teams to build scalable product supported by scalable design and architecture Customer centric mindset Conduct customer research to understand needs, friction points, and personalization preferences Use segmentation, journey mapping, and behavior data to drive actionable product decisions Platform and Architecture alignment Partner with engineering and enterprise architecture teams to define scalable and privacy compliant architecture ensuing solution design support real time integration with servicing platforms like web, mobile, voice, concierge etc Drive alignment on API contracts, data integration patt erns to support modular and extensible capabilities Maintain awareness of tech debt, system ,limitations and infrastructure constraints during product prioritization and roadmap planning Advanced degree in business management/computer science or related or equivalent work experience. Experience driving complex, transformational initiatives across multiple teams is preferred.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "Tableau",
          "Python",
          "GCP"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Head of Growth & Partnerships, Dental Schools",
      "company": "Juno",
      "location": "United States",
      "url": "https://www.linkedin.com/jobs/view/head-of-growth-partnerships-dental-schools-at-juno-4289979391?position=3&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=oZVkThIkFfIq79NelCzRiw%3D%3D",
      "post_date": "2025-08-20",
      "scraped_at": "2025-10-21T01:41:00.340849",
      "source": "public_api",
      "details": {
        "description": "About JunoJuno leverages collective bargaining power to secure better student loan rates for graduate students. With 230,000+ members and over $1B in negotiated loan volume, we've proven that group buying works. We are the most popular way to pay for the world’s top MBA programs and are now expanding to serve all professional degree students at a critical moment in higher education.The ProblemFederal lending reforms are creating an unprecedented market shift. Starting July 2026, new caps on federal graduate loans (including the elimination of Grad PLUS) will leave millions of students with significant funding gaps. Students will increasingly need transparent, competitive private options—exactly what Juno negotiates. ￼Your missionWe're seeking a leader to own the P&L and full-funnel growth for dental programs. Your efforts will ensure every future dental professional gets fair, transparent financing options amid new federal caps.You'll build the playbook for reaching 70+ dental schools, converting waitlist demand to funded loans, and establishing Juno as the go-to resource for dental student financing. This is a team-building role - start by doing the work yourself, prove the model, then build and lead the team you need to scale.What You’ll DoOwn the dental school P&L: Build and execute GTM strategy, hit growth targets, and drive Juno member growthScale distribution through partnerships:Negotiate national deals with key organizations that can help reach our target marketActivate campus-based chapters with turnkey playbooksBuild relationships with financial aid offices at target schoolsPartner with DAT prep companies and AADSAS ecosystemRun targeted campaigns aligned to application cycles (DAT → applications → interviews → white coat)Build a campus ambassador network: Recruit, train, and manage high-performing dental students across DMD/DDS programs with clear KPIs and incentivesDrive cross-functional initiatives: Partner with product on feature development, lender relations on competitive rates, and compliance on messagingManage operations and analytics: Forecast pipeline, track cohort performance, optimize CAC/LTV, and manage budget allocationOwn waitlist growth → loan origination: landing pages, A/B tests, content, webinars, email/SMS, and event cycles aligned to application, admissions, and financial aid timelinesWhat We Offer💰 Compensation: Competitive base salary + performance bonus with significant upside potential🏥 Benefits: Comprehensive health, dental, vision, and retirement matchingWhat We’re Looking ForBackground: Typically 3–5+ years or an outlier track record (e.g., you scaled a campus network, ran national org programming, built a zero‑to‑one motion).Preference for experience in professional services, management consulting, investment banking, or high-growth startupsPreference for an Owner‑operator who has owned a number in growth/BD/marketplaces/fintech/edtech or campus‑scale programs.Exceptional writing & communication: you can craft compliant, persuasive copy for students, deans, and national orgs.Bias to action: ship experiments frequently; instrument attribution; close loops with lender relations & compliance.Tenacity: we work as hard as it takes to achieve our targets.The X-FactorYou lived it: Pre-dental, dental school experience, or other connections to dental education are a massive advantage (but not required)You're hungry: Ready to own outcomes, not just make recommendationsYou're scrappy: Will do whatever it takes to winYou're magnetic: Can recruit and inspire great peopleCompensation: $150k–$250k, including performance upside tied to growth milestones. Top performers will exceed this range.Why Join Juno?The Opportunity✅ Real Impact: Help hundreds of thousands of students get access to the lowest rates on the market✅ Market Timing: Federal aid changes create massive tailwind for growth✅ Proven Model: $1B+ negotiated, 200K+ members - product-market fit achieved✅ Career Growth: Own a P&L and build a team with significant autonomy\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "go"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Product Manager",
      "company": "DAT Freight & Analytics",
      "location": "Denver, CO",
      "url": "https://www.linkedin.com/jobs/view/product-manager-at-dat-freight-analytics-4284476267?position=4&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=kOZm5C1zOJ%2FNfYThZnUp6w%3D%3D",
      "post_date": "2025-10-13",
      "scraped_at": "2025-10-21T01:41:00.340849",
      "source": "public_api",
      "details": {
        "description": "About DATDAT is an award-winning employer of choice and a next-generation SaaS technology company that has been at the leading edge of innovation in transportation supply chain logistics for 45 years. We continue to transform the industry year over year, by deploying a suite of software solutions to millions of customers every day - customers who depend on DAT for the most relevant data and most accurate insights to help them make smarter business decisions and run their companies more profitably. We operate the largest marketplace of its kind in North America, with 400 million freights posted in 2022, and a database of $150 billion of annual global shipment market transaction data. Our headquarters are in Denver, CO, and Beaverton, OR, with additional offices in Seattle, WA; Springfield, MO; and Bangalore, India. For additional information, see www.DAT.com/company Job Application Deadline: 11/30/2025About Product at DAT - Shaping the Future of Freight AnalyticsAt DAT, we're building the go-to destination for freight pricing and insights. As the freight industry undergoes major shifts—driven by AI, autonomous vehicles, and political changes—we help our customers execute smarter, faster decisions. As a Product Manager on the iQ team, you’ll shape the data and tools that power those decisions, working at the intersection of strategy and real-world impact. We follow leading product practices inspired by the Silicon Valley Product Group (SVPG), giving you the structure and support to drive meaningful outcomes. If you’re passionate about building great products and ready to make a difference in the freight industry, we’d love to talk.Position OverviewAs an iQ Product Manager at DAT, you will be at the forefront of driving our product vision to reality. You will be accountable for working closely with your empowered product team partners (Product, UX, Tech Lead) to discover and define the best path forward. You will then execute your strategies to deliver high-performing solutions that our customers love, achieve ambitious Objectives and directly contribute to significant business growth.Shape the Future: Collaborate with your empowered product team (Product, UX, Tech Lead) to envision, define, and drive the strategy for your iQ products, ensuring they solve critical customer problems and achieve ambitious business goals.Become the Expert: Immerse yourself in understanding our users, the market landscape and the power of our enormous data set to identify new growth opportunities.Drive Impact: Analyze user behavior and data to uncover actionable insights that fuel product decisions and prioritization.Collaborate and Inspire: Foster strong partnerships within your team and across the organization, evangelizing the product vision and strategy to stakeholders and inspiring them to achieve shared success.What You’ll BringProven Leadership & Collaboration: You have a track record of inspiring and motivating cross-functional teams to achieve ambitious goals, fostering strong partnerships along the way.End-to-End Product Success: You've demonstrated success in taking impactful, growth-oriented products from concept to launch and beyond, with a strong understanding of the entire product lifecycle.Strong Foundation: You possess a Bachelor's degree (MBA preferred) in a relevant field and have honed your analytical and problem-solving skills over at least 5 years in progressive product management roles.Product Development Expertise: You're well-versed in modern product discovery and optimization techniques, ideally with experience applying the SVPG Product Operating Model to deliver exceptional customer value.Exceptional Communication & Influence: Your written and verbal communication skills are top-notch, allowing you to clearly articulate your vision, build strong stakeholder relationships, and influence decision-making across the organization.Bonus Points: Experience launching AI-powered product features and deep industry knowledge in transportation and logistics will give you a significant advantage.Why You Should Join UsShape the Future: Drive innovation in freight analytics, influence strategic decisions and define the next generation of our product offerings.Grow Your Career: Thrive in a dynamic Product Operating Model environment with ample opportunities for professional development and hands-on learning.Be Part of Something Great: Join a collaborative team that values excellence, continuous learning, delivering exceptional customer value and having fun while building impactful products that drive business success.Why DAT?DAT is an award winning employer of choice.For starters, we have a hybrid work environment, but we also know what makes a great workplace. We have a time-tested and resolute set of operating values predicated on integrity, mutual respect, open communication, and executing with excellence. These values inform our strategic vision as much as any one of our products does. We’ve been an employer of choice in the Portland metropolitan area for four decades, and within one year of opening our Denver office, DAT was #26 on Built In Colorado’s 100 Best Places to Work In Colorado.Medical, Dental, Vision, Life, and AD&D insuranceParental LeaveUp to 20 days of paid time off starting in year oneAn additional 10 holidays of paid time off per calendar year401k matching (immediately vested)Employee Stock Purchase PlanShort- and Long-term disability sick leaveFlexible Spending AccountsHealth Savings AccountsEmployee Assistance ProgramAdditional programs - Employee Referral, Internal Recognition, and WellnessFree TriMet transit pass (Beaverton Office)Competitive salary and benefits packageWork on impactful projects in a cutting-edge environmentCollaborative and supportive team cultureOpportunity to make a real difference in the trucking industryEmployee Resource GroupsThis position is not eligible for visa sponsorship**.For Colorado-based candidates, in compliance with the Colorado Equal Pay for Equal Work Act, the salary range for this role is $95,000.00 - $130,000.00+ target bonus. DAT considers factors such as scope and responsibilities of the position, candidate's work experience, education and training, core skills, internal equity, and market and business elements when extending an offer.DAT embraces the value of a diverse workforce, and believes it is a core strength of our company that we encourage those values in every DAT employee, at every level of our organization, regardless of tenure or rank. We provide equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state, and local laws.Equal Opportunity Employer/Protected Veterans/Individuals With DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "go"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "DAT Director",
      "company": "The Paradigm Shifters (Team TPS)",
      "location": "United States",
      "url": "https://www.linkedin.com/jobs/view/dat-director-at-the-paradigm-shifters-team-tps-4313986417?position=5&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=%2Bq1Q1wYQzAHDn15cZVknTA%3D%3D",
      "post_date": "2025-09-22",
      "scraped_at": "2025-10-21T01:41:00.340849",
      "source": "public_api",
      "details": {
        "description": "🚀 About The Paradigm Shifters (TPS)We are building a next-generation public blockchain architecture powered by cutting-edge cryptography — including Zero-Knowledge Proof (ZKP) and witness encryption. By decoupling verification from computation, our protocol unlocks massive performance gains, modular flexibility, and privacy-preserving smart contract design.Our modular chain is purpose-built for developers — designed to support advanced use cases in payments, AI agents, and beyond. Backed by pioneers in the blockchain space, including the Neo Foundation, a globally distributed team of blockchain pioneers, PhDs, cryptographers, and researchers/engineers. We're preparing for launch — and looking for our visionary.Our Team includes around 20 people: Founder, Research & Consensus Engineering (13), Founding GTM, Founding P&T/Ops, Director of Marketing, Tech Content Writer🎯 The RoleWe are seeking a DAT Director to design, model, and optimize the economic framework of our chain, its native utility mechanisms, and future partnership technologies.This is a founding-level role: you will architect incentive structures, design community distribution frameworks, run simulations, and refine mechanisms post-launch. You'll collaborate across research, engineering, marketing, content, and BD to ensure the digital asset architecture aligns with protocol design, ecosystem growth, and long-term sustainability.🔨 What You'll DoBuild the full digital asset and governance architecture from scratch — including incentive design, distribution frameworks, and unlock schedulesCreate participation systems for validators, users, and developers that work in practiceRun economic modeling and simulations to pressure-test edge cases and stress-test system assumptionsIntegrate digital asset design seamlessly into protocol development with engineersDesign and operate both sides of grants: create programs for distributing ecosystem/community grants and structure frameworks for identifying, applying to, and receiving grants from partners, foundations, or research bodiesShape treasury strategy, DAO frameworks, and CEX/DEX participation modelsTrack and analyze ecosystem performance before and after launch, iterating quicklyStay on top of emerging research and industry practices, bringing in the best ideas while avoiding known pitfallsRequirements✅ Requirements8+ years in economics, finance, or decentralized systems; strong grounding in cryptography and mechanism design5+ years architecting digital asset economies, market mechanics, or decentralized resource frameworksProven track record building or advising on large-scale decentralized networks or labsDeep knowledge of game theory, incentive alignment, and governance mechanismsExperience structuring grants programs (outbound) and securing external grants/funding (inbound)Expertise in treasury design, DAO policy, exchange strategy, and liquidity architectureFamiliarity with regulatory considerations across jurisdictions (U.S., Cayman, APAC)Hands-on ability with data modeling/simulation; skilled in on- and off-chain analyticsComfort with early-stage chaos: fast pivots, limited resources, high ambiguityExcellent communicator — able to explain complex mechanics simplyPassion for building something new as part of a distributed founding team (California ↔ APAC)💎 Bonus PointsUnderstanding of how ZK technology impacts incentive and governance designPrior experience with L1, L2, or DeFi ecosystemsPublished research or whitepapers on digital asset economics or mechanism designExperience building governance systems or DAOsStartup experience — scrappy, creative, resourceful\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [],
        "industry": "Not specified"
      }
    },
    {
      "title": "AI SPECIALIST",
      "company": "Analytics Data Factory s.r.o.",
      "location": "Praha, TX",
      "url": "https://www.linkedin.com/jobs/view/ai-specialist-at-analytics-data-factory-s-r-o-4304373826?position=6&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=NIM0Om0cycB46kLTNWigDA%3D%3D",
      "post_date": "2025-09-24",
      "scraped_at": "2025-10-21T01:41:00.340849",
      "source": "public_api",
      "details": {
        "description": "Požadujeme Analytické a systematické myšlení nutnou podmínkou. Vhodný kandidát potřebuje silné analytické smýšlení a schopnost řešit problémy a čelit technickým výzvám. Schopnost dělat strategické rozhodnutí na základě dat a informací. Silné znalosti v oblasti umělé inteligence (AI) s hlubokým porozuměním konceptů, technologií a trendů v oblasti AI. Pokročilé znalosti v oblasti strojového učení a umělé inteligence. Kandidát by měl mít hluboké porozumění algoritmům strojového učení, zejména konvolučním neuronovým sítím (CNN), které jsou klíčové pro analýzu obrazových dat. Zkušenosti s analýzou obrazových dat. Praktické zkušenosti s vývojem a implementací modelů pro zpracování a analýzu obrazových dat, včetně detekce objektů, klasifikace a sledování objektů v reálném čase. Programovací dovednosti. Alespoň základní programovací schopnosti v jazycích jako je Python, a znalost knihoven a frameworků jako TensorFlow, Keras, PyTorch. Zkušenosti s big data. Zkušenosti s analýzou big data, včetně předzpracování dat, normalizace a augmentace dat. Zkušenosti s cloudovými platformami. Praktické zkušenosti s cloudovými službami (např. AWS, Azure, Google Cloud) pro škálování a efektivní zpracování dat. Vzdělání v příslušném oboru. Preferováno vysokoškolské vzdělání v oboru počítačových věd, inženýrství, matematiky, nebo příbuzném technickém oboru. Zkušenost se zaváděním AI ve firmě. Expertní porozumění AI (více než běžný uživatel), zaměření na technickou stránku, algoritmy a fungování AI. Schopnost komunikovat s technickými i netechnickými členy týmu, porozumět zavedenému stylu práce, vyhodnotit, zanalyzovat situaci a následně identifikovat oblasti ke zlepšení. Schopnost umět si obhájit a prosadit své návrhy. A umět je za pomocí ostatních členů týmu zrealizovat. Samostatnost a zodpovědný přístup Silná zainteresovanost na dosahování cílů. Schopnost pracovat efektivně v rychle se měnícím prostředí, se schopností reagovat na nové výzvy a příležitosti. Pracovní nasazení, týmový duch, časová flexibilita Prokazatelná schopnost komunikovat složité technické téma zřetelným, poutavým a srozumitelným způsobem jak pro technické, tak netechnické publikum. Zkušenosti s implementací a nasazením AI řešení jsou velkou výhodou. Zkušenosti s právními a etickými otázkami souvisejícími s AI, ochranou dat a souvisejícími předpisy. Komunikační dovednosti, jak písemné, tak ústní, v češtině tak angličtině.Nabízíme místo v dynamicky se rozvíjející společnosti inovativní tým, kde můžeš uplatnit svoji kreativitu. Vítáme chytré lidi, kteří se chtějí realizovat a plně rozvinout svůj potenciál. K výjimečným výsledkům potřebujeme výjimečné lidi – VÁS. lidský přístup a otevřenou komunikaci v rámci týmu a celé firmy. 5 týdnů dovolené odpovídající finanční ohodnocení možnost osobního růstu a rozvoje mobilní telefon a notebook příjemné prostředí s moderním zázemím a velmi atraktivní lokalitou v centru Prahy jazykové vzdělávání věrnostní odměnu za odpracované roky ve společnosti zaměstnanecké akceMám zájemZobrazit všechny volné pozice\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Keras",
          "TensorFlow",
          "PyTorch",
          "AWS",
          "Python",
          "Azure"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "BUSINESS ANALYST",
      "company": "Analytics Data Factory s.r.o.",
      "location": "Praha, TX",
      "url": "https://www.linkedin.com/jobs/view/business-analyst-at-analytics-data-factory-s-r-o-4304371898?position=7&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=fiQeZ3FsstVkBW0Ybw9l7A%3D%3D",
      "post_date": "2025-09-24",
      "scraped_at": "2025-10-21T01:41:00.342608",
      "source": "public_api",
      "details": {
        "description": "Požadujeme schopnost porozumět businessu, chovat se reprezentativně a být velmi komunikativní, aby bylo možné držet krok s klientem a jeho potřebami analytické a systematické myšlení nutnou podmínkouschopnost klást správné otázky vysoká organizovanost a schopnost rozhodovatschopnost rozpoznávat souvislosti, navrhovat alternativní řešení a umět zvolit to nejlepší schopnost vést svěřenou agendu a dotahovat úkoly do konceznalost systémů a dat z oblasti pojišťovnictví a bankovnictví výhodouchuť do práce, komunikativnost, týmovost, proklientský přístup výhodou je základní přehled o IT, konkrétně o tom, jak je projekt realizovánsamostatnost a zodpovědný přístup pracovní nasazení, časová flexibilita, loajálnost zkušenosti s UML praktická zkušenost práce ve vizuálním jazyce – kreslit diagramy a schémata zkušenosti s prací v MS Visio, Enterprise Architect, PowerDesigner, Vizuální paradigma atd. zkušenost s vytvářením diagramů use casů, diagramů tříd, diagramů procesů atd. zkušenosti s prací v MS Office (Word, Excel, PowerPoint, Outlook)NabízímeAnalytics Data Factory je mladou dynamickou a flexibilní společností, která těží ze zkušenosti s poskytováním služeb v oblasti data managementu a informačních systémů. Nabízíme svým zaměstnancům pozitivní pracovní prostředí, zázemí stabilní společnosti a možnost profesního růstu. Jste kreativní, otevřeni novým myšlenkám a nápadům, máte chuť se realizovat? Neváhejte a přidejte se k nám!místo v dynamicky se rozvíjející společnosti odpovídající finanční ohodnocení možnost osobního růstu a rozvoje účast na výjimečných projektech pro top hráče českého bankovnictví/pojišťovnictvíMám zájemZobrazit všechny volné pozice\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [],
        "industry": "Not specified"
      }
    },
    {
      "title": "Data Analyst",
      "company": "Delphinus Engineering, Inc.",
      "location": "Bethesda, MD",
      "url": "https://www.linkedin.com/jobs/view/data-analyst-at-delphinus-engineering-inc-4308781870?position=8&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=nnH%2FmjK%2BrS0yQPMNU6F9Fg%3D%3D",
      "post_date": "2025-10-06",
      "scraped_at": "2025-10-21T01:41:00.342608",
      "source": "public_api",
      "details": {
        "description": "DescriptionSALARY RANGE: $80,000 - $85,000 per yearIn determining compensation, various factors will be considered, including but not limited to, educational background; relevant experience, knowledge, skills, and abilities, market factors; and geographic location.GENERAL SUMMARY: Provide Data Analysis support for the United States Navy (USN) CBM (condition-based maintenance) program for Hull, Mechanical, and Electric (HM&E) equipment. This position will work directly with Senior Data Scientists to apply data science, machine learning, statistical modeling, and/or data visualization principles and techniques in the development of digital solutions in support of machinery condition assessment for USN HM&E equipment.LOCATION: Naval Surface Warfare Center, Carderock, West Bethesda, MD (Potential candidates should be within a 30 mile radius of Bethesda, MD.)Education (required)Bachelor’s degree in an Engineering DisciplineIn lieu of a Bachelor’s degree in an Engineering Discipline, two (2) years of experience in related workSkill Sets (recommended/Preffered)Analysis of Government-provided data and building a database from the data (Preferably in Flank Speed Power BI if someone on your team has the skillset)Tracking/organizing incoming data and keeping the database currentAssistance in analyzing/reviewing test plansUpdating Navy documents such as mil specs, NSTM chapters, or NAVSEA Standard ItemsSupporting knowledge management by assisting in the organizing of Government-provided data and reportsExperience with Python in the application of data analysis, data management and/or machine learningExperience in statistics and statistical analysisInterest in data analytics, data visualization, and/or machine learningSelf-starter, willing to work alone and in a groupAbility to provide clear and concise feedback to solve problems as they ariseSpecial RequirementsSuccessful applicants must either have an active government security clearance or meet the requirements to obtain a clearance.Req Number DAT-25-00001About the Organization Founded in 1994 as a small, diversified professional services company, Delphinus today employs more than 650 professional and technical personnel supporting a customer base that spans the Defense and Federal markets.Headquartered in Newtown Square, PA, we have primary offices in Norfolk, VA; San Diego, CA; and Bremerton, WA.Company Benefits*: Comprehensive health program for employee and dependents Company paid Dental and Vision 401(k) with company match Short-term and Long-term disability - Company paid Life Insurance and AD&D - Company paid Voluntary Spouse and Child Life Insurance Paid time off with company holiday Tuition Reimbursement Employee Assistance Program (EAP)Benefit eligibility is set forth in benefit plan documents and organization policies.EOE Statement We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status or any other characteristic protected by law.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Power BI",
          "Python"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Pedagogisch Medewerker BSO de Leemkuil – Laren",
      "company": "Docentenmarktplaats.nl",
      "location": "Hillsborough County, NH",
      "url": "https://www.linkedin.com/jobs/view/pedagogisch-medewerker-bso-de-leemkuil-%E2%80%93-laren-at-docentenmarktplaats-nl-4300433560?position=9&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=QOYsqcvIcOMq0L0XpkCBLg%3D%3D",
      "post_date": "2025-09-15",
      "scraped_at": "2025-10-21T01:41:00.342608",
      "source": "public_api",
      "details": {
        "description": "Omschrijving organisatieMet circa 2000 medewerkers verspreid over 200 locaties door heel Nederland zijn we goed vertegenwoordigd in onze branche. Ondanks de omvang weten we regionaal gezien onze eigenheid te behouden. En dat merk je als je bij ons werkt. Omdat onze organisatie flink groeit en ontwikkelt, krijgen onze collega's volop de ruimte om zelf te ondernemen, nieuwe ideeën uit te werken en vooral te doen waar ze goed in zijn en plezier in hebben.Zoals wij op onze kinderopvang en binnen onze (jeugd)zorg ruimte en aandacht bieden aan ieder individu, zo geven wij ook onze collega's de ruimte en aandacht die nodig is. Wij geloven dat iedereen unieke kwaliteiten heeft en ervaren dagelijks dat we elkaar daarin aanvullen. Bij ons mag je jezelf zijn omdat wij weten dat je alleen dan tot het beste resultaat komt. Voor jezelf en voor de organisatie.Stichting Meander-Prokino wil een organisatie zijn waar iedereen zich thuis voelt, gewaardeerd wordt en kan meedoen op elk niveau. Daarnaast willen we een afspiegeling zijn van de samenleving, zodat zowel werknemers als klanten zich in onze organisatie kunnen herkennen.FunctieomschrijvingWij nodigen u alleen uit te solliciteren als u een diploma heeft voor onderwijsassistent of Pabo. Andere sollicitaties zullen niet in behandeling worden genomen.Kom jij ons leuke team versterken?Wanneer de dag begint met het vrolijke geschater van kinderen, dan heb jij een goede dag. Als pedagogisch medewerker bij Prokino Kinderopvang bied jij kinderen van 4 tot 12 jaar na school een fijne, veilige plek waar ze plezier hebben. Iedere dag ga jij met energie aan de slag!Samen met je collega’s vang je maximaal 40 kinderen op in twee basisgroepen bij de Leemkuil in Laren. Onze locatie is gevestigd in de Larense Montessorischool (LMS) te Laren. Een prachtig historisch gebouw met de oudste vleugel daterend uit 1924. Er zijn op deze locatie verschillende hoeken verdeeld over twee lokalen. Te denken valt aan een bouwhoek, een poppenhoek, een huishoek en alle ruimte om spelletjes te spelen en te knutselen. We mogen ook gebruik maken van de keuken en de gymzaal van school om leuke activiteiten te verzorgen. Buitenspelen kunnen we hier ook fantastisch doen. We hebben verschillende pleinen in een mooie tuin omgeven door veel hoge bomen. Ook is er een uniek openlucht amfitheater. Op deze unieke BSO locatie kunnen ze onbevangen spelen of juist helemaal tot rust komen.Bij Prokino de Leemkuil staan we elke dag klaar voor de kinderen én voor elkaar. Als team vinden wij samen leren en plezier maken het allerbelangrijkste. Wij hebben hier per direct een plek vrij voor twee enthousiaste collega's voor minimaal drie middagen (12 uur) tot vier middagen (16 uur) per week. Wij kunnen ook een combinatie maken met onze peuterspeelzaal in Laren waar in de ochtenden gewerkt kan worden.Dit ga je doenDe Glimlach Op Het Gezicht Van De Kinderen, Die Heb Jij Daar Getoverd! En Dat Geeft Je Een Geweldige Energieboost. Dagelijks Onderneem Je Samen Met De Kinderen De Leukste Activiteiten, Zowel Binnen Als Buiten. Je Laat Je Inspireren Door Activiteitenplatform DoenKids, Bedenkt Het Zelf Of Laat Ze Gewoon Hun Eigen Gang Gaan. Jouw Deskundigheid Is Hierin Het Belangrijkste. Je Moedigt De Kinderen Aan In Hun Ontwikkeling En Houdt Daarbij Rekening Met Ieders Tempo. Jijbent creatief en ondernemend en daardoor goed in het organiseren van leuke uitjes voor de BSO kinderen;voelt aan wat de kinderen nodig hebben en helpt hen met een positief zelfbeeld;wil een bijdrage leveren aan de ontwikkeling van kinderen;stimuleert kinderen tot spelen en leren, met én van elkaar;werkt goed samen en helpt je collega’s wanneer ze hun handen vol hebben;zorgt voor een positieve en veilige sfeer;bent een open en prettig aanspreekpunt voor ouders.“In de omgang met de kinderen heb ik het talent om de kinderen ruimte te geven voor hun creativiteit.” - Sharon, Pedagogisch medewerkerHier ben jij een pro inKinderen Maken Jou Blij. Je Hebt Frisse Ideeën Voor Activiteiten, Bent Creatief En Kan Improviseren Wanneer Nodig. Ook Zie Je Talent In Ieder Kind En Stimuleer Je Ze Om Dit Verder Te Ontdekken. Verder Kun Je Zeggendat je een pedagogisch diploma op zak hebt. Bijvoorbeeld mbo SPW 4, sport & bewegen of muziek opleiding (controleer je diploma op Diplomacheck Kinderopvang Werkt! );dat je goed Nederlands spreekt en voldoet aan de taaleis 3F mondelinge taalvaardigheid, voor de deelvaardigheden spreken, luisteren en gesprekken voeren;dat je bruist van de energie en staat te popelen om aan de slag te gaan!Hier zorgen wij voorWerken Bij Prokino Betekent Niet Alleen Dat Je Kinderen Op De Opvang Een Fijne Dag Bezorgt. Je Stimuleert Hen Ook In Hun Ontwikkeling. Daarbij Vinden We Het Belangrijk Dat Ook Jij Kan Groeien. We Geven Je Daarom Alle Vrijheid Om Je Werk Binnen Onze Kaders Vorm Te Geven Én De Ruimte Om Je Eigen Talenten Te Ontwikkelen. Zo Kan Je Regelmatig Een Training Volgen. Zodat Jij Steeds Beter Wordt In Wat Je Doet, En Blij Wordt Van Je Werk. Alleen Zo Kunnen We Samen De Allerbeste Opvang Bieden. Verder Bieden We Jeeen fijne werksfeer en een warm onthaal door je nieuwe collega’s die er net zo veel zin in hebben als jij;een contract voor 12 tot 16 uur per week voor 3 of 4 middagen, na een halfjaar vast contract;bij Prokino profiteer je ook van leuke en aantrekkelijke personeelskortingen via de Benefits at Work-app;leuke attenties op feestdagen en andere speciale dagen zoals de dag van de pedagogisch medewerker;voorrang op de wachtlijst voor kinderopvang wanneer jouw eigen kinderen van de opvang van Prokino gebruik gaan maken;Arbeidsvoorwaarden Volgens De CAO Kinderopvanginschaling is schaal 6 min. € 2641 en max. € 3630 bruto per maand op fulltime basis;eindejaarsuitkering van 5,5% en 8% vakantiegeld, reiskostenvergoeding en fietsplan;toeslag voor de zorgverzekering en op de aanvullende verzekering.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [],
        "industry": "Not specified"
      }
    },
    {
      "title": "Product Manager",
      "company": "DAT Freight & Analytics",
      "location": "Seattle, WA",
      "url": "https://www.linkedin.com/jobs/view/product-manager-at-dat-freight-analytics-4284477250?position=10&pageNum=0&refId=RSR95mlkIXZzMUnziD8gbA%3D%3D&trackingId=AxgPkN%2B%2Fgje1YMFFpKSMKQ%3D%3D",
      "post_date": "2025-10-13",
      "scraped_at": "2025-10-21T01:41:00.342608",
      "source": "public_api",
      "details": {
        "description": "About DATDAT is an award-winning employer of choice and a next-generation SaaS technology company that has been at the leading edge of innovation in transportation supply chain logistics for 45 years. We continue to transform the industry year over year, by deploying a suite of software solutions to millions of customers every day - customers who depend on DAT for the most relevant data and most accurate insights to help them make smarter business decisions and run their companies more profitably. We operate the largest marketplace of its kind in North America, with 400 million freights posted in 2022, and a database of $150 billion of annual global shipment market transaction data. Our headquarters are in Denver, CO, and Beaverton, OR, with additional offices in Seattle, WA; Springfield, MO; and Bangalore, India. For additional information, see www.DAT.com/company Job Application Deadline: 11/30/2025About Product at DAT - Shaping the Future of Freight AnalyticsAt DAT, we're building the go-to destination for freight pricing and insights. As the freight industry undergoes major shifts—driven by AI, autonomous vehicles, and political changes—we help our customers execute smarter, faster decisions. As a Product Manager on the iQ team, you’ll shape the data and tools that power those decisions, working at the intersection of strategy and real-world impact. We follow leading product practices inspired by the Silicon Valley Product Group (SVPG), giving you the structure and support to drive meaningful outcomes. If you’re passionate about building great products and ready to make a difference in the freight industry, we’d love to talk.Position OverviewAs an iQ Product Manager at DAT, you will be at the forefront of driving our product vision to reality. You will be accountable for working closely with your empowered product team partners (Product, UX, Tech Lead) to discover and define the best path forward. You will then execute your strategies to deliver high-performing solutions that our customers love, achieve ambitious Objectives and directly contribute to significant business growth.Shape the Future: Collaborate with your empowered product team (Product, UX, Tech Lead) to envision, define, and drive the strategy for your iQ products, ensuring they solve critical customer problems and achieve ambitious business goals.Become the Expert: Immerse yourself in understanding our users, the market landscape and the power of our enormous data set to identify new growth opportunities.Drive Impact: Analyze user behavior and data to uncover actionable insights that fuel product decisions and prioritization.Collaborate and Inspire: Foster strong partnerships within your team and across the organization, evangelizing the product vision and strategy to stakeholders and inspiring them to achieve shared success.What You’ll BringProven Leadership & Collaboration: You have a track record of inspiring and motivating cross-functional teams to achieve ambitious goals, fostering strong partnerships along the way.End-to-End Product Success: You've demonstrated success in taking impactful, growth-oriented products from concept to launch and beyond, with a strong understanding of the entire product lifecycle.Strong Foundation: You possess a Bachelor's degree (MBA preferred) in a relevant field and have honed your analytical and problem-solving skills over at least 5 years in progressive product management roles.Product Development Expertise: You're well-versed in modern product discovery and optimization techniques, ideally with experience applying the SVPG Product Operating Model to deliver exceptional customer value.Exceptional Communication & Influence: Your written and verbal communication skills are top-notch, allowing you to clearly articulate your vision, build strong stakeholder relationships, and influence decision-making across the organization.Bonus Points: Experience launching AI-powered product features and deep industry knowledge in transportation and logistics will give you a significant advantage.Why You Should Join UsShape the Future: Drive innovation in freight analytics, influence strategic decisions and define the next generation of our product offerings.Grow Your Career: Thrive in a dynamic Product Operating Model environment with ample opportunities for professional development and hands-on learning.Be Part of Something Great: Join a collaborative team that values excellence, continuous learning, delivering exceptional customer value and having fun while building impactful products that drive business success.Why DAT?DAT is an award winning employer of choice.For starters, we have a hybrid work environment, but we also know what makes a great workplace. We have a time-tested and resolute set of operating values predicated on integrity, mutual respect, open communication, and executing with excellence. These values inform our strategic vision as much as any one of our products does. We’ve been an employer of choice in the Portland metropolitan area for four decades, and within one year of opening our Denver office, DAT was #26 on Built In Colorado’s 100 Best Places to Work In Colorado.Medical, Dental, Vision, Life, and AD&D insuranceParental LeaveUp to 20 days of paid time off starting in year oneAn additional 10 holidays of paid time off per calendar year401k matching (immediately vested)Employee Stock Purchase PlanShort- and Long-term disability sick leaveFlexible Spending AccountsHealth Savings AccountsEmployee Assistance ProgramAdditional programs - Employee Referral, Internal Recognition, and WellnessFree TriMet transit pass (Beaverton Office)Competitive salary and benefits packageWork on impactful projects in a cutting-edge environmentCollaborative and supportive team cultureOpportunity to make a real difference in the trucking industryEmployee Resource GroupsThis position is not eligible for visa sponsorship**.For Colorado-based candidates, in compliance with the Colorado Equal Pay for Equal Work Act, the salary range for this role is $95,000.00 - $130,000.00+ target bonus. DAT considers factors such as scope and responsibilities of the position, candidate's work experience, education and training, core skills, internal equity, and market and business elements when extending an offer.DAT embraces the value of a diverse workforce, and believes it is a core strength of our company that we encourage those values in every DAT employee, at every level of our organization, regardless of tenure or rank. We provide equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state, and local laws.Equal Opportunity Employer/Protected Veterans/Individuals With DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "go"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Software Engineer Level 1",
      "company": "IntelliGenesis LLC",
      "location": "Annapolis Junction, MD",
      "url": "https://www.linkedin.com/jobs/view/software-engineer-level-1-at-intelligenesis-llc-4265286748?position=1&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=jarecufi5UzAhTDsYjqN2g%3D%3D",
      "post_date": "2025-07-11",
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "Responsibilities:Ability to develop, maintain, and enhance complex and diverse software systems (e.g., processing-intensive analytics, novel algorithm development, manipulation of extremely large data sets, real-time systems, and business management information systems) based upon documented requirementsAbility to work individually or as part of a team review and test software components for adherence to the design requirements and documents test results and resolve software problem reportsAbility to utilize software development and software design methodologies appropriate to the development environmentAbility to provide specific input to the software components of system design to include hardware/software trade-offs, software reuse, use of Commercial Off-the-shelf (COTS)/Government Off-the-shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software componentsCommunicate with broader DAT, QC, CNO, and agency teams to identify alternative, or existing solutions. Take advantage of opportunities to attack common development problems together Required Skills:US Citizens OnlyTS/SCI with Polygraph requiredThree (3) years experience as a SWE, in programs and contracts of similar scope, type, and complexity is required. Bachelors degree in Computer Science or related discipline from an accredited college or university is required. Four (4) years of additional SWE experience on projects with similar software processes may be substituted for a Bachelors degreeExperience analyzing user requirements to derive software design and performance requirementsExperience designing and coding new software or modifying existing software to add new featuresAbility to debug existing software and correct defectsExperience integrating existing software into new or modified systems or operating environmentsExperience developing simple data queries for existing or proposed databases or data repositoriesExperience providing recommendations for improving documentation and software development process standardsExperience developing or implementing algorithms to meet or exceed system performance and functional standardsAbility to assist with developing and executing test procedures for software componentsExperience writing or reviewing software and system documentationExperience developing software solutions by analyzing system performance standards, confer with users or system engineers; analyze systems flow, data usage and work processes; and investigate problem areasExperience serving as team lead at the level appropriate to the software development process being used on any particular projectExperience modifying existing software to correct errors, to adapt to new hardware, or improve its performanceAbility to design, develop and modify software systems, using scientific analysis and mathematical models to predict and measure outcome and consequences of designExperience designing or implementing complex database or data repository interfaces/queriesSome combination of UI/UX, middleware/API, back-end, DevOps, CNO, and data science experience with a heavy interest in user experience Compensation Range: $76,142.48 - $184,026.39_____________________________________________________________________________________________________Compensation ranges encompass a total compensation package and are a general guideline only and not intended as a guaranteed and/or implied final compensation or salary for this job opening. Determination of official compensation or salary relies on several different factors including, but not limited to: level of position, complexity of job responsibilities, geographic location, candidate’s scope of relevant work experience, educational background, certifications, contract-specific affordability, organizational requirements and alignment with local market data. Our compensation includes other indirect financial components designed to support employees’ total well-being, which should be considered when evaluating our competitive benefits package. These monetary benefits include medical insurance, life insurance, disability, paid time off, maternity/paternity leave, 401(k) company match, training/education reimbursements and other work/life programs._____________________________________________________________________________________________________IntelliGenesis is committed to providing equal opportunity to all employees and applicants for employment. The Company is an Equal Opportunity Employer (EOE), and as such, does not tolerate discrimination, retaliation, or harassment of its employees or applicants based upon race, color, religion, gender, sexual orientation, national origin, age, genetic information, disability, or any other protected characteristic under local, state, or federal law in any employment practice. Such employment practices include, but are not limited to: hiring, promotion, demotion, transfer, recruitment, or recruitment advertising, selection, disciplinary action layoff, termination, rates of pay, or other forms of compensation and selection of training.IntelliGenesis is committed to the fair and equal employment of individuals with disabilities. It is the Company’s policy to reasonably accommodate qualified individuals with disabilities unless the accommodation would impose an undue hardship on the organization. In accordance with the Americans with Disabilities Act (ADA) as amended, reasonable accommodations will be provided to qualified individuals with disabilities, when such accommodations are necessary, to enable them to perform the essential functions of their jobs or to enjoy the equal benefits and privileges of employment. This policy applies to all applicants for employment and all employees.Powered by JazzHRP54LXB6GDU\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [],
        "industry": "Not specified"
      }
    },
    {
      "title": "Data manager (m/v/x)",
      "company": "FARO. Vlaams steunpunt voor cultureel erfgoed",
      "location": "Tulsa, OK",
      "url": "https://www.linkedin.com/jobs/view/data-manager-m-v-x-at-faro-vlaams-steunpunt-voor-cultureel-erfgoed-4317308439?position=2&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=q2iCm9hVkqTE%2BQv%2F1fjF%2Bg%3D%3D",
      "post_date": null,
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "FunctieomschrijvingHet KMMA is een centrum van kennis en hulpbronnen in verband met Afrika, in het bijzonder Centraal-Afrika, in een historische, hedendaagse en mondiale context. Het museum stelt unieke collecties tentoon. Het is een plaats van herinnering aan het koloniale verleden en streeft ernaar een dynamisch platform te zijn voor uitwisselingen en dialoog tussen culturen en generaties.Het Wetenschappelijk Instituut Is Onderverdeeld In Drie Departementen:Culturele Antropologie en GeschiedenisAardwetenschappenBiologieIn dit kader speelt het KMMA ook een sleutelrol in het behoud en de valorisatie van geologische en mijnbouw archieven met betrekking tot de Democratische Republiek Congo (DRC) die in het museum worden bewaard. Deze valorisatie wordt nu versneld door de betrokkenheid van het KMMA bij het Europese project PanAfGeo+.Deze vacature betreft een functie binnen het departement Aardwetenschappen.Deze vacature kadert in een grootschalig project rond de valorisatie van archieven en heeft betrekking op de implementatie van een verwerkingsketen voor de classificatie van gegevens die uit een groot volume gedigitaliseerde documenten worden gehaald. Deze documenten zijn bestemd voor operationeel gebruik door archivarissen en geologen binnen het project, in samenwerking met Congolese instellingen. De beoogde OCR-tools zijn, in eerste instantie, Tesseract, in combinatie met modellen die toegankelijk zijn via de API's Transformer en Hugging Face voor handgeschreven teksten.De Aangeworven Kandidaat Moet:de fysieke documenten analyseren om een dataset samen te stellen waarmee de modellen kunnen worden getest.de modellen testen en identificeren – beoordelen of de inferentie kan beginnen op basis van vooraf getrainde modellen of dat er specifieke training of verfijning van de modellen nodig is, en opzetten van die training of verfijning indien nodig.instaan voor het definiëren en implementeren van een verwerkingsketen die de processen automatiseert op basis van digitalisering of gescande bestanden, waarbij er verschillende software-architecturen mogelijk zijn (server met API; directe verzending van bestanden, gegevensverzameling via werkstations).de beschikbare hardwarebronnen evalueren en de aanschaf van extra materiaal plannen om het project bij het MRAC en bij de projectpartners te kunnen uitvoeren.de geproduceerde gegevens indexeren en classificeren met het oog op hun invoering in PMB (target OPAC), zodat de archivarissen en geologen binnen het project de kwaliteit van de gegevens kunnen beoordelen en de definitieve validatie kunnen uitvoeren:trefwoorden uit de gegevens halen en indexeren om het zoeken tijdens de voorbereiding van de gegevens en in de target OPAC te vergemakkelijken,bestaande ontologieën en thesauri identificeren en relevante gegevens daaraan koppelen,de gegevens opmaken en voorbereiden voor batchgewijze invoer in de target OPAC.Deze functie biedt een boeiende kans om een belangrijke bijdrage te leveren aan de exploratie en analyse van unieke geologische archieven over de DRC, met het oog op hun valorisatie in samenwerking met instellingen uit dat land. Dit initiatief past in de missie van het KMMA, die er onder meer op gericht is de toegang tot zijn collecties te verbeteren en langdurige wetenschappelijke samenwerking te ontwikkelen. Het doel is om zijn wetenschappelijk erfgoed te delen met het oog op het versterken van het economisch potentieel van de DRC in de dynamische context van de energietransitie.Het KMMA zet zich in om al zijn medewerkers in staat te stellen hun volledige potentieel te benutten. We bevorderen en handhaven een inclusieve en gunstige omgeving zodat al onze medewerkers zich kunnen ontplooien.ResultaatsgebiedenDe Aangeworven Kandidaat Moet:in teamverband werken en ervoor zorgen dat zijn/haar werk past in het geheel van taken.meewerken aan het versterken van de expertise van de leden van de Afrikaanse partnerteams.WerkgeverEr is 1 plaats bij het Koninklijk Museum voor Midden-Afrika (adres: Leuvensesteenweg 13, 3080 Tervuren). De activiteitengroep is: I. Wetenschappelijk onderzoek en experimentele ontwikkeling.Het departement Aardwetenschappen is een enthousiast team van medewerkers die hoogstaand wetenschappelijk onderzoek verrichten, vooral in Centraal-Afrika. Ze steunen hun onderzoek op terreinwerk en op unieke historische collecties van gesteenten, ertsen, mineralen, cartografische documenten, luchtfoto's en archieven.Het AfricaMuseum wil een wereldwijd centrum zijn voor onderzoek en verspreiding van kennis over de vroegere en huidige samenlevingen en natuurlijke omgevingen van Afrika, en in het bijzonder van Midden-Afrika. Het wil zowel bij het grote publiek als bij de wetenschappelijke gemeenschap begrip en interesse voor deze regio wekken en via partnerschappen een belangrijke bijdrage leveren aan de duurzame ontwikkeling ervan. De belangrijkste activiteiten van deze op Afrika gerichte instelling bestaan dan ook uit het verwerven en beheren van collecties, het uitvoeren van wetenschappelijk onderzoek, het implementeren van de resultaten van dat onderzoek, het verspreiden van kennis en het organiseren van tentoonstellingen van haar collecties.Koninklijk Museum voor Midden-Afrika - Tervuren - BelgiëFunctieprofielGedragsgerichte competentiesWerken in een multidisciplinair team bestaande uit geologen, archivarissen, gegevensbeheerders en geomatici in het kader van een internationaal project met Congolese en Europese partners.Prioriteiten kunnen stellen en deadlines halen.Innovatieve en creatieve ideeën aandragen. beslissingen nemen op basis van (on)volledige informatie en gerichte acties ondernemen om deze beslissingen uit te voeren.Actief bijdragen aan de ontwikkeling van teamgeest door op constructieve wijze meningen te delen, te luisteren en in dialoog te gaan.Interne en externe gebruikers op een transparante, eerlijke en objectieve manier ondersteunen door een persoonlijke service te bieden en constructieve contacten te onderhouden.Gesprekspartners adviseren en een vertrouwensrelatie met hen opbouwen op basis van je expertise. integer handelen, in overeenstemming met de verwachtingen van de organisatie, vertrouwelijkheid en afspraken respecteren en elke vorm van partijdigheid vermijden.Je eigen ontwikkeling actief plannen en beheren op basis van je mogelijkheden, interesses en ambities, door je eigen functioneren kritisch in vraag te stellen en je voortdurend te verrijken met nieuwe ideeën en benaderingen, vaardigheden en kennis.Technische competentiesDe Aangeworven Kandidaat Moet:een goede kennis hebben van relationele databases en de taal SQL (MySQL/MariaDB en/of PostgreSQL),een goede kennis hebben van Python,over een goede kennis van het Frans beschikken, wat noodzakelijk is voor het werken met de archieven en voor mogelijke contacten met Congolese collega's.De aangeboden functie staat wel open voor kandidaten van beide taalgroepen (NL en FR).TroefErvaring met het ontwikkelen van een webframework.Ervaring met het implementeren van machine learning-tools (neurale netwerken en LLM) op het gebied van OCR, zoals TensorFlow, PyTorch en het Transformers-framework.Ervaring op het gebied van computerontologieën en het semantische web (bijvoorbeeld OWL, LinkML XML/RDF, SPARQL).Ervaring op het gebied van GIS (ESRI ArcGIS of QGIS, PostGIS, WMS/WFS).Kennis van de Javascript-bibliotheken OpenLayers of Leaflet is relevant.Kennis van CMS of OPAC Web (het project maakt gebruik van PMB, maar ervaring met Drupal, Wordpress, Koha, OMEKA en/of soortgelijke programma's is relevant).Kennis van bibliotheken en technieken voor beeldverwerking, segmentatie en thresholding (bijv. OpenCV) en CUDA is een pluspunt.Kennis van Git of andere versiebeheertools.Kennis van JavaScript.Kennis van de IIIF-beeldstandaard.Kennis van concurrerende en asynchrone informatica.Het vermogen om kennis te delen, bijvoorbeeld in opleidingen.Affiniteit m.b.t. valorisatie van wetenschappelijk erfgoedVereist diploma op de uiterste inschrijvingsdatumDe kandidaat moet houder zijn vaneen masterdiploma in de wetenschappen met een expertise/ervaring in informatica ofeen masterdiploma informatica of datawetenschappen (bij voorkeur met een interesse/kennis van het geologisch vakjargon)Wil je solliciteren maar is jouw diploma niet in het Nederlands? Neem contact op met de persoon die vermeld staat in “Contacten” (selectieprocedure) om te weten of je een taaltest moet afleggen: artikel 7 - niveau 1/A. Indien van toepassing, kan je je registreren door op de volgende link te klikken.Het behalen van het taalcertificaat is een voorwaarde voor selectie. Schrijf je dus zo snel mogelijk in voor de taaltest.AanwervingsvoorwaardenAls je geslaagd bent voor deze selectie, moet je – om aangeworven te worden – op de aanstellingsdatum voldoen aan volgende voorwaarden:de burgerlijke en politieke rechten genieten,een gedrag hebben dat in overeenstemming is met de eisen van de beoogde betrekking,aan de dienstplichtwetten voldaan hebben,houder zijn van de vereiste diploma(’s),voldoen aan de speciale bekwaamheden en vereisten die zijn vastgesteld in het functieprofielAanbodJe wordt aangeworven voor een bepaalde duur (geschatte duur van 30 maanden) als assistent in de overeenstemmende weddeschaal SW10. Het betreft een voltijdse tewerkstelling. Contract wordt toegekend onder voorwaarde van het verkrijgen van de budgetten (wordt bevestigd oktober 2025).Minimumbezoldiging: 46.435,92 EUR SW10 (bruto jaarwedde tegen het huidige indexcijfer, reglementaire toelagen niet inbegrepen).We bieden jou een boeiende job met impact op mens en maatschappij, met tal van voordelen:Goede balans tussen werk en privéglijdende werkuren in een 38-uren weekmogelijkheid om eventuele overuren in recup op te nemenmogelijkheid tot telewerk26 dagen verlof en vrij tussen Kerst en Nieuwjaarbereikbaar met het openbaar vervoerTalrijke ontwikkelingsmogelijkhedenuitgebreid opleidings- en leeraanbod (te volgen tijdens de werkuren)Financiële voordelenmogelijkheid tot het krijgen van een tweetaligheidspremievoordelige hospitalisatieverzekeringaanvullend pensioenplan (tweede pijler)gratis woon-werkverkeer met het openbaar vervoermaaltijdchequesmogelijkheid tot het krijgen van een telewerkpremiemogelijkheid om een fietsvergoeding te krijgenvoordelen en interessante aanbiedingen via Benefits@Workallerlei sociale voordelenPraktische informatieProcedureStap 1 – Controle van de deelnemingsvoorwaardenJe wordt toegelaten tot de selectieprocedure als je voldoet aan alle toelatingsvoorwaarden. De selectiecommissie controleert je kandidatuur op basis van de documenten die je hebt ingediend. De commissie beslist of je titels, verdiensten en ervaring overeenstemmen met de vereisten voor de vacature. Zo ja, dan word je uitgenodigd voor de volgende stap.Afhankelijk van het aantal kandidaturen kan de selectiecommissie beslissen om het aantal kandidaten dat doorgaat naar de volgende stap te beperken door de meest geschikte profielen te weerhouden.Stap 2 –InterviewDeze test wordt georganiseerd in de eerste helft van november 2025 in het Africamuseum (adres: Leuvensesteenweg 13, 3080 Tervuren). Voor praktische details ontvang je een e-mail van een van onze medewerkers.Tijdens het gesprek wordt beoordeeld of je gedrags- en technische vaardigheden voldoen aan de functievereisten. Er wordt ook gevraagd naar je motivatie, interesse en affiniteit met het vakgebied.In geval van afwezigheidAls Je Afwezig Bent Op Het Sollicitatiegesprek, Word Je Automatisch Uitgesloten Van De Rest Van De Selectieprocedure, Tenzij Je Binnen Drie Dagen Kunt Aantonen Dat Je Afwezigheid Gerechtvaardigd Was Om Één Van De Volgende Redenen:ziektenoodsituatie waarbij een lid van het gezin (= elke persoon die met de kandidaat samenwoont) of familie (= de echtgenoot van de kandidaat of de persoon met wie de kandidaat wettelijk samenwoont, familieleden van de kandidaat in de eerste of tweede graad) betrokken isnoodzakelijke aanwezigheid op het werkonderbreking of vertraging van het openbaar vervoer van minstens dertig minutenovermachtIndien nodig, kan je, binnen de 10 dagen na datum van de bovengenoemde hoorzitting, vragen om te worden gehoord door de commissie. Een nieuwe datum zal dan worden voorgesteld.NotificatieAls je in een bepaalde stap niet slaagt, wordt de procedure beëindigd en word je niet meer uitgenodigd voor de volgende onderdelen van dezelfde selectie. Voor elke stap ontvang je een bericht met het resultaat.Gelijke kansen en redelijke aanpassingenDe Federale overheid voert een actief diversiteitsbeleid. Heb je een handicap, een leerstoornis of een ziekte? Dan kom je mogelijks in aanmerking voor een aanpassing van de selectieprocedure. Neem contact op met de persoon die vermeld staat in “Contacten”.Mogelijke voorzieningen voor personen die zwanger zijn of die borstvoeding gevenBen je zwanger of geef je borstvoeding ? Ook dan kan je mogelijke voorzieningen aanvragen. Neem contact op met de persoon die vermeld staat in “Contacten”.EindresultaatAls je geslaagd bent? Aan het einde van de selectieprocedure wordt een lijst van geslaagden, niet gerangschikt, gevormd. Deze bestaat uit personen die het meest geschikt worden geacht om de functie uit te oefenen in overeenstemming met de deelnemingsvoorwaarden. Er wordt een lijst van geslaagden opgesteld die 1 jaar geldig blijft.Solliciteren?Stuur Jouw Kandidatuur Per E-mail Naar Hr-rh@africamuseum.be Met Vermelding In Het Onderwerp Van De Selectiereferentie ‘data Manager’. Je Kandidatuur Dient Te Bestaan Uit:een recente cv in het Nederlandseen motivatiebriefeen kopie van vereiste diploma’(s) met al zijn bijlage. Indien deze diploma’s, of één ervan, werden uitgereikt in een andere taal dan het Nederlands, Frans, Duits of Engels dient daarvan bij het voorgelegde dossier tevens een vertaling te worden toegevoegdelk ander document waaruit je relevante ervaring blijkt, zoals:attesten om de wetenschappelijke activiteiten te wettigen (attesten afgeleverd door de werkgevers, de autoriteiten die beurzen toekenden, …)een lijst van de eventueel gepubliceerde wetenschappelijke werkenJe kan je kandidatuur indienen tot en met 20/11/2025.De kandidaturen die niet voldoen aan bovenstaande procedure worden niet weerhouden.ContactenOver de jobinhoud: François Kervyn de Meerendré, francois.kervyn@africamuseum.be / Camille François, camille.francois@africamuseum.be / Florias Mees, florias.mees@africamuseum.be / Franck Theeten, franck.theeten@africamuseum.beOver de selectieprocedure: Sara Tock, HR verantwoordelijke, 02/769 54 32, sara.tock@africamuseum.be. Als je een redelijke aanpassing van de selectieprocedure wilt aanvragen of faciliteiten wilt krijgen in verband met je zwangerschap of borstvoeding, kun je contact opnemen met dezelfde persoon.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "TensorFlow",
          "PyTorch",
          "Python",
          "MySQL",
          "PostgreSQL",
          "Javascript",
          "JavaScript"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Corporate Recruiter",
      "company": "DAT Freight & Analytics",
      "location": "Denver, CO",
      "url": "https://www.linkedin.com/jobs/view/corporate-recruiter-at-dat-freight-analytics-4312521607?position=3&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=dyPDL27Lczqa9xmSdpJMGw%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "About DATDAT is an award-winning employer of choice and a next-generation SaaS technology company that has been at the leading edge of innovation in transportation supply chain logistics for 45 years. We continue to transform the industry year over year, by deploying a suite of software solutions to millions of customers every day - customers who depend on DAT for the most relevant data and most accurate insights to help them make smarter business decisions and run their companies more profitably. We operate the largest marketplace of its kind in North America, with 400 million freights posted in 2022, and a database of $150 billion of annual global shipment market transaction data. Our headquarters are in Denver, CO, and Beaverton, OR, with additional offices in Seattle, WA; Springfield, MO; and Bangalore, India. For additional information, see www.DAT.com/company Job Application Deadline: 11/15/2025This is a hybrid role based in our Denver officeThe OpportunityAs a Corporate Recruiter at DAT, you are more than a sourcer of talent—you are a strategic advisor, a candidate advocate, and a builder of the teams that power North America's largest freight marketplace.Reporting to the Director of Talent Ops, you will act as a true talent consultant to your hiring managers. You'll guide them with market intelligence, challenge them to think differently, and build strategies to attract exceptional, diverse talent. At the same time, you will be the face of DAT to our candidates, ensuring every person who interacts with us has a seamless, transparent, and memorable experience. Your expertise will directly influence our ability to scale, innovate, and continue to be an industry leader in the dynamic freight tech industry.What You'll DoBe a Strategic Talent AdvisorOwn the full-cycle recruiting process for a dynamic portfolio of roles across our core business functions.Go beyond the job description to deeply understand the needs of your hiring teams, acting as a consultant to define role requirements, success profiles, and interview strategies.Use data and market insights to guide and influence leaders, helping them make informed hiring decisions in a competitive landscape.Champion the Candidate ExperienceCreate a world-class experience for every candidate, ensuring they feel valued, informed, and respected at every stage of the process.Serve as the primary guide for candidates, providing clear communication, timely feedback, and a genuine connection to DAT's mission and values.Masterfully manage the offer process, from creating competitive compensation packages to closing top talent with empathy and expertise.Turn every interaction into a branding opportunity, leaving candidates with a positive impression regardless of the outcome.Drive Recruiting ExcellenceLeverage your sourcing expertise to find and engage the passive talent that others can't.Maintain impeccable data integrity in Greenhouse, understanding that good data fuels smart decisions and process improvements.Continuously look for ways to improve our hiring processes, from interview structure to candidate feedback loops.What You'll BringYour Recruiting Craft3-5 years of full-cycle recruiting experience, ideally focused on corporate or go-to-market functions (Sales, Marketing, Finance, Ops etc.).A track record of success in a fast-paced, high-growth environment, preferably within the tech or SaaS industry.Deep expertise in modern sourcing techniques, including LinkedIn Recruiter, Boolean searches, and building engaged talent communities.Fluency in an Applicant Tracking System is a must—we use Greenhouse and would love it if you're already a pro.How You'll PartnerA consultative mindset with a history of earning trust and influencing hiring managers and business leaders.The ability to connect the dots between a single hire and the broader success of the business.Exceptional communication skills; you're equally comfortable advising a senior leader, negotiating an offer, or giving constructive feedback.A high sense of urgency balanced with a commitment to quality and a meticulous attention to detail.Your Personal AttributesResilience, adaptability, and a positive, problem-solving attitude.A genuine passion for creating positive and inclusive experiences for every candidate.A data-driven approach to understanding your pipeline and improving your results.What Makes You Stand OutSpecific experience recruiting for Corporate teams in a dynamic SaaS environment.Experience building diversity-focused sourcing strategies.Why You'll Love This RoleTrue Partnership: You'll work with collaborative hiring managers who see you as an expert and a critical partner in their success.High-Impact Work: You won't be a resume-pusher. You'll be a strategic advisor directly influencing the growth and direction of the company.A Winning Team: Join a high-performing, supportive recruiting team that values sharing knowledge, celebrating wins, and helping each other succeed.Build Your Expertise: Recruit for a diverse set of roles across the business, broadening your skills and becoming a versatile talent expert.Compensation & LocationFor Colorado-based candidates, in compliance with the Colorado Equal Pay for Equal Work Act, the salary range for this role is $99,000 - $127,000. DAT considers factors such as scope and responsibilities of the position, candidate's work experience, education and training, core skills, internal equity, and market and business elements when extending an offer.DAT embraces the value of a diverse workforce, and believes it is a core strength of our company that we encourage those values in every DAT employee, at every level of our organization, regardless of tenure or rank. We provide equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state, and local laws.Equal Opportunity Employer/Protected Veterans/Individuals With DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Go",
          "go"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Manager, People Operations",
      "company": "DAT Freight & Analytics",
      "location": "Denver, CO",
      "url": "https://www.linkedin.com/jobs/view/manager-people-operations-at-dat-freight-analytics-4302071330?position=4&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=NAYapogs2bawA9jk2O%2Fszg%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "About DATDAT is an award-winning employer of choice and a next-generation SaaS technology company that has been at the leading edge of innovation in transportation supply chain logistics for 45 years. We continue to transform the industry year over year, by deploying a suite of software solutions to millions of customers every day - customers who depend on DAT for the most relevant data and most accurate insights to help them make smarter business decisions and run their companies more profitably. We operate the largest marketplace of its kind in North America, with 400 million freights posted in 2022, and a database of $150 billion of annual global shipment market transaction data. Our headquarters are in Denver, CO, and Beaverton, OR, with additional offices in Seattle, WA; Springfield, MO; and Bangalore, India. For additional information, see www.DAT.com/company Job Application Deadline: 11/1/2025Position OverviewAs Manager, People Operations at DAT, you'll lead strategic HR initiatives that enhance teammate experiences and drive operational excellence across our growing organization. Reporting to the Director of Talent Operations, you'll spearhead process improvements, modernizing ways of working, policy development, and cross-functional projects that scale our people operations efficiently while ensuring compliance and data integrity.You'll combine strategic thinking with hands-on analytics to optimize HR processes, lead transformational projects, and collaborate with senior leadership on initiatives that support DAT's rapid growth. Your role spans process innovation, change management, data analysis, and ensuring seamless experiences across onboarding, performance management, and career development.What You'll DoStrategic Operations & Process InnovationDesign and implement scalable HR processes that enhance teammate experience and operational efficiencyDevelop & deliver AI driven solutions to enable employees to find the information they need with ease, and improve ways of workingSpearhead change management for the People team, ensuring successful adoption of new systems, automations, and process improvements in collaboration with key stakeholders.Continuously audit and refine HR processes, ensuring our documentation and systems remain compliant and aligned with a modern, self-service approach.Analytics & Data-Driven InsightsBuild executive dashboards using Excel, Tableau, or Power BI to drive strategic decision-makingAnalyze workforce metrics including retention trends, hiring efficiency, compensation equity, and employee engagementPartner with HR team on UKG, Greenhouse, and Radford system optimization and reporting enhancementsEnsure data accuracy and governance across all HR analytics and reporting initiativesStrategic Projects & Cross-Functional LeadershipLead complex initiatives including performance management enhancements and M&A integrationCollaborate with IT, Legal, Finance, and business leadership on compliance, system integration, and strategic projectsCreate comprehensive change management strategies that drive adoption of new processes and technologiesWhat You'll BringExperience & Education6-8 years progressive HR operations experience with proven track record of process improvement and project leadershipExperience in high-growth SaaS/technology environments preferredDemonstrated examples of implementing AI driven process improvementsStrong project management skills with experience managing multiple complex initiativesAnalytics & Technical ProficiencyAdvanced Excel proficiency including pivot tables, complex formulas, and data visualizationExperience with BI tools (Tableau, Power BI, or similar) for dashboard creation and reportingUnderstanding of HRIS architecture, system integrations, and data governance principlesStrong analytical skills with ability to interpret complex HR data and identify actionable insightsStrategic & Core CompetenciesExcellent communication and presentation skills for executive audiencesChange management expertise with ability to drive adoption across organizationsStrategic thinking with strong execution capabilities and attention to detailAbility to translate complex concepts and influence stakeholders at all levelsWhat Makes You Stand OutHRIS system experienceAnalytics certifications (Tableau, Power BI, Advanced Excel)Change management or project management certifications (Prosci, PMP, Agile)M&A integration or organizational restructuring experienceExperience scaling HR operations in high-growth technology companiesWhy You'll Love This Role Drive meaningful process improvements that directly impact teammate experienceWork with cutting-edge HR technology and advanced analyticsPartner with senior leadership on strategic organizational initiativesLead transformational projects in a fast-paced, innovative environmentOpportunity for significant professional growth and career developmentFor Colorado-based candidates, in compliance with the Colorado Equal Pay for Equal Work Act, the salary range for this role is $130,000 - $161,000. DAT considers factors such as scope and responsibilities of the position, candidate's work experience, education and training, core skills, internal equity, and market and business elements when extending an offer.DAT embraces the value of a diverse workforce, and believes it is a core strength of our company that we encourage those values in every DAT employee, at every level of our organization, regardless of tenure or rank. We provide equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state, and local laws.Equal Opportunity Employer/Protected Veterans/Individuals With DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Power BI",
          "Tableau"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Information Security Analyst",
      "company": "DAT Freight & Analytics",
      "location": "Seattle, WA",
      "url": "https://www.linkedin.com/jobs/view/information-security-analyst-at-dat-freight-analytics-4314417415?position=5&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=GQTAHRqk%2BjZUfxmTJQM6Ag%3D%3D",
      "post_date": "2025-10-13",
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "About DATDiscover your future at DAT Freight & Analytics, where innovation meets impact. For over four decades, DAT has been at the forefront of transportation and logistics, helping businesses move freight with greater efficiency and confidence. We are a technology company that removes uncertainty from freight for truckers, brokers, and shippers every day. Our advanced tools and data intelligence empower professionals to make smarter decisions, optimize costs, and operate more successfully. Through the industry's largest digital freight marketplace and insights derived from over $1 trillion in freight transactions, we provide the mission-critical information that keeps supply chains running smoothly across the country. DAT is proud to be an award-winning workplace that fosters innovation, celebrates success, and values professional growth. With strategic offices in Beaverton, Oregon, Denver, Colorado, Springfield, Missouri, and Bangalore, India, our teams collaborate to solve the transportation industry's most complex challenges. Ready to shape the future of freight technology? Learn more at dat.com/company.Application Deadline: 11/15/2025The OpportunityDAT is looking for a Information Security - Security Operations, to join our security team. This position can be based in our Seattle, WA office. The Information Security Analyst - Security Operations, will serve as a member of the Security Operations team, responsible for daily operational security activities that serve at the eyes and ears of incident response. This role is central to DAT’s ability to detect, investigate, and respond to security incidents. You will be responsible for collaborating and maturing the SOC’s structure, workflows and operational cadence, while ensuring our security posture is continually improved through monitoring, threat intelligence, and testing.What You’ll DoExecute Security Operations Center Excellence including alerting, detection, investigation, and incident response activities across the organization.Support and triage security alerts and incidents using SIEM, EDR, and other monitoring platforms; ensure timely escalation, investigation, and remediation.Leverage threat intelligence feeds and IOCs to improve detection coverage and proactively identify emerging threats relevant to our environment.Conduct and coordinate security testing including penetration testing with roadmapped plans to expand to more red/purple team testing to validate defenses.Perform root cause analysis of incidents and drive improvements in monitoring and detection to reduce recurrence.Document and refine incident response playbooks and ensure junior analysts are trained on consistent execution.Contribute to security projects across multiple domains to help mature security programsCollaborate with cross-functional teams to ongoing security control maturation and build trust based relationships throughout the organizationAsk questions and be forever curious, fostering a culture of continuous learning and operational excellence.The Skills And Experience You’ll BringTeam Player with communication, organizational, and relationship management skills.Self-motivated, with keen attention to detail and excellent judgment skills.Knowledge threat detection and investigation tools such as SIEM (Splunk, QRadar, etc.), EDR/XDR solutions, and network monitoring platforms.Knowledge of threat intelligence integration (IOCs, TTPs, threat feeds) into detection and response workflows.Working knowledge of hybrid IT systems, networking, co-locations, and cloud environments.Understanding of incident response frameworks, including NIST and SANS, with ability to perform forensic analysis and post-incident reviews.1-3 years of experience in Security Operations, Incident Response, or related cybersecurity functions. Professional Certification preferred (e.g., Security +, CEH, CySA, OSCP or equivalent)Why DAT?DAT is an award winning employer of choice.For starters, we have a hybrid work environment, but we also know what makes a great workplace. We have a time-tested and resolute set of operating values predicated on integrity, mutual respect, open communication, and executing with excellence. These values inform our strategic vision as much as any one of our products does. We’ve been an employer of choice in the Portland metropolitan area for four decades, and within one year of opening our Denver office, DAT was #26 on Built In Colorado’s 100 Best Places to Work In Colorado.Medical, Dental, Vision, Life, and AD&D insuranceParental LeaveUp to 20 days of paid time off starting in year oneAn additional 10 holidays of paid time off per calendar year401k matching (immediately vested)Employee Stock Purchase PlanShort- and Long-term disability sick leaveFlexible Spending AccountsHealth Savings AccountsEmployee Assistance ProgramAdditional programs - Employee Referral, Internal Recognition, and WellnessFree TriMet transit pass (Beaverton Office) Competitive salary and benefits packageWork on impactful projects in a cutting-edge environmentCollaborative and supportive team cultureOpportunity to make a real difference in the trucking industryEmployee Resource GroupsFor Washington-based candidates, in compliance with the Washington State Pay Transparency Law, the salary range for this role is $71,000 - $91,000. DAT considers factors such as scope and responsibilities of the position, candidate's work experience, education and training, core skills, internal equity, and market and business elements when extending an offer.DAT embraces the value of a diverse workforce, and believes it is a core strength of our company that we encourage those values in every DAT employee, at every level of our organization, regardless of tenure or rank. We provide equal employment opportunities (EEO) to all employees and applicants without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state, and local laws.Equal Opportunity Employer/Protected Veterans/Individuals With DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [],
        "industry": "Not specified"
      }
    },
    {
      "title": "Research Manager",
      "company": "🟦 NMS Market Research Czech",
      "location": "Praha, TX",
      "url": "https://www.linkedin.com/jobs/view/research-manager-at-%F0%9F%9F%A6-nms-market-research-czech-4120276759?position=6&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=zpkG9p1RCo%2FAgzO3jWUqSw%3D%3D",
      "post_date": "2025-01-09",
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "Protože bez dat se dneska už nikdo a nic neobejde, jsme tu my. Česká výzkumná agentura s pobočkami v Praze, Bratislavě, Budapešti a Bangkoku a bezmála 70 zaměstnanci. Na trhu jsme již přes 25 let a nabídnout ti tak můžeme zázemí silné společnosti a zároveň neformální prostředí a individuální přístup.Research ManagerFull-time, U Nikolajky 13, Praha 5, ČeskoMám zájemBudeš součástí týmu Client Service🔍 Zjistit více o týmu.Ať už jsi zkušený výzkumník s roky praxe nebo ve výzkumu teprve začínáš a máš chuť se učit, zbystři. Už loni se na nás poptávky od klientů jenom hrnuly a letos tomu nebude jinak. Rozšiřujeme naše řady a nabízíme paletu projektů, které dávají smysl. Pomáháme zlepšovat firmám business, ale přispíváme také ke společenským tématům.Co tě na pozici čeká?👉Komunikace s klienty. Pro firmy a značky nejsme jenom dodavatelem dat, ale zejména partnerem a konzultantem. Veškeré projekty řešíme na míru našim klientům a pomáháme jim hledat odpovědi na jejich otázky.👉 Spolupracovat budeš s kolegy z Fieldu, kteří zajišťují komunikaci s respondenty a s analytiky z Quantitative Research.👉 Koordinace a design projektu. Tvým úkolem bude design výzkumu a návrh metodologie i následná exekuce celého projektu.👉 Přípravy reportů a prezentací, psaní závěrečných zpráv, hledání insightů. Tady teprve nastává ta nejtěžší práce. Je to hodně o kreativitě a umění hledat v datech příběh a předat ho následně klientovi.👉 Prezentace výsledků průzkumu klientovi, předložení doporučení.Jak vypadá průběh projektu?1️⃣ Vše začíná briefem od klienta a přípravou nabídky. To znamená vhodná volba metodologie a design celého výzkumu.2️⃣ Pak je na tobě, abys připravil/a dotazník nebo scénář pro individuální rozhovory či focus groups.3️⃣ Průběžně spolupracuješ s dalšími členy týmu a kolegy z oddělení Quantitative Research a Field.4️⃣ Neustále koukáš na hodinky a hlídáš dodržování termínů i budgetu. 5️⃣ Ve chvíli, kdy jsou data sesbíraná, můžeš se pustit do přípravy reportu a výsledné prezentace pro klienta.6️⃣ Klientovi odprezentuješ získané insighty a dáš mu svá doporučení. Co musíš mít a znát?👩‍🎓 Rozhodně ti nesmí chybět vzdělání v oboru sociologie, marketingu, psychologie či antropologie nebo několik let zkušeností na podobné pozici v oboru marketingového výzkumu.🧠 Hledáme chytré a zvídavé lidi, kteří mají přehled nejenom o dění ve své specializaci, ale i všeobecný rozhled.💂 Měl/a by ses bez problémů zvládnout domluvit anglicky. Neminou tě mezinárodní projekty zpracovávané v angličtině.⏱️ Zvládáš si bez problémů organizovat svojí práci, dokážeš samostatně a efektivně řídit projekty.🧐 Dokážeš svou práci prodat, přesvědčit klienta, být důvěryhodným expertem.💻 Výborně ovládáš Excel a PowerPoint. Velkou výhodou bude také znalost SPSS nebo jiných statistických programů.💬 Máš reprezentativní vystupování, nebojíš se prezentovat.Co ti v NMS nabídneme?📆 Týden dovolené navíc a po 5 letech v NMS až 6 týdnů dovolené🏢 Flexibilní pracovní doba a možnost občasné práce z domova😷 Sick days💪 Dotovaná Multisportka☎️ Zvýhodněný mobilní tarif pro tebe i rodinu👨‍🏫 Výuka angličtiny na pracovišti⭐ Interní bonusový systém Bonusly🥨 Občerstvení ve společných kuchyňkách📚 Firemní vzdělávání a společná knihovna👶 Příspěvek na hlídání dětí během rodičovské dovolenéDostaneš možnost prosadit svoje nápady, pro které získáš podporu i prostor. Jsme parta nadšenců, co v létě rádi na dvorku pořádají grilovačky, nebo další společné aktivity – lyžování, cyklistika, deskovky, kvízy apod. Vždycky tu je někdo, kdo ti poradí a pomůže a udělá si na tebe čas.Rád/a by ses o pozici a naší firmě dozvěděl/a víc? Stačí jen poslat životopis a motivační dopis, my se s tebou rádi potkáme.Pokud ještě váháš, nebo ti něco není jasné, kontaktuj naší Lucku z HR. Ráda ti na všechno odpoví.📞 724 950 557 📧 lucie.rezna@nms.euSeznam se s Terezou. Naší account manažerkou a politickou analytičkou.Celý článek5mPošli nám svoje CV. Těšíme se na tebe!Ponechte toto pole prázdné.Souhlasím s tím, aby společnost NMS Market Research, s.r.o., IČ: 25749315 zpracovávala mnou poskytnuté údaje (především mé kontaktní údaje a informace ze životopisu) i po ukončení tohoto výběrového řízení za účelem nabídky dalších pracovních příležitostí, a to po dobu 3 let. Mnou udělený souhlas je možné u společnosti NMS Market Research kdykoli odvolat.Vložit životopisVložit motivační dopisPlné znění prohlášeníOdesláním kontaktního formuláře souhlasím se zpracováním a ochranou osobních údajů dle Prohlášení společnosti NMS Market Research s.r.o.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "r"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "DAT Tutor",
      "company": "Inspira Education",
      "location": "United States",
      "url": "https://www.linkedin.com/jobs/view/dat-tutor-at-inspira-education-4296614514?position=7&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=9cq4G5AjxvhfuHLm0C%2Fk6A%3D%3D",
      "post_date": "2025-09-05",
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "About Inspira EducationInspira Education Group is one of the fastest-growing edtech startups in the US. We started with a simple mission to democratize access to high-quality coaching so that every student in the world has an equal opportunity to access the best opportunities.As the world’s leading network of top admissions coaches in medical, legal, business, and college studies, we’re building software and services in one place—disrupting long-entrenched application processes with products and experiences that strive to provide an equal platform for candidates from diverse backgrounds worldwide.As one of the fastest-growing edtech firms in the world, we are backed by some of the leading venture capital firms and investors in the world, including Zeev Ventures, Quiet Capital, Craft Ventures, Jeff Fluhr (Founder of Stubhub), and David Sacks (Former COO of PayPal and Founder of Yammer).The RoleWe are looking for Dental Admission Test (DAT) Tutors who are passionate about education and driven to help students succeed. If you love mentoring, test prep, and empowering others, this is the role for you! You’ll work one-on-one with students, create personalized study plans, and provide expert guidance to help them excel on every section of the DAT exam. This is a part-time, remote, 1099 contract role that can be based anywhere in the United States or Canada.ResponsibilitiesTutor students one-on-one on all sections of the DATTailor a DAT curriculum to students’ needsTrack and analyze student progressCreate and maintain project trackers to monitor student progressKeep students’ families up to date on progressBe passionate about education and an expert thought leader for your studentsQualificationsHave a 4-year college degree (Bachelor’s Degree or higher is required)Tutor during after-school hours, including afternoons, evenings, and weekendsHave previously taken the DAT (copy of official score report will be required)1-2 years of previous teaching or tutoring experienceAble to provide DAT Test preparation for the full exam, each sectionSuperior attention to detail and a high ability to multitask and meet tight deadlinesComfortable teaching/coaching in a fully remote environmentA baseline AA score of 520+Why you'll love InspiraAmazing people with a great vision and valuesAbility to work directly with co-founders and drive impact super quicklyYour work directly impacts the lives and careers of students across the globe100% coverage of health, vision, and dental benefitsFlexible Paid-time OffLearning and Development Budget Retirement Savings Plans - 401k with matchingDiversity and inclusion programs that promote employee resource groups like OWN (Outreach Women's Network), AAPI, Rainbow (LGBTQIA+), Gender+, LatinX, Black Excellence, Disability Community, and VeteransNote: certain benefits are not provided to 1099 contract workerInterested in learning more about Inspira Education, please visit Inspira Education Group.Inspira Education Group does not discriminate based on race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity, or any other reason prohibited by law in providing employment opportunities and benefits.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [],
        "industry": "Not specified"
      }
    },
    {
      "title": "Head of Growth & Partnerships, Graduate Healthcare Programs (Nursing, PA, Optometry, MPH)",
      "company": "Juno",
      "location": "United States",
      "url": "https://www.linkedin.com/jobs/view/head-of-growth-partnerships-graduate-healthcare-programs-nursing-pa-optometry-mph-at-juno-4289980382?position=8&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=5JzLIjLlhDF%2Fhq6O9vb9dQ%3D%3D",
      "post_date": "2025-08-20",
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "About JunoJuno leverages collective bargaining power to secure better student loan rates for graduate students. With 230,000+ members and over $1B in negotiated loan volume, we've proven that group buying works. We are the most popular way to pay for the world’s top MBA programs and are now expanding to serve all professional degree students at a critical moment in higher education.The ProblemFederal lending reforms are creating an unprecedented market shift. Starting July 2026, new caps on federal graduate loans (including the elimination of Grad PLUS) will leave millions of students with significant funding gaps. Students will increasingly need transparent, competitive private options—exactly what Juno negotiates. ￼Your missionWe're seeking a leader to own the P&L and full-funnel growth for Nursing (MSN/DNP), Physician Assistant, Physical/Occupational Therapy, Optometry, Podiatry, and Public Health (MPH) programs. Your efforts will ensure every future graduate gets fair, transparent financing options amid new federal caps.You'll build the playbook for reaching target schools, converting waitlist demand to funded loans, and establishing Juno as the go-to resource for graduate health student financing. This is a team-building role - start by doing the work yourself, prove the model, then build and lead the team you need to scale.What You’ll DoOwn the Graduate Health P&L: Build and execute GTM strategy, hit growth targets, and drive Juno member growthScale distribution through partnerships:Negotiate national deals with key organizations that can help reach our target marketActivate campus-based chapters with turnkey playbooksBuild relationships with financial aid offices at target schoolsPartner with DAT prep companies and AADSAS ecosystemRun targeted campaigns aligned to application cycles (DAT → applications → interviews → white coat)Build a campus ambassador network: Recruit, train, and manage high-performing students across key programs with clear KPIs and incentivesDrive cross-functional initiatives: Partner with product on feature development, lender relations on competitive rates, and compliance on messagingManage operations and analytics: Forecast pipeline, track cohort performance, optimize CAC/LTV, and manage budget allocationOwn waitlist growth → loan origination: landing pages, A/B tests, content, webinars, email/SMS, and event cycles aligned to application, admissions, and financial aid timelinesWhat We Offer💰 Compensation: Competitive base salary + performance bonus with significant upside potential🏥 Benefits: Comprehensive health, dental, vision, and retirement matchingWhat We’re Looking ForBackground: Typically 3–5+ years or an outlier track record (e.g., you scaled a campus network, ran national org programming, built a zero‑to‑one motion).Preference for experience in professional services, management consulting, investment banking, or high-growth startupsPreference for an Owner‑operator who has owned a number in growth/BD/marketplaces/fintech/edtech or campus‑scale programs.Exceptional writing & communication: you can craft compliant, persuasive copy for students, deans, and national orgs.Bias to action: ship experiments frequently; instrument attribution; close loops with lender relations & compliance.Tenacity: we work as hard as it takes to achieve our targets.The X-FactorYou lived it: Connections to graduate health education are a massive advantage (but not required)You're hungry: Ready to own outcomes, not just make recommendationsYou're scrappy: Will do whatever it takes to winYou're magnetic: Can recruit and inspire great peopleCompensation: $150k–$250k, including performance upside tied to growth milestones. Top performers will exceed this range.Why Join Juno?The Opportunity✅ Real Impact: Help hundreds of thousands of students get access to the lowest rates on the market✅ Market Timing: Federal aid changes create massive tailwind for growth✅ Proven Model: $1B+ negotiated, 200K+ members - product-market fit achieved✅ Career Growth: Own a P&L and build a team with significant autonomy\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "go"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Data Engineer Intern, 2026 Summer U.S.",
      "company": "Atlassian",
      "location": "Seattle, WA",
      "url": "https://www.linkedin.com/jobs/view/data-engineer-intern-2026-summer-u-s-at-atlassian-4294627463?position=9&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=RHJApwxj0OYO%2Fr6GD6ovFQ%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "OverviewWorking at AtlassianAtlassians can choose where they work – whether in an office, from home, or a combination of the two. That way, Atlassians have more control over supporting their family, personal goals, and other priorities. We can hire people in any country where we have a legal entity. Interviews and onboarding are conducted virtually, a part of being a distributed-first company.Your Future OrgAtlassian’s Intern program combines hands-on technical training, professional growth opportunities, dedicated mentorship, and strong social connections. This holistic approach empowers students to hit the ground running and sets them up for a successful and impactful career at Atlassian!This role is located in Seattle, WA. To qualify, you must be willing and able to work out of this location.This position is not eligible for F1 and J1 students. It is not available for any work sponsorship.Our paid internship program runs for 12 weeks between May/June 2026 - August/September 2026.Your Future TeamAs an intern in our world-class Data Engineering team, you'll influence product teams, inform Dat Science and Analytics Platform teams, and partner with data consumers and products to ensure qualify and usefulness of data assets. You will help strategize measurement, collecting data, and generating insights.This work will help understand and improve product experience and engagement, improve efficiency and costs, and guide strategy. You'll report to a Data Engineering Manager, and learn from your team mentor who are some of the best Data Engineers in the business.ResponsibilitiesResponsibilitiesData Engineering is a multi-faceted role, where you can have focused or broad set of responsibilities, including:Define metricsInstrument loggingAcquire/ingest dataArchitect & modeling dataTransform dataEnsure data quality, governance, and enablementAlerting, visualization, and reportingDevelop at scale and improving efficiencyQualificationsMinimum QualificationsExperience programming with Python, or other related object-oriented programming languagesHave an interest in software engineering demonstrated by previous internships, work experience, projects, or publicationsKnowledge of data structures, in particular how they are implemented and how to apply them to meet data challengesHuge Plus: An understanding of the SaaS business model and data structures or experience in Enterprise Software product developmentProficiency in SQL and relational databases experienceDemonstrated interest in the Data Engineering field through academic coursework, previous work or internship experience, or personal projectsAble to commit to a 12 week full-time (40hrs/week) program during Summer 2026Currently enrolled full-time in a 4-year bachelor's degree program and returning to the program after the completion of the internship, graduating by June 2027CompensationAt Atlassian, we strive to design equitable, explainable, and competitive compensation programs. To support this goal, the baseline of our range is higher than that of the typical market range, but in turn we expect to hire most candidates near this baseline. Base pay within the range is ultimately determined by a candidate's skills, expertise, or experience. In the United States, we have three geographic pay zones. For this role, our current base pay ranges for new hires in each zone are:Zone A: - $51/hr - $58/hrZone B: - $47/hr - $52/hrZone C: - $43/hr - $49/hrThis role may also be eligible for benefits, bonuses, commissions, and equity.Please visit go.atlassian.com/payzones for more information on which locations are included in each of our geographic pay zones. However, please confirm the zone for your specific location with your recruiter.Benefits & PerksAtlassian offers a wide range of perks and benefits designed to support you, your family and to help you engage with your local community. Our offerings include health and wellbeing resources, paid volunteer days, and so much more. To learn more, visit go.atlassian.com/perksandbenefits .About AtlassianAt Atlassian, we're motivated by a common goal: to unleash the potential of every team. Our software products help teams all over the planet and our solutions are designed for all types of work. Team collaboration through our tools makes what may be impossible alone, possible together.We believe that the unique contributions of all Atlassians create our success. To ensure that our products and culture continue to incorporate everyone's perspectives and experience, we never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines.To provide you the best experience, we can support with accommodations or adjustments at any stage of the recruitment process. Simply inform our Recruitment team during your conversation with them.To learn more about our culture and hiring process, visit go.atlassian.com/crh .\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "Python",
          "go"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Dental School Admissions Consultant",
      "company": "Inspira Education",
      "location": "United States",
      "url": "https://www.linkedin.com/jobs/view/dental-school-admissions-consultant-at-inspira-education-4296623408?position=10&pageNum=1&refId=ZChXORtckadUt2%2FWHyu7Gg%3D%3D&trackingId=eEqOacPRAITHtYQSPJ%2BzXw%3D%3D",
      "post_date": "2025-09-05",
      "scraped_at": "2025-10-21T01:41:10.349038",
      "source": "public_api",
      "details": {
        "description": "About Inspira EducationInspira Education Group is one of the fastest-growing edtech startups in the US. We started with a simple mission to democratize access to high-quality coaching so that every student in the world has an equal opportunity to access the best opportunities.As the world’s leading network of top admissions coaches in medical, legal, business, and college studies, we’re building software and services in one place—disrupting long-entrenched application processes with products and experiences that strive to provide an equal platform for candidates from diverse backgrounds worldwide.As one of the fastest-growing edtech firms in the world, we are backed by some of the leading venture capital firms and investors in the world, including Zeev Ventures, Quiet Capital, Craft Ventures, Jeff Fluhr (Founder of Stubhub), and David Sacks (Former COO of PayPal and Founder of Yammer).The RoleWe are currently seeking a Dental Admissions Consultant. If you have a passion for mentoring, consulting, and education, this could be the role for you! You’ll work closely with students, provide personalized guidance, monitor academic progress, and support them through every stage of the Dental School admissions process. This is a part-time, remote, 1099 contract role that can be based anywhere in the United States or Canada.ResponsibilitiesWork with prospective dental school candidates, helping them identify opportunities to enhance their profiles and draft compelling application materialsManage relationships with applicants and families while providing strategic and tactical guidance on school selection, personal statements, CVs, recommendations, interviews, and the overall dental school application processIdentify optimal dental schools and programs for individual students; provide detailed feedback and guidance on their research into specific schools, ensuring alignment with the student’s background, goals, and specialty interestsSupport students with project planning, helping them create and adhere to effective timelines through Excel-based trackers or other toolsStay up-to-date on the dental school application process, including ADEA AADSAS, DAT preparation, and program-specific requirements, to advise prospective and existing clients on appropriate school selection and application strategiesQualifications3rd or 4th year dental student, or graduate of a top U.S. dental schoolExperience mentoring students through the dental school application process; admissions committee or selection board experience preferredPassion for coaching and mentoringStrong planning, organizational, and project management skillsExcellent English reading, writing, and editing abilitiesStrong verbal communication skillsWhy you'll love InspiraAmazing people with a great vision and valuesAbility to work directly with co-founders and drive impact super quicklyYour work directly impacts the lives and careers of students across the globe100% coverage of health, vision, and dental benefitsFlexible Paid-time OffLearning and Development Budget Retirement Savings Plans - 401k with matchingDiversity and inclusion programs that promote employee resource groups like OWN (Outreach Women's Network), AAPI, Rainbow (LGBTQIA+), Gender+, LatinX, Black Excellence, Disability Community, and VeteransNote: certain benefits are not provided to 1099 contract workerInterested in learning more about Inspira Education, please visit Inspira Education Group.Inspira Education Group does not discriminate based on race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity, or any other reason prohibited by law in providing employment opportunities and benefits.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [],
        "industry": "Not specified"
      }
    },
    {
      "title": "DAT Writer",
      "company": "City of New York",
      "location": "Bronx, NY",
      "url": "https://www.linkedin.com/jobs/view/dat-writer-at-city-of-new-york-3909301053?position=1&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=JFK2cx6hJlXGuN2KaH0%2BQw%3D%3D",
      "post_date": "2024-04-25",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "Business Development Representative",
      "company": "Zuum App",
      "location": "Irvine, CA",
      "url": "https://www.linkedin.com/jobs/view/business-development-representative-at-zuum-app-4301235409?position=2&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=xeovxA9AQxKbftewk8hxwQ%3D%3D",
      "post_date": "2025-09-16",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "Senior Product Operations Manager",
      "company": "DAT Freight & Analytics",
      "location": "Seattle, WA",
      "url": "https://www.linkedin.com/jobs/view/senior-product-operations-manager-at-dat-freight-analytics-4309063696?position=3&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=o4HAE77xp8%2FQG%2B1HSL1aBA%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "Business Analyst - Carrier Network",
      "company": "DAT Freight & Analytics",
      "location": "Seattle, WA",
      "url": "https://www.linkedin.com/jobs/view/business-analyst-carrier-network-at-dat-freight-analytics-4311172739?position=4&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=fcSR%2FRrPxeu7q%2BWqB4G9aQ%3D%3D",
      "post_date": "2025-10-06",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "Administrátor/ka sběru dat",
      "company": "🟦 NMS Market Research Czech",
      "location": "Praha, TX",
      "url": "https://www.linkedin.com/jobs/view/administr%C3%A1tor-ka-sb%C4%9Bru-dat-at-%F0%9F%9F%A6-nms-market-research-czech-4295905134?position=5&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=3nDOHNN4tX4A%2FlT9hu9J5Q%3D%3D",
      "post_date": "2025-09-04",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "Data Scientist II (RWD)",
      "company": "Veracyte, Inc.",
      "location": "San Diego, CA",
      "url": "https://www.linkedin.com/jobs/view/data-scientist-ii-rwd-at-veracyte-inc-4300938418?position=6&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=mKGtGVciQRekuVphcAed9Q%3D%3D",
      "post_date": "2025-10-01",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "Strategic Partnerships Manager",
      "company": "DAT Freight & Analytics",
      "location": "United States",
      "url": "https://www.linkedin.com/jobs/view/strategic-partnerships-manager-at-dat-freight-analytics-4257474378?position=7&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=f2pa6mDaaCF5nolgxA%2Bt8w%3D%3D",
      "post_date": "2025-10-02",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "Business Systems & Integrations Analyst",
      "company": "Direct Drive Logistics",
      "location": "West Allis, WI",
      "url": "https://www.linkedin.com/jobs/view/business-systems-integrations-analyst-at-direct-drive-logistics-4275307951?position=8&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=wqIW52r5JgQpfgIH1Wa5Pw%3D%3D",
      "post_date": "2025-07-24",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "AI/ML Product Manager",
      "company": "Tata Consultancy Services",
      "location": "Phoenix, AZ",
      "url": "https://www.linkedin.com/jobs/view/ai-ml-product-manager-at-tata-consultancy-services-4314500820?position=9&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=3%2B7c9l5M2wnehc%2BoUv4h5Q%3D%3D",
      "post_date": "2025-10-14",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "Instructor, Digital Marketing",
      "company": "Digital NEST",
      "location": "Stockton, CA",
      "url": "https://www.linkedin.com/jobs/view/instructor-digital-marketing-at-digital-nest-4234817009?position=10&pageNum=2&refId=ju2yPsuoFumiVUAVbJapIg%3D%3D&trackingId=OONjbF6xWIpz9BIKHhX30g%3D%3D",
      "post_date": "2025-05-22",
      "scraped_at": "2025-10-21T01:41:20.372715",
      "source": "public_api"
    },
    {
      "title": "Logistics Coordinator",
      "company": "TA Services",
      "location": "San Diego, CA",
      "url": "https://www.linkedin.com/jobs/view/logistics-coordinator-at-ta-services-4312152735?position=1&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=jvJn59%2Bg4hdMOGmUHmehvA%3D%3D",
      "post_date": "2025-10-09",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "Business Intelligence Specialist",
      "company": "Werken bij NHL Stenden",
      "location": "Friesland, WI",
      "url": "https://www.linkedin.com/jobs/view/business-intelligence-specialist-at-werken-bij-nhl-stenden-4312664569?position=2&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=xHyyxu9iooikniTPlDnbqg%3D%3D",
      "post_date": "2025-10-09",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "PROJECT PLANNER I",
      "company": "Duke University",
      "location": "Durham, NC",
      "url": "https://www.linkedin.com/jobs/view/project-planner-i-at-duke-university-4283863352?position=3&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=5vXxup3R4TjOgI8mJcdxDQ%3D%3D",
      "post_date": "2025-08-13",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "Fullstack developer",
      "company": "Smart FMS",
      "location": "California, United States",
      "url": "https://www.linkedin.com/jobs/view/fullstack-developer-at-smart-fms-4302654969?position=4&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=Dv0gEoyBTHTjlpswpzf%2BKA%3D%3D",
      "post_date": "2025-09-23",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "Principal Cybersecurity",
      "company": "AT&T",
      "location": "Charlotte, NC",
      "url": "https://www.linkedin.com/jobs/view/principal-cybersecurity-at-at-t-4303823657?position=5&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=LS6GXHfmpl4oQZUGVeaOfA%3D%3D",
      "post_date": "2025-09-22",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "Director Cybersecurity AI",
      "company": "AT&T",
      "location": "Dallas, TX",
      "url": "https://www.linkedin.com/jobs/view/director-cybersecurity-ai-at-at-t-4315222554?position=6&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=qR0e6iQikFXpfbwxSjrM%2BA%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "Director Cybersecurity AI",
      "company": "AT&T",
      "location": "Middletown, NJ",
      "url": "https://www.linkedin.com/jobs/view/director-cybersecurity-ai-at-at-t-4315240210?position=7&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=%2BgqgXoc0JEkMBOf83T7UnQ%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "Director Cybersecurity AI",
      "company": "AT&T",
      "location": "Atlanta, GA",
      "url": "https://www.linkedin.com/jobs/view/director-cybersecurity-ai-at-at-t-4315224508?position=8&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=uXkmwwMVvrdPJ3RqSWDM%2Fg%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "Director Cybersecurity AI",
      "company": "AT&T",
      "location": "Charlotte, NC",
      "url": "https://www.linkedin.com/jobs/view/director-cybersecurity-ai-at-at-t-4315244135?position=9&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=X3pv38ftx5MlP2pUBlmTuw%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "Director Cybersecurity AI",
      "company": "AT&T",
      "location": "Alpharetta, GA",
      "url": "https://www.linkedin.com/jobs/view/director-cybersecurity-ai-at-at-t-4315235269?position=10&pageNum=3&refId=twp6%2BxXC3vx3Sknn8eXvMA%3D%3D&trackingId=GVrb%2Br984V1hLzABulpQHw%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T01:41:30.389805",
      "source": "public_api"
    },
    {
      "title": "Open sollicitatie",
      "company": "Kimman",
      "location": "Amsterdam, MO",
      "url": "https://www.linkedin.com/jobs/view/open-sollicitatie-at-kimman-4314331988?position=1&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=QHXOx0V4ncBzFUvtKczq%2Fg%3D%3D",
      "post_date": null,
      "scraped_at": "2025-10-21T01:41:40.445946",
      "source": "public_api"
    },
    {
      "title": "Open sollicitatie",
      "company": "Oogvoororen",
      "location": "Lake County, IN",
      "url": "https://www.linkedin.com/jobs/view/open-sollicitatie-at-oogvoororen-4198890761?position=2&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=DA7zkUnWg%2BAuy8Wi6E6ETg%3D%3D",
      "post_date": "2025-04-03",
      "scraped_at": "2025-10-21T01:41:40.445946",
      "source": "public_api"
    },
    {
      "title": "Open Sollicitatie",
      "company": "Lagarde Groep",
      "location": "Lake County, IN",
      "url": "https://www.linkedin.com/jobs/view/open-sollicitatie-at-lagarde-groep-4142647432?position=3&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=EHvlPtbzM3VCHcLqA6KpEw%3D%3D",
      "post_date": "2025-02-03",
      "scraped_at": "2025-10-21T01:41:40.445946",
      "source": "public_api"
    },
    {
      "title": "Software Development Engineer in Test (SDET IV)",
      "company": "DAT Freight & Analytics",
      "location": "Beaverton, OR",
      "url": "https://www.linkedin.com/jobs/view/software-development-engineer-in-test-sdet-iv-at-dat-freight-analytics-4309014135?position=4&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=AwJ%2FZ98uUruTCZiwP7uxUQ%3D%3D",
      "post_date": "2025-10-13",
      "scraped_at": "2025-10-21T01:41:40.445946",
      "source": "public_api"
    },
    {
      "title": "Senior Software Developer",
      "company": "DAT Freight & Analytics",
      "location": "Beaverton, OR",
      "url": "https://www.linkedin.com/jobs/view/senior-software-developer-at-dat-freight-analytics-4309000944?position=5&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=mCl4I9Ewu4MbQJJ%2BaWFKSQ%3D%3D",
      "post_date": "2025-10-01",
      "scraped_at": "2025-10-21T01:41:40.454087",
      "source": "public_api"
    },
    {
      "title": "Principal Front End Software Engineer",
      "company": "GliaCell Technologies",
      "location": "Fort Meade, MD",
      "url": "https://www.linkedin.com/jobs/view/principal-front-end-software-engineer-at-gliacell-technologies-3934940105?position=6&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=vwKIeLSAIE5POORo7LI9Gg%3D%3D",
      "post_date": "2024-05-24",
      "scraped_at": "2025-10-21T01:41:40.454087",
      "source": "public_api"
    },
    {
      "title": "e-DAT Analyst III",
      "company": "K&L Gates",
      "location": "Chicago, IL",
      "url": "https://www.linkedin.com/jobs/view/e-dat-analyst-iii-at-k-l-gates-4064692139?position=7&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=mLf7zCXRe6PKM%2BChg1TAeA%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-21T01:41:40.454087",
      "source": "public_api"
    },
    {
      "title": "Open sollicitatie",
      "company": "Intratuin Elst",
      "location": "Malden, MO",
      "url": "https://www.linkedin.com/jobs/view/open-sollicitatie-at-intratuin-elst-4288894572?position=8&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=TuscOlwuj%2BwRdiMTLrB14w%3D%3D",
      "post_date": "2025-08-26",
      "scraped_at": "2025-10-21T01:41:40.454087",
      "source": "public_api"
    },
    {
      "title": "Registrar",
      "company": "FARO. Vlaams steunpunt voor cultureel erfgoed",
      "location": "Hampton, VA",
      "url": "https://www.linkedin.com/jobs/view/registrar-at-faro-vlaams-steunpunt-voor-cultureel-erfgoed-4310578715?position=9&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=C3lacyfKv5HWdfbA2bYyUA%3D%3D",
      "post_date": "2025-10-04",
      "scraped_at": "2025-10-21T01:41:40.454087",
      "source": "public_api"
    },
    {
      "title": "Vacature Groepsleerkracht Basisonderwijs | Breukelen (27759)",
      "company": "Docentenmarktplaats.nl",
      "location": "Davis County, UT",
      "url": "https://www.linkedin.com/jobs/view/vacature-groepsleerkracht-basisonderwijs-breukelen-27759-at-docentenmarktplaats-nl-4273060016?position=10&pageNum=4&refId=OKh2jbar0W6d0ckmPfjN6g%3D%3D&trackingId=%2Bcx14pYJdwD6wORc%2FnDSSw%3D%3D",
      "post_date": "2025-07-28",
      "scraped_at": "2025-10-21T01:41:40.454087",
      "source": "public_api"
    }
  ],
  "metadata": {
    "scraped_at": "2025-10-21T01:45:29.852639",
    "total_jobs": 50
  }
}