{
  "jobs": [
    {
      "title": "Work from Home India",
      "company": "TELUS Digital",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/work-from-home-india-at-telus-digital-4281253503?position=1&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=GQKx%2FD0rgGYExX%2FO08lblQ%3D%3D",
      "post_date": "2025-10-09",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "Ready to ditch the traditional 9-5 grind? If you are an English speaker living in India join our community as a Media Search Analyst, set your own flexible schedule and complete engaging tasks with an innovative web-based evaluation tool!What You’ll Do As A Media Search Analyst:Assess diverse media categories: music, books, podcasts, videos, and more.Evaluate app store content, ensuring search result accuracy and relevance.Utilize your cultural knowledge and market expertise to validate query intent.Why Join the AI Community?Be part of the global and diverse TELUS Digital AI Community with 1M+ global contributors.Support machine learning for world-leading brands with no prior professional experience.Make use of your communication and analytical skills and enjoy extra income with great flexibility!Basic Requirement and Assessment:Full Professional Proficiency in English and being a resident on India for the past year, aware of local media and trends.An active Apple ID email address is essential, ownership of an Apple device and familiarity with Apple products.Complete ID verification at your convenience within a specific timeframe and pass an open book qualification exam with guidelines provided.Join us today and help revolutionize digital media content!\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Data Analyst (Bangkok Based, relocation provided)",
      "company": "Agoda",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/data-analyst-bangkok-based-relocation-provided-at-agoda-4299767577?position=2&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=4ImGoUdzDx8%2F%2FjeB4E%2B%2FGw%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "About AgodaAgoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with a global network of 4.7M hotels and holiday properties worldwide, plus flights, activities, and more. Based in Asia and part of Booking Holdings, our 7,100+ employees representing 95+ nationalities in 27 markets foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.Our Purpose - Bridging the World Through Travel We believe travel allows people to enjoy, learn and experience more of the amazing world we live in. It brings individuals and cultures closer together, fostering empathy, understanding and happiness.We are a skillful, driven and diverse team from across the globe, united by a passion to make an impact. Harnessing our innovative technologies and strong partnerships, we aim to make travel easy and rewarding for everyone.This role is based in Bangkok, Thailand, and is open to candidates worldwide. We offer a generous relocation package to ensure a smooth transition to living and working in Bangkok.Get to Know our Team:The Performance Marketing Team of Agoda is a world leader in online marketing. This department is highly data-driven and focused on developing at-scale marketing programs that improve the lifetime value of Agoda customers through measurable marketing programs and channels. The team is a blend of the best analysts, marketing strategists, and data scientists in the world. The marketing leadership at Agoda have deep experience in data science, product, strategy, and other marketing fields and have built an organization that thrives on data, creative ideas, and technology. The Performance Marketing Team also fosters a great learning environment. You will be able to learn and grow by working closely with experts from a variety of backgrounds from all over the world.In this Role, you’ll get to:Search: Experiment with text ads, bidding, and campaign structures on Google, Bing, Baidu, Naver, and other search engines. Adapt to new product features and roll out changes from successful tests.Display: Test, analyze, and optimize campaigns on Facebook, Twitter, Instagram, and others.Modeling: Analyze the vast amounts of data generated by experiments, develop models we can use for optimization, and build dashboards for account managers.What you’ll Need to Succeed:2–3 years of experienceBachelor’s Degree or higher from top university in a quantitative subject (computer science, mathematics, economics, engineering, statistics or science)Strong English communicationSolid business acumenStrong statistical and analytical skillsProficient in Excel and hands-on with data tools (SAS, R, SPSS, Python, VBA, SQL, Tableau)Experience designing and analyzing A/B testsWorks independently on daily analytics tasks and provides business recommendationsIt’s Great if you Have:Experience in digital marketingAcademic research experience#Bengaluru #SãoPaulo #Delhi #NewYorkCity #Nigeria #London #Hyderabad #Pune #Mumbai #Colombia #Paris #Jakarta #Chennai #SanFrancisco #WashingtonDC #Toronto #Pakistan #LosAngeles #Dallas #Chicago #Kenya #Boston #Shanghai #Egypt #BuenosAires #Manila #Netherlands #Singapore #RiodeJaneiro #Beijing #Atlanta #Sydney #Madrid #Vietnam #SaudiArabia #Peru #Melbourne #Ireland #Russia #Bangladesh #MexicoCity #Philadelphia #Chile #SeattleArea #Noida #Kolkata #Guangdong #UnitedArabEmirates #TelAvivDistrict #Houston #KualaLumpur #BeloHorizonte #SouthKorea #Bangkok #Istanbul #Austin #Curitiba #Warsaw #Campinas #Barcelona #Ukraine #CostaRica #Berlin #Romania #Denver #Johannesburg #Minneapolis #Manchester #Miami #Phoenix #Detroit #Coimbatore #Milan #PortoAlegre #Vancouver #Montreal #Charlotte #SanDiego #Ghana #SaltLakeCity #Raleigh #HongKong #Munich #Prague #Ecuador #TampaBay #Tokyo #Serbia  #Taipei #Cracow #Zhejiang #CapeTown #Brasilia #Columbus #Ahmedabad #Indore #Kochi #Gurgaon #Chandigarh #Lucknow #Bhubaneswar #Thiruvananthapuram #Visakhapatnam #Bhopal #JerseyCity #Irving #Denton #Worcester #Arlington #OverlandPark #AuroraDistrict #Baltimore #Tampa #Halethorpe #Dayton #Syracuse #Chonburi #ChiangMai #NakhonRatchasima #KhonKaen #HatYai #Phuket #Surabaya #Tangerang #Birmingham #Casablanca #Rabat #Camp #PetalingJaya #GeorgeTownDiscover More About Working At AgodaAgoda Careers https://careersatagoda.comFacebook https://www.facebook.com/agodacareers/LinkedIn https://www.linkedin.com/company/agodaYouTube https://www.youtube.com/agodalifeEqual Opportunity Employer At Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.We will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy.DisclaimerWe do not accept any terms or conditions, nor do we recognize any agency’s representation of a candidate, from unsolicited third-party or agency submissions. If we receive unsolicited or speculative CVs, we reserve the right to contact and hire the candidate directly without any obligation to pay a recruitment fee.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "SQL",
        "Tableau",
        "R",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Online Data Analyst",
      "company": "TELUS Digital AI Data Solutions",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/online-data-analyst-at-telus-digital-ai-data-solutions-4306720401?position=3&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=OFPZxx0K1AZUlBUvx9bZew%3D%3D",
      "post_date": "2025-09-26",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "Online Data Analyst - Urdu (IN)Job Description:Are you a detail-oriented individual with a passion for research and a good understanding of national and local geography? This freelance opportunity allows you to work at your own pace and from the comfort of your own home.A Day in the Life of an Online Data Analyst:In this role, you will be working on a project aimed at enhancing the content and quality of digital maps that are used by millions of people worldwideCompleting research and evaluation tasks in a web-based environment such as verifying and comparing data, and determining the relevance and accuracy of information.Join us today and be part of a dynamic and innovative team that is making a difference in the world!TELUS Digital AI CommunityOur global AI Community is a vibrant network of 1 million+ contributors from diverse backgrounds who help our customers collect, enhance, train, translate, and localize content to build better AI models. Become part of our growing community and make an impact supporting the machine learning models of some of the world’s largest brands.Qualification Path:No previous professional experience is required to apply to this role, however, working on this project will require you to pass the basic requirements and go through a standard assessment process. This is a part-time long-term project and your work will be subject to our standard quality assurance checks during the term of this agreement.Basic RequirementsReading and Writing proficiency in Urdu & basic English proficiencyBeing a resident in India for the last 2 consecutive years and having familiarity with current and historical business, media, sport, news, social media, and cultural affairs in IndiaAbility to follow guidelines and conduct online research using search engines, online maps, and website informationFlexibility to work across a diverse set of task types, including maps, news, audio tasks, and relevanceDaily access to a broadband internet connection, computer, and relevant softwareAssessment:In order to be hired into the program, you’ll take an open book qualification exam that will determine your suitability for the position and complete ID verification. Our team will provide you with guidelines and learning materials before your qualification exam. You will be required to complete the exam in a specific timeframe but at your convenience.Equal OpportunityAll qualified applicants will receive consideration for a contractual relationship without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. At TELUS Digital AI, we are proud to offer equal opportunities and are committed to creating a diverse and inclusive community. All aspects of selection are based on applicants’ qualifications, merits, competence, and performance without regard to any characteristic related to diversity.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "go"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Lead Data Analyst",
      "company": "Technip Energies",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/lead-data-analyst-at-technip-energies-4290595690?position=4&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=673Tqyb1ow79by53%2BHl7jw%3D%3D",
      "post_date": "2025-10-07",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "Job DescriptionBe part of the solution at Technip Energies and embark on a one-of-a-kind journey. You will be helping to develop cutting-edge solutions to solve real-world energy problems.About us:Technip Energies is a global technology and engineering powerhouse. With leadership positions in LNG, hydrogen, ethylene, sustainable chemistry, and CO2 management, we are contributing to the development of critical markets such as energy, energy derivatives, decarbonization, and circularity. Our complementary business segments, Technology, Products and Services (TPS) and Project Delivery, turn innovation into scalable and industrial reality.Through collaboration and excellence in execution, our 17,000+ employees across 34 countries are fully committed to bridging prosperity with sustainability for a world designed to last.Global Business Services IndiaAt Technip Energies, we are continually looking for ways to become more efficient, and ways to improve our quality, customer focus and cost competitiveness. T.EN Global Business Services (TGBS) organization is key to executing this strategy, by standardizing our processes and centralizing our services.Our Vision: A customer focused, cost efficient, innovative, and high performing organization that drives functional excellence.GBS provide streamlined and consistent services to our internal customers in the domain of Finance and Accounting, Human Resources, Business Functional Support, Procurement and Legal. Our services fit our global organization and allow us to focus on business strategy and priorities. GBS also maintains continuous improvement plans to enhance our customer-oriented service culture.About the role:We are currently seeking a Lead Data Analyst, to join our team based in Noida.Responsibilities:The Lead Data Analyst will work closely with the business and has a dynamic role that bridges technical data analysis with strategic business insights. The Lead Data Analyst should possess quick and strong comprehension skills, enabling them to rapidly learn how to consume and present data using Power BI. The Lead Data Analyst should have a great capacity for adaptation, strong proactivity, and a passion for support are essential to successfully carry out this mission.Starting Date: ImmediatelyQualifications: Minimum 5 years of experience in Power BIProficient in SQL, DAX, M, and PythonStrong analytical problem solver with an organized approachCapable of training project team membersGreat writing skills for drafting technical and functional documentationData-driven mindset, product and result-orientedAbility to act independently and as a top-level contributor in resolving project strategy, scope, and directionExcellent organizational skills with a proven ability to achieve resultsStrong data acumen and deep understanding of data modelling techniquesMinimum 1 year of experience in Microsoft Azure (Azure Storage, Synapse)Certifications in Microsoft Azure, Data Analytics, and Power BI (PL-300)Fluent in EnglishNice to have:Engineering backgroundMathematical & Analytics DegreeExperience in Data ScienceAzure ML certificationWork experience: Minimum 10 yearsData related projects: 5 years minimumMinimum education level: Bachelor’s DegreeYour career with us Working at Technip Energies is an inspiring journey, filled with groundbreaking projects and dynamic collaborations. Surrounded by diverse and talented individuals, you will feel welcomed, respected, and engaged. Enjoy a safe, caring environment where you can spark new ideas, reimagine the future, and lead change. As your career grows, you will benefit from learning opportunities at T.EN University, such as The Future Ready Program, Graduate Program, and from the support of your manager through check-in moments like the Mid-Year Development Review, fostering continuous growth and development.What’s Next?Once receiving your system application, our recruiting team will screen and match your skills, experience, and potential team fit against the role requirements. We ask for your patience as the team completes the volume of applications with reasonable timeframe. Check your application progress periodically via personal account from created candidate profile during your application.We invite you to get to know more about our company by visiting www.ten.com and follow us on LinkedIn , Instagram , Facebook , X and YouTube for company updates.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "SQL",
        "Azure",
        "spark",
        "Power BI"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Remote|Freelance Data Analyst - Hindi Speaking",
      "company": "TELUS Digital",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/remote-freelance-data-analyst-hindi-speaking-at-telus-digital-4304642687?position=5&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=qQNI0CqUWWxEHCaV0EZU9Q%3D%3D",
      "post_date": "2025-09-23",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "Are you a detail-oriented individual with a passion for research and a good understanding of national and local geography? This freelance opportunity allows you to work at your own pace and from the comfort of your own home.A Day in the Life of an Online Data Analyst:In this role, you will be working on a project aimed at enhancing the content and quality of digital maps that are used by millions of people worldwideCompleting research and evaluation tasks in a web-based environment such as verifying and comparing data, and determining the relevance and accuracy of information.Join us today and be part of a dynamic and innovative team that is making a difference in the world!TELUS Digital AI CommunityOur global AI Community is a vibrant network of 1 million+ contributors from diverse backgrounds who help our customers collect, enhance, train, translate, and localize content to build better AI models. Become part of our growing community and make an impact supporting the machine learning models of some of the world’s largest brands.Qualification pathNo previous professional experience is required to apply to this role, however, working on this project will require you to pass the basic requirements and go through a standard assessment process. This is a part-time long-term project and your work will be subject to our standard quality assurance checks during the term of this agreement.Basic RequirementsFull Professional Proficiency in English & Hindi languageBeing a resident in India for the last 2 consecutive years and having familiarity with current and historical business, media, sport, news, social media, and cultural affairs in India.Ability to follow guidelines and conduct online research using search engines, online maps, and website informationFlexibility to work across a diverse set of task types, including maps, news, audio tasks, and relevanceDaily access to a broadband internet connection, computer, and relevant softwareAssessmentIn order to be hired into the program, you’ll take an open book qualification exam that will determine your suitability for the position and complete ID verification. Our team will provide you with guidelines and learning materials before your qualification exam. You will be required to complete the exam in a specific timeframe but at your convenience.Equal OpportunityAll qualified applicants will receive consideration for a contractual relationship without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. At TELUS Digital AI, we are proud to offer equal opportunities and are committed to creating a diverse and inclusive community. All aspects of selection are based on applicants’ qualifications, merits, competence, and performance without regard to any characteristic related to diversity.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "go"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Associate Data Analyst (New Graduate, Thai Speaking) (Bangkok Based)",
      "company": "Agoda",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/associate-data-analyst-new-graduate-thai-speaking-bangkok-based-at-agoda-4299767619?position=6&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=1OmGnHv1SDeqPObLDh0lmw%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "About AgodaAgoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with a global network of 4.7M hotels and holiday properties worldwide, plus flights, activities, and more. Based in Asia and part of Booking Holdings, our 7,100+ employees representing 95+ nationalities in 27 markets foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.Our Purpose - Bridging the World Through Travel We believe travel allows people to enjoy, learn and experience more of the amazing world we live in. It brings individuals and cultures closer together, fostering empathy, understanding and happiness.We are a skillful, driven and diverse team from across the globe, united by a passion to make an impact. Harnessing our innovative technologies and strong partnerships, we aim to make travel easy and rewarding for everyone.Get to Know our Team:The Performance Marketing Team of Agoda is a world leader in online marketing. This department is highly data-driven and focused on developing at-scale marketing programs that improve the lifetime value of Agoda customers through measurable marketing programs and channels. The team is a blend of the best analysts, marketing strategists, and data scientists in the world. The marketing leadership at Agoda have deep experience in data science, product, strategy, and other marketing fields and have built an organization that thrives on data, creative ideas, and technology. The Performance Marketing Team also fosters a great learning environment. You will be able to learn and grow by working closely with experts from a variety of backgrounds from all over the world.In this Role, you’ll get to:Search: Experiment with text ads, bidding, and campaign structures on Google, Bing, Baidu, Naver, and other search engines. Adapt to new product features and roll out changes from successful tests.Display: Test, analyze, and optimize campaigns on Facebook, Twitter, Instagram, and others.Modeling: Analyze the vast amounts of data generated by experiments, develop models we can use for optimization, and build dashboards for account managers.What you’ll Need to Succeed:Bachelor’s Degree or higher from top university in a quantitative subject (computer science, mathematics, economics, engineering, statistics or science)Fresh graduation are welcome (0-1 years of experience)Ability to communicate fluently in EnglishBasic business acumenProficient in statistics and ExcelExposure to data tools (SAS, R, SPSS, Python, VBA, SQL, Tableau)Familiar with A/B testing conceptsWorks under close supervision and supports projects with guidanceIt’s Great if you Have:Experience in digital marketingAcademic research experience#Bengaluru #SãoPaulo #Delhi #NewYorkCity #Nigeria #London #Hyderabad #Pune #Mumbai #Colombia #Paris #Jakarta #Chennai #SanFrancisco #WashingtonDC #Toronto #Pakistan #LosAngeles #Dallas #Chicago #Kenya #Boston #Shanghai #Egypt #BuenosAires #Manila #Netherlands #Singapore #RiodeJaneiro #Beijing #Atlanta #Sydney #Madrid #Vietnam #SaudiArabia #Peru #Melbourne #Ireland #Russia #Bangladesh #MexicoCity #Philadelphia #Chile #SeattleArea #Noida #Kolkata #Guangdong #UnitedArabEmirates #TelAvivDistrict #Houston #KualaLumpur #BeloHorizonte #SouthKorea #Bangkok #Istanbul #Austin #Curitiba #Warsaw #Campinas #Barcelona #Ukraine #CostaRica #Berlin #Romania #Denver #Johannesburg #Minneapolis #Manchester #Miami #Phoenix #Detroit #Coimbatore #Milan #PortoAlegre #Vancouver #Montreal #Charlotte #SanDiego #Ghana #SaltLakeCity #Raleigh #HongKong #Munich #Prague #Ecuador #TampaBay #Tokyo #Serbia  #Taipei #Cracow #Zhejiang #CapeTown #Brasilia #Columbus #Ahmedabad #Indore #Kochi #Gurgaon #Chandigarh #Lucknow #Bhubaneswar #Thiruvananthapuram #Visakhapatnam #Bhopal #JerseyCity #Irving #Denton #Worcester #Arlington #OverlandPark #AuroraDistrict #Baltimore #Tampa #Halethorpe #Dayton #Syracuse #Chonburi #ChiangMai #NakhonRatchasima #KhonKaen #HatYai #Phuket #Surabaya #Tangerang #Birmingham #Casablanca #Rabat #Camp #PetalingJaya #GeorgeTownDiscover More About Working At AgodaAgoda Careers https://careersatagoda.comFacebook https://www.facebook.com/agodacareers/LinkedIn https://www.linkedin.com/company/agodaYouTube https://www.youtube.com/agodalifeEqual Opportunity Employer At Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.We will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy.DisclaimerWe do not accept any terms or conditions, nor do we recognize any agency’s representation of a candidate, from unsolicited third-party or agency submissions. If we receive unsolicited or speculative CVs, we reserve the right to contact and hire the candidate directly without any obligation to pay a recruitment fee.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "SQL",
        "Tableau",
        "R",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Online Data Analyst",
      "company": "TELUS Digital AI Data Solutions",
      "location": "Barabanki, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/online-data-analyst-at-telus-digital-ai-data-solutions-4306723337?position=7&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=SbwPCgBe6gPWtwveNcIuow%3D%3D",
      "post_date": "2025-09-26",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "Online Data Analyst - Urdu (IN)Job Description:Are you a detail-oriented individual with a passion for research and a good understanding of national and local geography? This freelance opportunity allows you to work at your own pace and from the comfort of your own home.A Day in the Life of an Online Data Analyst:In this role, you will be working on a project aimed at enhancing the content and quality of digital maps that are used by millions of people worldwideCompleting research and evaluation tasks in a web-based environment such as verifying and comparing data, and determining the relevance and accuracy of information.Join us today and be part of a dynamic and innovative team that is making a difference in the world!TELUS Digital AI CommunityOur global AI Community is a vibrant network of 1 million+ contributors from diverse backgrounds who help our customers collect, enhance, train, translate, and localize content to build better AI models. Become part of our growing community and make an impact supporting the machine learning models of some of the world’s largest brands.Qualification Path:No previous professional experience is required to apply to this role, however, working on this project will require you to pass the basic requirements and go through a standard assessment process. This is a part-time long-term project and your work will be subject to our standard quality assurance checks during the term of this agreement.Basic RequirementsReading and Writing proficiency in Urdu & basic English proficiencyBeing a resident in India for the last 2 consecutive years and having familiarity with current and historical business, media, sport, news, social media, and cultural affairs in IndiaAbility to follow guidelines and conduct online research using search engines, online maps, and website informationFlexibility to work across a diverse set of task types, including maps, news, audio tasks, and relevanceDaily access to a broadband internet connection, computer, and relevant softwareAssessment:In order to be hired into the program, you’ll take an open book qualification exam that will determine your suitability for the position and complete ID verification. Our team will provide you with guidelines and learning materials before your qualification exam. You will be required to complete the exam in a specific timeframe but at your convenience.Equal OpportunityAll qualified applicants will receive consideration for a contractual relationship without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or protected veteran status. At TELUS Digital AI, we are proud to offer equal opportunities and are committed to creating a diverse and inclusive community. All aspects of selection are based on applicants’ qualifications, merits, competence, and performance without regard to any characteristic related to diversity.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "go"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Senior Executive/Lead Analyst - Data Management (HR Ops)",
      "company": "Technip Energies",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/senior-executive-lead-analyst-data-management-hr-ops-at-technip-energies-4296881519?position=8&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=h5siAbE5GGlM6wuuwvnl0w%3D%3D",
      "post_date": "Not specified",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "Job DescriptionBe part of the solution at Technip Energies and embark on a one-of-a-kind journey. You will be helping to develop cutting-edge solutions to solve real-world energy problems.We are currently seeking Senior Executive/Lead Analyst - Data Management (HR Ops), to join our HR Operations team based in Noida.About us:Technip Energies is a global technology and engineering powerhouse. With leadership positions in LNG, hydrogen, ethylene, sustainable chemistry, and CO2 management, we are contributing to the development of critical markets such as energy, energy derivatives, decarbonization, and circularity. Our complementary business segments, Technology, Products and Services (TPS) and Project Delivery, turn innovation into scalable and industrial reality.Through collaboration and excellence in execution, our 17,000+ employees across 34 countries are fully committed to bridging prosperity with sustainability for a world designed to last.Global Business Services IndiaAt Technip Energies, we are continually looking for ways to become more efficient, and ways to improve our quality, customer focus and cost competitiveness. The Global Business Services (GBS) organization is key to executing this strategy, by standardizing our processes and centralizing our services.Our Vision : A customer focused, cost efficient, innovative, and high performing organization that drives functional excellence.GBS provide streamlined and consistent services to our internal customers in the domain of Finance and Accounting, Human Resources, Business Functional Support, Procurement and Legal. Our services fit our global organization and allow us to focus on business strategy and priorities. GBS also maintains continuous improvement plans to enhance our customer-oriented service culture.About the opportunity we offer:Your main role will be to manage the creation and maintenance of employee data globallyAssist the Payrolls Team with new hires’ payroll account enrollmentProcess reporting and trainingQueue management & maintaining SLAsUpdate SOP and other process documentsEnsuring compliance of all internal policiesProcess improvementProviding timely updates to TL and onshore counterpartsEnsure that trackers are inline and up to date for effective reporting.Create Monthly/ Quarterly Analysis and reports for senior business HR leadership. About you:A Bachelor’s degree is required or Master’s degree in HR or Business related field preferredShould have 3-7 years of experience in HR Operations with ERP tool like Oracle-HCM or SAP Good communication, analytical and management skills Effective/Accurate and timely reporting skillsGood command on MS Office applications (MS-Excel, MS-Word)Ability to multi task and should be a self-starterAbility to handle difficult client situations and derive strategic solutionsProficient in the use of Microsoft Office (Excel, Outlook, Powerpoint, and Word)Have strong attention to detail coupled with excellent organizational and documenting skillsAbility to work well independently as well as within a teamPossess superior time management and problem-solving skillsExcellent communication and presentation skillsHigh level of interpersonal skills and integrity and be a solid team playerYour career with us:Working at Technip Energies is an inspiring journey, filled with groundbreaking projects and dynamic collaborations. Surrounded by diverse and talented individuals, you will feel welcomed, respected, and engaged. Enjoy a safe, caring environment where you can spark new ideas, reimagine the future, and lead change. As your career grows, you will benefit from learning opportunities at T.EN University, such as The Future Ready Program, and from the support of your manager through check-in moments like the Mid-Year Development Review, fostering continuous growth and developmentWhat’s next?Once receiving your application, our Talent Acquisition professionals will screen and match your profile against the role requirements. We ask for your patience as the team completes the volume of applications with reasonable timeframe. Check your application progress periodically via personal account from created candidate profile during your application.We invite you to get to know more about our company by visiting and follow us on LinkedIn, Instagram, Facebook, X and YouTube for company updates.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "spark"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Senior Data Analyst (Bangkok Based, relocation provided)",
      "company": "Agoda",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/senior-data-analyst-bangkok-based-relocation-provided-at-agoda-4299777192?position=9&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=ijoSQHLd5kxfWwxB3eGBRg%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "About AgodaAgoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with a global network of 4.7M hotels and holiday properties worldwide, plus flights, activities, and more. Based in Asia and part of Booking Holdings, our 7,100+ employees representing 95+ nationalities in 27 markets foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.Our Purpose - Bridging the World Through Travel We believe travel allows people to enjoy, learn and experience more of the amazing world we live in. It brings individuals and cultures closer together, fostering empathy, understanding and happiness.We are a skillful, driven and diverse team from across the globe, united by a passion to make an impact. Harnessing our innovative technologies and strong partnerships, we aim to make travel easy and rewarding for everyone.Get to Know our Team:The Performance Marketing Team of Agoda is a world leader in online marketing. This department is highly data-driven and focused on developing at-scale marketing programs that improve the lifetime value of Agoda customers through measurable marketing programs and channels. The team is a blend of the best analysts, marketing strategists, and data scientists in the world. The marketing leadership at Agoda have deep experience in data science, product, strategy, and other marketing fields and have built an organization that thrives on data, creative ideas, and technology. The Performance Marketing Team also fosters a great learning environment. You will be able to learn and grow by working closely with experts from a variety of backgrounds from all over the world.In this Role, you’ll get to:Search: Experiment with text ads, bidding, and campaign structures on Google, Bing, Baidu, Naver, and other search engines. Adapt to new product features and roll out changes from successful tests.Display: Test, analyze, and optimize campaigns on Facebook, Twitter, Instagram, and others.Modeling: Analyze the vast amounts of data generated by experiments, develop models we can use for optimization, and build dashboards for account managers.What you’ll Need to Succeed:4–5 years of experienceBachelor’s Degree or higher from top university in a quantitative subject (computer science, mathematics, economics, engineering, statistics or science)Excellent English communicationAdvanced business acumenAdvanced statistical and analytical skillsAdvanced Excel and data tool expertise (SAS, R, SPSS, Python, VBA, SQL, Tableau)Leads A/B testing initiatives and interprets results for business impactOperates independently, leads complex projects, and mentors junior analystsIt’s Great if you Have:Experience in digital marketingAcademic research experience#Bengaluru #SãoPaulo #Delhi #NewYorkCity #Nigeria #London #Hyderabad #Pune #Mumbai #Colombia #Paris #Jakarta #Chennai #SanFrancisco #WashingtonDC #Toronto #Pakistan #LosAngeles #Dallas #Chicago #Kenya #Boston #Shanghai #Egypt #BuenosAires #Manila #Netherlands #Singapore #RiodeJaneiro #Beijing #Atlanta #Sydney #Madrid #Vietnam #SaudiArabia #Peru #Melbourne #Ireland #Russia #Bangladesh #MexicoCity #Philadelphia #Chile #SeattleArea #Noida #Kolkata #Guangdong #UnitedArabEmirates #TelAvivDistrict #Houston #KualaLumpur #BeloHorizonte #SouthKorea #Bangkok #Istanbul #Austin #Curitiba #Warsaw #Campinas #Barcelona #Ukraine #CostaRica #Berlin #Romania #Denver #Johannesburg #Minneapolis #Manchester #Miami #Phoenix #Detroit #Coimbatore #Milan #PortoAlegre #Vancouver #Montreal #Charlotte #SanDiego #Ghana #SaltLakeCity #Raleigh #HongKong #Munich #Prague #Ecuador #TampaBay #Tokyo #Serbia  #Taipei #Cracow #Zhejiang #CapeTown #Brasilia #Columbus #Ahmedabad #Indore #Kochi #Gurgaon #Chandigarh #Lucknow #Bhubaneswar #Thiruvananthapuram #Visakhapatnam #Bhopal #JerseyCity #Irving #Denton #Worcester #Arlington #OverlandPark #AuroraDistrict #Baltimore #Tampa #Halethorpe #Dayton #Syracuse #Chonburi #ChiangMai #NakhonRatchasima #KhonKaen #HatYai #Phuket #Surabaya #Tangerang #Birmingham #Casablanca #Rabat #Camp #PetalingJaya #GeorgeTownDiscover More About Working At AgodaAgoda Careers https://careersatagoda.comFacebook https://www.facebook.com/agodacareers/LinkedIn https://www.linkedin.com/company/agodaYouTube https://www.youtube.com/agodalifeEqual Opportunity Employer At Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.We will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy.DisclaimerWe do not accept any terms or conditions, nor do we recognize any agency’s representation of a candidate, from unsolicited third-party or agency submissions. If we receive unsolicited or speculative CVs, we reserve the right to contact and hire the candidate directly without any obligation to pay a recruitment fee.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "SQL",
        "Tableau",
        "R",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Senior Data & Reporting Analyst",
      "company": "Uplers",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/senior-data-reporting-analyst-at-uplers-4310848572?position=10&pageNum=0&refId=VqZMlWMNdNGvwGOleumeHw%3D%3D&trackingId=RB9xeOgM9sI4MIGVQXQMcQ%3D%3D",
      "post_date": "2025-10-06",
      "scraped_at": "2025-10-20T18:18:29.708987",
      "source": "public_api",
      "description": "Experience: 5.00 + yearsSalary: Confidential (based on experience)Expected Notice Period: 15 DaysShift: (GMT+05:30) Asia/Kolkata (IST)Opportunity Type: RemotePlacement Type: Full Time Permanent position(Payroll and Compliance to be managed by: Uplers Solutions Pvt. Ltd.)(*Note: This is a requirement for one of Uplers' client - Ireland IT Service Company)What do you need for this opportunity?Must have skills required:Analytical Mindset, Business Central, Dynamics 365, machine learning workflows within Fabric, Microsoft Certified: Fabric Analytics Engineer Associate, BI, Data Analytics, Lakehouse, Microsoft Fabric, PMO, Synapse Analytics, warehouse implementation, Azure Data FactoryIreland IT Service Company is Looking for: Senior Data & Reporting Analyst (Microsoft Fabric Focus)OverviewAs a Senior Data & Reporting Analyst, you will lead the design and delivery of advanced reporting and analytics solutions using Microsoft Fabric, with a particular emphasis on Lakehouse and Warehouse architectures. You will transform complex datasets into actionable insights, support cross-functional teams, and ensure robust data governance and reporting standards across the organization.This role demands technical expertise in Microsoft Fabric, Power BI, and SQL, alongside strong analytical and communication skills to collaborate with IT, finance, operations, and project management teams.Key Responsibilities Design and implement scalable data solutions using Microsoft Fabric Lakehouses and Warehouses, leveraging medallion architecture (Bronze, Silver, Gold layers) for structured and unstructured data. Build and maintain pipelines using Fabric Data Pipelines, Dataflow Gen2, and Notebooks (PySpark) to ingest, cleanse, and transform data from diverse sources. Develop interactive dashboards and reports in Power BI, applying advanced DAX and MQuery techniques to deliver real-time and historical insights. Implement role-based access controls, row-level security, and compliance frameworks to ensure data integrity and secure reporting. Collaborate with business units to gather requirements, conduct workshops, and translate data needs into functional reporting solutions. Monitor and troubleshoot data pipelines and reporting tools, applying performance tuning and error handling best practices. Create technical and functional documentation, support training initiatives, and promote self-service reporting capabilities.Required Skills & Experience Bachelor’s degree in Computer Science, Information Systems, or related field. Advanced degrees are a plus. 5+ years in data analytics, BI, or PMO roles within complex programme environments. Proven delivery of Microsoft Fabric-based solutions, including Lakehouse and Warehouse implementations. Proficiency in Microsoft Fabric (Lakehouse, Warehouse, Pipelines, Notebooks), Power BI (DAX, MQuery, data modelling), SQL Server, T-SQL, Python/PySpark. Experience with Azure Data Factory, Synapse Analytics, Data Lake Gen2. Microsoft Certified: Fabric Analytics Engineer Associate (preferred). Strong analytical mindset and attention to detail. Excellent communication and presentation skills. Ability to work independently and collaboratively in fast-paced environments.Desirable Attributes Experience with Business Central, Dynamics 365, or other ERP systems. Familiarity with Agile delivery, Azure DevOps, and version control. Understanding of commercial management and business strategy alignment. Exposure to AI-driven analytics and machine learning workflows within Fabric.How to apply for this opportunity?Step 1: Click On Apply! And Register or Login on our portal.Step 2: Complete the Screening Form & Upload updated ResumeStep 3: Increase your chances to get shortlisted & meet the client for the Interview!About Uplers:Our goal is to make hiring reliable, simple, and fast. Our role will be to help all our talents find and apply for relevant contractual onsite opportunities and progress in their career. We will support any grievances or challenges you may face during the engagement.(Note: There are many more opportunities apart from this on the portal. Depending on the assessments you clear, you can apply for them as well).So, if you are ready for a new challenge, a great work environment, and an opportunity to take your career to the next level, don't hesitate to apply today. We are waiting for you!\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Power BI",
        "SQL",
        "Azure",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Manger - Ecommerce Analytics 20O25",
      "company": "TALENTMATE",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/manger-ecommerce-analytics-20o25-at-talentmate-4317033128?position=1&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=ZCsU4efNiWx9ANo6zli%2FaQ%3D%3D",
      "post_date": "2025-10-19",
      "scraped_at": "2025-10-20T18:18:38.998699",
      "source": "public_api",
      "description": "Job DescriptionThe Manager - Ecommerce Analytics is a pivotal role within our organization, responsible for shaping the data-driven strategies that guide our ecommerce operations. As a leader, you will oversee a team of analysts dedicated to extracting, interpreting, and transforming ecommerce data into actionable insights that drive business growth and improve customer experience. The ideal candidate will possess strong analytical skills, coupled with experience in ecommerce platforms and a deep understanding of consumer behavior. Your expertise will guide the development of key performance indicators, inform strategic decisions, and optimize digital marketing efforts. This role demands a proactive and innovative thinker who can communicate complex data insights to non-technical stakeholders, bridging the gap between analytics and business objectives.ResponsibilitiesLead a team of ecommerce analysts to deliver data-driven insights and solutions.Develop and implement ecommerce analytics strategies aligned with business goals.Collaborate with cross-functional teams to integrate analytics into business processes.Analyze customer data to understand trends, patterns, and consumer behavior.Monitor key performance indicators to assess the effectiveness of ecommerce initiatives.Present findings and recommendations to senior management and stakeholders regularly.Ensure data accuracy and integrity across all product tracking and reporting systems.Oversee the creation of dashboards and visualizations for data reporting purposes.Identify opportunities for process improvements using advanced analytics techniques.Recruit, mentor, and develop team members to enhance their analytical skills.Stay updated on the latest ecommerce analytics trends and tools in the industry.Manage relationships with third-party vendors and data service providers as necessary.RequirementsBachelor's degree in Business, Finance, Statistics, or a related field required.Minimum of five years of professional experience in ecommerce analytics roles.Strong proficiency in data analysis tools such as SQL, R, or Python is essential.Proven experience in managing and leading analytical teams effectively.Excellent communication skills to convey complex data insights to stakeholders.In-depth knowledge of ecommerce platforms like Shopify, Magento, or WooCommerce.Ability to drive strategic initiatives and deliver results in a fast-paced environment.Job DetailsRole Level: Mid-Level Work Type: Full-Time Country: India City: Uttar Pradesh Company Website: https://www.talentmate.com Job Function: E-commerce & Online Sales Company Industry/Sector: Recruitment & StaffingWhat We OfferAbout The CompanySearching, interviewing and hiring are all part of the professional life. The TALENTMATE Portal idea is to fill and help professionals doing one of them by bringing together the requisites under One Roof. Whether you're hunting for your Next Job Opportunity or Looking for Potential Employers, we're here to lend you a Helping Hand.ReportSimilar JobsSenior Devops EngineerTalentmateCall Monitoring Specialist US Banks Associate Wealth ManagementTalentmateProduct Owner Business Data Analyst - ManagerTalentmateSoftware Quality Assurance - ManagerTalentmateMiddle Office Trade Administrator - Senior ManagerTalentmatePrincipal Nodal OfficerTalentmateDisclaimer: talentmate.com is only a platform to bring jobseekers & employers together. Applicants are advised to research the bonafides of the prospective employer independently. We do NOT endorse any requests for money payments and strictly advice against sharing personal or bank related information. We also recommend you visit Security Advice for more information. If you suspect any fraud or malpractice, email us at abuse@talentmate.com.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "SQL",
        "R",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Associate System Engineer",
      "company": "IBM",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/associate-system-engineer-at-ibm-4313846364?position=2&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=OmI4WKIVREbQNVV7crZreA%3D%3D",
      "post_date": "2025-10-18",
      "scraped_at": "2025-10-20T18:18:39.002796",
      "source": "public_api",
      "description": "IntroductionA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe.You'll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolio; including Software and Red Hat.Curiosity and a constant quest for knowledge serve as the foundation to success in IBM Consulting. In your role, you'll be encouraged to challenge the norm, investigate ideas outside of your role, and come up with creative solutions resulting in ground breaking impact for a wide network of clients. Our culture of evolution and empathy centers on long-term career growth and development opportunities in an environment that embraces your unique skills and experience.Your Role And ResponsibilitiesAs a Software Developer you'll participate in many aspects of the software development lifecycle, such as design, code implementation, testing, and support. You will create software that enables your clients' hybrid-cloud and AI journeys.You'll have the opportunity to work with the latest technologies, ensuring the applications delivered are high performing, highly available, responsive, and maintainable.Your Primary Responsibilities IncludeAnalytical Problem-Solving and Solution Enhancement: Analyze, validate and propose improvements to existing failures, with the support of the architect and technical leader.Comprehensive Engagement Across Process Phases: Involvement in every step of the process, from design, development, testing release changes and troubleshoot where necessary, providing a great customer service.Strategic Stakeholder Engagement and Innovative Coding Solutions: Drive key discussions with your stakeholders and analyze the current landscape for opportunities to operate and code creative solutions.Preferred EducationBachelor's DegreeRequired Technical And Professional Expertise Programming (preferably in Java, C++, Python, Node.js). Software Development Life Cycle Concepts No active backlogs. This is an entry level Off-Campus hiring position and the candidates must have obtained their degree before the start of employment with IBM. Year of Pass out should be 2025 only. BE / BTech Computer Science (all CS batches like CSE, AIML , DS , Cloud Computing, Big Data Analytics, CSBS , IOT , Robotics, AI , CyberSecurity, BlockChain to name a few) and Information Technology related branches with 6 CGPA/60%. Fluent Communication skills (written and spoken).Preferred Technical And Professional Experience Engineering Background, Problem Solving. Good interpersonal skills. Should be flexible to work from anywhere in India.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Node.js",
        "Java",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Python Developer (Fresher)",
      "company": "Golden Gate Restaurant Group",
      "location": "Malihabad, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/python-developer-fresher-at-golden-gate-restaurant-group-4286649875?position=3&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=pGGVrxfOK51lNYWVe9qYnQ%3D%3D",
      "post_date": "2025-08-15",
      "scraped_at": "2025-10-20T18:18:39.002796",
      "source": "public_api",
      "description": "MÔ TẢ CÔNG VIỆCVị trí Python Developer – Fresher sẽ hỗ trợ nhóm phát triển trong việc xây dựng, bảo trì và tối ưu các ứng dụng Web/API sử dụng Python.Ứng viên sẽ được hướng dẫn tham gia đầy đủ các giai đoạn phát triển phần mềm từ thiết kế, lập trình, kiểm thử đến triển khai, dưới sự hỗ trợ của các lập trình viên giàu kinh nghiệm. Hỗ trợ phát triển ứng dụngTham gia viết và chỉnh sửa API phục vụ Web và Mobile App dưới sự hướng dẫn của Senior Developer.Học và áp dụng framework Python (Django, Flask) vào dự án thực tế. Làm việc với cơ sở dữ liệuViết và chạy các truy vấn SQL cơ bản trên PostgreSQL hoặc MySQL.Hỗ trợ kiểm tra và xử lý dữ liệu theo yêu cầu dự án. Kiểm thử và sửa lỗiThực hiện unit test đơn giản hoặc test API bằng Postman.Hỗ trợ phát hiện và sửa lỗi theo hướng dẫn của team. Nghiên cứu & học hỏi công nghệ mớiTìm hiểu các công cụ DevOps cơ bản (Git, Docker).Cập nhật tiến độ công việc và trao đổi thường xuyên với nhóm lập trình. Tuân thủ quy trình phát triển phần mềmViết code rõ ràng, tuân thủ coding convention của team.Tham gia họp nhóm và báo cáo công việc định kỳ.YÊU CẦU CÔNG VIỆCHọc vấnSinh viên năm cuối hoặc mới tốt nghiệp các ngành CNTT, Khoa học Máy tính, Kỹ thuật Phần mềm hoặc ngành liên quan.Có kiến thức cơ bản về lập trình Python và nguyên lý phát triển phần mềm.Từng tham gia dự án môn học hoặc dự án cá nhân là lợi thế.Kinh nghiệmKhông yêu cầu kinh nghiệm thực tế, ưu tiên ứng viên từng thực tập hoặc có project cá nhân liên quan đến Python.Có kinh nghiệm với Django hoặc Flask là lợi thế.Đã từng làm việc nhóm trong môi trường dự án phần mềm (trong trường hoặc bên ngoài) là điểm cộng.Kỹ năng chuyên mônThành thạo kiến thức cơ bản Python 3.x (biến, kiểu dữ liệu, vòng lặp, hàm, xử lý file).Hiểu RESTful API và cách hoạt động của backend.Sử dụng cơ bản Django hoặc Flask (routing, view, model).Sử dụng cơ bản PostgreSQL hoặc MySQL, viết được truy vấn SQL đơn giản.Dùng Postman để test API, hiểu unit test (unittest hoặc pytest).Biết sử dụng Git và hiểu cơ bản về Docker.Kỹ năng mềmHam học hỏi, tiếp thu nhanh công nghệ mới.Giao tiếp rõ ràng, hợp tác tốt trong nhóm.Cẩn thận, kiên nhẫn và có tinh thần trách nhiệm.Ưu tiênĐã từng code mini project hoặc website nhỏ với Python.Có kiến thức cơ bản về bảo mật (SQL Injection, XSS).QUYỀN LỢILương tháng 13 + thưởng cuối năm.Được đào tạo và hướng dẫn trực tiếp bởi Senior Developer.Cơ hội tham gia dự án thực tế của tập đoàn F&B hàng đầu Việt Nam.Lộ trình thăng tiến lên vị trí lập trình viên chính thức sau khi hoàn thành thời gian Fresher/Internship.Ưu đãi giảm giá khi sử dụng dịch vụ tại hệ thống nhà hàng Golden Gate.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "PostgreSQL",
        "Flask",
        "Docker",
        "SQL",
        "Django",
        "MySQL",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "SDE2",
      "company": "Amazon",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/sde2-at-amazon-4294612137?position=4&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=TyMMeoFot44Rbr5l3dqbBQ%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:18:39.002796",
      "source": "public_api",
      "description": "DescriptionThis role is for the AFT Inbound Foundations and Routing team (IBFR) team which is responsible to build core software components/services that orchestrate the movement of inventory within a warehouse and interfacing with sortation and SCOT systems for high fidelity promise and planning decisions. Worldwide, the IBFR team supports 570+ FCs across NA, EU and JP regions.With rapid expansion into new geographies, innovations in supply chain, delivery models and customer experience, increasingly complex transportation network, ever expanding selection of products and growing number of shipments worldwide, we have an opportunity to build software that scales the business, leads the industry through innovation and delights millions of customers worldwide. We have challenging problems (both business and technical) that leverages new technologies that support our high volume, low latency and high availability services.If you are looking for an opportunity to solve deep technical problems and build innovative solutions in a fast paced environment working with smart, passionate software developers, this might be the role for you. A successful candidate for this position will be able to build new software from the ground up, create pragmatic solutions for complex business problems, enjoy working closely with operations staff in Amazon fulfillment centers around the world.Key job responsibilities3+ years of non-internship professional software development experience2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experienceExperience programming with at least one software programming languageBasic Qualifications 3+ years of non-internship professional software development experience 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience Experience programming with at least one software programming languagePreferred Qualifications 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience Bachelor's degree in computer science or equivalentOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit https://amazon.jobs/content/en/how-we-hire/accommodations for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.Company - Amazon Dev Center India - HyderabadJob ID: A3070477\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Application Developer-Open Source",
      "company": "IBM",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/application-developer-open-source-at-ibm-4307567989?position=5&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=Y1URitrc2VdWxVragp%2BsZQ%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:39.002796",
      "source": "public_api",
      "description": "IntroductionA career in IBM Consulting is rooted by long-term relationships and close collaboration with clients across the globe. You'll work with visionaries across multiple industries to improve the hybrid cloud and AI journey for the most innovative and valuable companies in the world. Your ability to accelerate impact and make meaningful change for your clients is enabled by our strategic partner ecosystem and our robust technology platforms across the IBM portfolioYour Role And ResponsibilitiesManaging and developing C++ Applications.Bringing your expertise to solve the application criticality.C++ coding experience for product application.Experience on design, code development, unit test and maintain code quality as defined by projectPreferred EducationMaster's DegreeRequired Technical And Professional Expertise3-7 Years of C++ programming language experience.Good Knowledge required on QT.Should be able to design, code independentlyPreferred Technical And Professional ExperienceCreative problem solving skills and excellent Communication Skill\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Executive - Business Analyst",
      "company": "Gramik™",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/executive-business-analyst-at-gramik%E2%84%A2-4232600157?position=6&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=Wvi2SWf5ctXxAqwaLtFWTA%3D%3D",
      "post_date": "2025-05-22",
      "scraped_at": "2025-10-20T18:18:39.002796",
      "source": "public_api",
      "description": "Job Title: Business AnalystLocation: LucknowGramik is an agri-tech startup on a mission to empower farmers through technology,transparency, and efficient last-mile delivery. Operating through a unique dual model—B2Cvia Village Level Entrepreneurs (VLEs) and B2B through retail partnerships—we deliverhigh-quality agri-inputs and cattle feed supplements while enabling rural entrepreneurship.Job SummaryWe are seeking a dynamic and data-driven Business Analyst to join our growing team atGramik. You will play a critical role in evaluating performance across our B2C and B2Bverticals, analyzing data from rural markets, and recommending actionable strategies to drivegrowth, optimize supply chains, and improve farmer engagement.Key Responsibilities Analyze performance data from VLEs, retail sales, supply chain, and marketingcampaigns to identify trends, inefficiencies, and opportunities. Collaborate with cross-functional teams including Field Ops, Product, Sales, andMarketing to understand ground-level challenges and define scalable solutions. Create and maintain dashboards and reports for leadership to support strategicdecision-making. Support design, execution, and analysis of farmer surveys and feedback loops. Evaluate demand-generation activities and digital ad performance to optimize ROI. Assist in pricing strategy, demand forecasting, and inventory planning using real-timedata. Monitor KPIs related to VLE engagement, district/block-level sales trends, andfranchise performance. Translate business needs into functional requirements for tech and product teams.What You’ll Get Opportunity to drive meaningful impact in the lives of farmers and ruralentrepreneurs. Collaborative work culture with high autonomy and fast execution cycles. A chance to shape the future of inclusive agri-commerce in India.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Analyst -Business and Planning (Finance)",
      "company": "airtel",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/analyst-business-and-planning-finance-at-airtel-4313002350?position=7&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=K%2FbX14hkcXLbdrSAZCJydA%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:18:39.002796",
      "source": "public_api",
      "description": "About the Company-Bharti Airtel Limited is a leading global telecommunications company with operations in 18 countries across Asia and Africa. Headquartered in New Delhi, India. In India, the company's product offerings include 2G, 3G and 4G wireless services, mobile commerce, fixed line services, high speed home broadband, DTH, enterprise services including national & international long distance services to carriers. In the rest of the geographies, it offers 2G, 3G, 4G wireless services and mobile commerce. We are always looking for people who are thinkers & doers. People with passion, curiosity & conviction, people who are eager to break away from conventional roles and do 'jobs never done before'.Location- LucknowAbout the Role-Candidate will be part of circle Business Planning & Analysis team and will be primarily responsible for driving cost optimization projects across functions for efficiency build up and control governance around P&L. Will also be responsible for presentations to management entailing key KPI performance and control programs and reporting will be to BPA Head of the circle.ResponsibilitiesLeading multiple LOB charterIdentifying Opex saving opportunities or replication of best practices from other circlesDriving/interacting with stakeholders across all functions for various projects along with close-looping the sameMonthly Opex planning and forecasting with Opex plan deliveryDetailed Spend analysis on all major functions - Network/S&D/CS/Others, identifying opportunity for any efficiencies/correctionsDriving the overall circle compliance agendaAdhoc analysis on individual cost line items as per business requirementEnsuring books hygiene in terms of provision accuracy, bad debt & security deposit management etc.Data and presentation delivery as per requirement QualificationsCA with 1-4 years hands on experience in Financial planning and analysis, Opex forecasting and Budgeting. Required SkillsBusiness understandingStrong analytics & problem solvingProcess orientedGood interpersonal skillsTeamwork & CollaborationResult oriented & multitaskingPositive drive & energy\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "ROP- SWE-2 and SSE",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/rop-swe-2-and-sse-at-microsoft-4304996013?position=8&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=xu4aID07Y3eja%2BE6SOZk3Q%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T18:18:39.002796",
      "source": "public_api",
      "description": "Do you want to contribute to Microsoft's vision of empowering every person and organization to achieve more, with the power of cloud computing? Are you eager to work at the forefront of Cloud Computing, Artificial Intelligence, and the broad spectrum of advanced technologies that drive modern cloud infrastructure and services?  Join the Azure Specialized team in India, where you can make a real difference by designing, delivering, and operating cloud-scale systems. We are responsible for building and offering specialized workloads, bare-metal and software capabilities on Azure, involving large-scale specialized solutions like VMWare, SAP, Oracle, Epic Healthcare systems, AI Infrastructure, and more. We are looking for customer-focused and passionate engineers from diverse computer science fields, like hardware, operating systems, networking, security, distributed design, and enterprise solutions, with focus on quality and sustainability.Your ability to be the customer advocate, focus on service first, and part of a team that tears down silos to deliver the best customer experience will be critical for team’s and your success. Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesCollaborate with internal business units and stakeholders to understand the requirements for efficient and effective delivery.Handle project features from design, implementation, to deployment.Independently develop a product, service or feature, taking code reusability, quality and security into consideration.Participate in breaking down requirements into smaller work items, to bring clarity and provide development and testing estimation.Make software services secure, reliable, highly available and fault resilient.Introduce automation for repetitive tasks to reduce implementation time and avoid failure due to human error.Take the helm in ensuring seamless service operations by addressing real-time challenges as they emerge, empowering you to directly enhance service reliability and customer satisfaction.Collaborate with other engineers, teams, partners and project managers to deliver mission critical workloads in a fast-paced environment, while ensuring value-to-customers and live-site excellence.Lead, mentor, and guide engineers in the team, bringing clarity, creating energy, and driving results.QualificationsRequired Qualifications:Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.2+ years of professional experience in designing, developing, and shipping software.1+ years hands-on experience with distributed systems and services in the cloud.1+ years experience/knowledge of cloud computing, enterprise computing, IaaS, and/or SaaS products.Other RequirementsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.Preferred QualificationsBachelor's Degree in Computer ScienceOR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR PythonOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.Proven ability to solve complex technical issues for running online services.Excellent written and oral communication skills.Note : By applying to this role you will be assessed for multiple other roles which requires similar skills.#azurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Java",
        "Azure",
        "JavaScript"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Principal SOC Verification Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/principal-soc-verification-engineer-at-microsoft-4311370625?position=9&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=VSq1wpEI%2BFtwPHgIJEB93g%3D%3D",
      "post_date": "2025-10-07",
      "scraped_at": "2025-10-20T18:18:39.002796",
      "source": "public_api",
      "description": "Microsoft Silicon, Cloud Hardware, and Infrastructure Engineering (SCHIE) is the team behind Microsoft’s expanding Cloud Infrastructure and responsible for powering Microsoft’s “Intelligent Cloud” mission. SCHIE delivers the core infrastructure and foundational technologies for Microsoft's over 200 online businesses including Bing, MSN, Office 365, Xbox Live, Teams, OneDrive, and the Microsoft Azure platform globally with our server and data center infrastructure, security and compliance, operations, globalization, and manageability solutions. Our focus is on smart growth, high efficiency, and delivering trusted experience to customers and partners worldwide and we are looking for passionate engineers to help achieve that mission.The Compute Silicon & Manufacturing Engineering (CSME) organization within SCHIE is responsible for design, development, manufacturing and packaging of Microsoft's state-of-the-art computer chips, notably the Azure Cobalt. Our solutions provide sustainable strategic advantage to Microsoft and enable our customers to achieve more.As Microsoft's cloud business continues to grow, the ability to deploy new offerings and hardware infrastructure on time, in high volume with high quality and lowest cost is of paramount importance. To achieve this goal, the Compute Silicon & Manufacturing Engineering (CSME) team is instrumental in defining and delivering silicon solutions for the Cobalt program through hardware manufacturing, improving the planning process, quality, delivery, scale and sustainability related to Microsoft cloud hardware. CSME is at the forefront of innovation and application of AI to silicon development workflows. We are looking for seasoned engineers with a dedicated passion for customer focused solutions, insight and industry knowledge to envision and implement future technical solutions that will manage and optimize the Cloud infrastructure.We are looking for a Principal SoC Verification Engineer to join the team.ResponsibilitiesBe the technical lead and own verification of Design for Debug (DFD) SoC level flows including Task planning and schedule estimation Estimating resource needs and mapping tasks to team members Proactively identifying and removing roadblocks Finding ways to make the team more efficient Develop verification strategy, requirements, environments, tools, and methodologies Become an expert on the overall debug architecture, understand customer use models, and understand interactions with other parts of the SOC, with the platform, and with software Apply your knowledge of verification principles and techniques and your judgement to write test plans and implement them by developing tests, test generators, test benches, checkers, coverage, and other verification collateral Run tests, debug failures to root cause, and recommend fixes Apply your growth mindset to learn and adapt in a complex and dynamic environment Engage with partners to drive continuous improvement to both the design, to verification plans/collateral, and to methodology to prevent, reduce, and/or find bugs sooner, more easily, or more reliably Provide technical guidance, coaching, and mentorship to other engineers in your areas of expertise Apply your One Microsoft mentality to collaborate with and influence architects, logic designers, post-silicon validators, other verification engineers, and IP and tool providers Delight your customers by providing high quality results on schedule Provide technical leadership with respect and integrity Apply your expertise to improve post-silicon validation plans, tests, and debug of your area Apply industry leading generative AI solutions to verification work QualificationsRequired Qualification12+ years of pre-silicon SOC or subsystem or IP verification experience.   Candidate must have at least a bachelor’s or master’s degree in electrical, Electronics, Computer Engineering, Computer Science or a related degree   5+ years of verification experience working on CPU/SOC designs, with 3+ years of design for debug verification experience Preferred QualificationExperience with SOC DFD verification for a full product cycle from definition to silicon, including writing SOC level test plans, developing tests, debugging failures and coverage signoff Demonstrated expertise in industry standard DFD architectural protocols such as JTAG interface, hardware triggers, breakpoints and tracing Experience enabling and/or utilizing debug features in post-silicon Proficient communication, collaboration and teamwork skills and ability to contribute to diverse and inclusive teams Experience planning verification tasks, estimating and assigning tasks, coordinating with customers and suppliers, and executing to the plan Proficient leadership skills Passion for improving verification efficiency Experience with Agile software practices Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Azure"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Manual Tester  @ Lucknow office",
      "company": "Digital Brain Media - Official",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/manual-tester-%40-lucknow-office-at-digital-brain-media-official-4306113541?position=10&pageNum=1&refId=cT4BduY33wTj8sDbHv3HaA%3D%3D&trackingId=8yeBy7uVN2aPFxHPHZnoGA%3D%3D",
      "post_date": "2025-09-30",
      "scraped_at": "2025-10-20T18:18:39.002796",
      "source": "public_api",
      "description": "Dear Candidates,We are looking candidates for Lucknow office,Review and analyze system specificationsCollaborate with QA engineers to develop effective strategies and test plansExecute test cases (manual or automated) and analyze resultsEvaluate product code according to specificationsCreate logs to document testing phases and defectsReport bugs and errors to development teamsHelp troubleshoot issuesConduct post-release/ post-implementation testingWork with cross-functional teams to ensure quality throughout the software development lifecyclemobile testing android and ios is must.automation testing on apium and selenium or jira is recomendedNote: This position is only for lucknow office, loorking for local candidates. Skills:- Mobile App Testing (QA), Android Testing, iOS Testing and API QA\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "₹100,000.00/yr - ₹400,000.00/yr",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Backend Developer Trainee",
      "company": "Gramik™",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/backend-developer-trainee-at-gramik%E2%84%A2-4232601133?position=1&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=dVl%2FPphW3lWnBXG7phmPVQ%3D%3D",
      "post_date": "2025-05-22",
      "scraped_at": "2025-10-20T18:18:48.319114",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Python Developer",
      "company": "ARDEM Incorporated",
      "location": "Kakori, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/python-developer-at-ardem-incorporated-4218882129?position=2&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=Ss3GTudQN0WXe2GbaiJSRg%3D%3D",
      "post_date": "2025-04-30",
      "scraped_at": "2025-10-20T18:18:48.319114",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Quality Analyst",
      "company": "TP",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/quality-analyst-at-tp-4315184770?position=3&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=g3gg3GWVn7pfJ%2FvuUnU0Kg%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T18:18:48.319114",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Team Lead – MS.Net",
      "company": "Digital Business People",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/team-lead-%E2%80%93-ms-net-at-digital-business-people-4201033309?position=4&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=zJNswNaijrjcCvMAfA0Xtg%3D%3D",
      "post_date": "2025-04-04",
      "scraped_at": "2025-10-20T18:18:48.319114",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Commercial Planning & Analysis Executive",
      "company": "Golden Gate Restaurant Group",
      "location": "Malihabad, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/commercial-planning-analysis-executive-at-golden-gate-restaurant-group-4289109774?position=5&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=FoJufj0c3qYE8fVhYxmSAw%3D%3D",
      "post_date": "2025-08-20",
      "scraped_at": "2025-10-20T18:18:48.321120",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Microsoft SQL Server Developer",
      "company": "Uplers",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/microsoft-sql-server-developer-at-uplers-4310143083?position=6&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=zfpw9ZqfBrqJgH9pmJq0Fg%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:48.321120",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Looker Analytics Engineer (GCP)",
      "company": "Uplers",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/looker-analytics-engineer-gcp-at-uplers-4308919226?position=7&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=DYg2kpzEluezjxMJXPUwWA%3D%3D",
      "post_date": "2025-10-01",
      "scraped_at": "2025-10-20T18:18:48.321120",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "PhD Data Partner - Basic Medical Science",
      "company": "TELUS Digital AI Data Solutions",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/phd-data-partner-basic-medical-science-at-telus-digital-ai-data-solutions-4304657504?position=8&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=fekZrkRRk2OOSOW1TMYdpA%3D%3D",
      "post_date": "2025-09-23",
      "scraped_at": "2025-10-20T18:18:48.321120",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Lead Data Engineer",
      "company": "Uplers",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/lead-data-engineer-at-uplers-4311119533?position=9&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=Ecu7NVarMSjEq6rzs%2Bhzjw%3D%3D",
      "post_date": "2025-10-06",
      "scraped_at": "2025-10-20T18:18:48.323126",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4315829882?position=10&pageNum=2&refId=QoqFyXAuRsVUSeoYzUYY1g%3D%3D&trackingId=2EA%2F2pgtZlqm97X2QrXKGg%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:18:48.323126",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Cloud Data Engineers",
      "company": "Uplers",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/cloud-data-engineers-at-uplers-4305116145?position=1&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=2e9P%2FYFBPtjARrefA5XkBA%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T18:18:57.597857",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "System Engineer - Generative AI",
      "company": "CompuGroup Medical SE & Co. KGaA",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/system-engineer-generative-ai-at-compugroup-medical-se-co-kgaa-4294888327?position=2&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=rNuRxmGg6LHj3R%2B2S9CbHQ%3D%3D",
      "post_date": "2025-09-30",
      "scraped_at": "2025-10-20T18:18:57.597857",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Application Developer-Open Source",
      "company": "IBM",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/application-developer-open-source-at-ibm-4307587000?position=3&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=l2lmy4GFgBTZiwDXZSQV0Q%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:57.597857",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4315143274?position=4&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=SSX3yIEH2%2BKepFPieA6Wzw%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T18:18:57.597857",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Application Developer-Open Source",
      "company": "IBM",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/application-developer-open-source-at-ibm-4307583031?position=5&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=0eVv50GIXbyqejDbCeGVpg%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:57.603497",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Business Analyst",
      "company": "Lenskart.com",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/business-analyst-at-lenskart-com-4305944915?position=6&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=L6ffU1FXgB1qgd%2F%2BGuzBIQ%3D%3D",
      "post_date": "2025-09-25",
      "scraped_at": "2025-10-20T18:18:57.603497",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Application Developer-Open Source",
      "company": "IBM",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/application-developer-open-source-at-ibm-4307586005?position=7&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=jiMyyj6p8FXZdDEPBA9slA%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:57.603497",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Application Developer-Open Source",
      "company": "IBM",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/application-developer-open-source-at-ibm-4307572900?position=8&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=H4m%2FJKqkBItMSzLbD%2Bq34g%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:57.603497",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Web Developer in Lucknow",
      "company": "Reno Platforms",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/web-developer-in-lucknow-at-reno-platforms-4312913000?position=9&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=OfDUcngWDk4%2BWIOqhoU99Q%3D%3D",
      "post_date": "2025-10-10",
      "scraped_at": "2025-10-20T18:18:57.603497",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Application Developer-Open Source",
      "company": "IBM",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/application-developer-open-source-at-ibm-4307564945?position=10&pageNum=3&refId=BSxpvfYwj9VLViWSzgYWbA%3D%3D&trackingId=VwZp74h2thHJ16PsvTPJpw%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:18:57.603497",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    }
  ],
  "metadata": {
    "scraped_at": "2025-10-20T18:22:17.816308",
    "total_jobs": 40
  }
}