{
  "jobs": [
    {
      "title": "Data Analyst",
      "company": "Birlasoft",
      "location": "Pune, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/data-analyst-at-birlasoft-4304209530?position=1&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=rPak%2F1PUtS9EXorcAOksuA%3D%3D",
      "post_date": "2025-09-26",
      "scraped_at": "2025-10-20T17:54:20.321833",
      "source": "public_api",
      "description": "ROLE TITLEClaims Data AnalystUNITClaims Business AnalystROLE SUMMARYSeeking a highly skilled and detail-oriented Senior Claims Data Analyst. Candidates considered for this role must have extensive experience with Guidewire ClaimCenter and ETL tools to ensure seamless data mapping, migration, and reporting. The analyst will also provide insights and solutions to enhance data accuracy and operational efficiency. In addition, the analyst will collaborate with cross-functional teams to identify trends, improve processes and deliver innovative solutions that drive efficiency and improve customer outcomes.ROLE RESPONSIBILITIESAnalyze large datasets related to commercial Property & Casualty (P&C) claims to identify trends, anomalies, and opportunities for improvement.Develop and maintain dashboards, reports, and visualizations to communicate key metrics and findings to stakeholders.Perform root cause analysis for claims performance issues and recommend data-driven solutions.Provide insights to enhance claims handling processes, reduce costs, and improve overall operational efficiency.Identify opportunities for automation of manual processes and implement advanced analytics tools to streamline workflows.Collaborate with IT and data engineering teams to improve data quality, enhance data pipelines, and ensure seamless data integration.Act as a moderator for the Guidewire ClaimCenter master mapping, consolidating data flows across integrations.Analyze and resolve database issues in Guidewire ClaimCenter to maintain data integrity and optimize system performance.Work closely with business analysts, managers, and leadership to understand business challenges and translate them into analytical solutions.Present findings, insights, and recommendations in a clear, concise manner to non-technical audiences, including senior leadership.Provide mentorship and guidance on data analysis best practices and advanced analytical techniques to team members and stakeholders.TECHNICAL QUALIFICATIONSA minimum of 5 years of experience in data analysis, with a focus on claims, insurance, or the commercial P&C industry.Proficient in Guidewire Studio (v.10), TortoiseSVN, Jira, Toad, and SQL Developer.Expertise in ETL tools and database technologies, including SQL, PL-SQL, and T-SQL procedures.Advanced Excel skills, including VBA and Power Query, for data analysis and reporting.Proficiency in data analysis tools such as SQL, Python, or SAS.Experience with data visualization tools like Tableau, Power BI, or QlikView.Strong understanding of P&C insurance concepts, including claims reserving, loss ratios, and exposure metrics.Experience with advanced analytics techniques, such as predictive modeling, clustering, or natural language processing (NLP).Familiarity with machine learning concepts and predictive modeling; hands-on experience with AI tools is a plus.Extensive experience with claims data, including data migration, integration, and reconciliation processes.Hands-on experience with claims management systems (e.g., Guidewire ClaimCenter) is highly desirable.GENERAL QUALIFICATIONSStrong problem-solving and critical-thinking stills, with the ability to address complex data challenges.Proven aptitude for identifying and resolving data quality issues and inconsistencies.Excellent communication skills, with the ability to translate complex data into actionable insights for both technical and non-technical audiences.Demonstrated ability to work independently and manage multiple priorities in a fast-paced environment.Clear and concise verbal and written communication skills.Comfortable working in ambiguous situations and capable of overcoming challenges to achieve objectives accurately.Effective team player who collaborates well with both technical and business stakeholders.Self-motivated and able to see tasks through to completion with minimal guidance.Strong time-management skills and the ability to meet individual and team deadlines.High attention to detail with a strong focus on data accuracy and integrity.Adaptable to evolving business needs and advancements in technology.EDUCATION REQUIREMENTSBachelor’s degree in Data Science, Statistics, Actuarial Science, Mathematics, Computer Science, or a related field.Certifications in data analytics or business intelligence (e.g., Certified Analytics Professional, Microsoft Certified: Data Analyst Associate, SAS Certified Data Scientist) are preferred but not required.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Power BI",
        "SQL",
        "Tableau",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Data Analyst",
      "company": "Bajaj Finserv",
      "location": "Pune, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/data-analyst-at-bajaj-finserv-4283398935?position=2&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=sIVnm%2F1A2v7vPXUggUQ1bQ%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T17:54:20.323838",
      "source": "public_api",
      "description": "Location Name: Pune Corporate Office - MantriJob Purpose“This position is open with Bajaj Finance Ltd.”Duties And Responsibilities Write efficient SQL queries to extract, transform, and load data Develop Python scripts for data processing, analysis, and automation Utilize Databricks to build scalable data pipelines and notebooks Collaborate with cross-functional teams to interpret data requirements Perform exploratory data analysis and generate actionable insights Maintain data integrity and troubleshoot issues in datasets Work within modern cloud environments (Azure, AWS, or GCP) Support initiatives involving AI/ML technologies and tools Recommend, document, and oversee policies and procedures to meet industry best practices and to meet required SLAs. Excellent CommunicationRequired QualificationsRequired Qualifications and Experience Bachelor’s degree in Information Technology, Computer Science, or related field 2–3 years of experience in a data-driven role Proficiency in SQL and Python Hands-on experience with Databricks or similar data platforms Understanding of cloud architecture (Azure, AWS, or GCP preferred) Familiarity with AI technologies like machine learning frameworks or cloud-based AI tools Analytical mindset with problem-solving capabilities Excellent communication and documentation skills Knowledge of Azure, SFDC, Power BI would be added advantage Exceptionally high motivational levels and needs to be a self-starter.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Azure",
        "Power BI",
        "SQL",
        "GCP",
        "AWS",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "TTT - Power BI - Advanced Analyst",
      "company": "EY",
      "location": "Pune, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/ttt-power-bi-advanced-analyst-at-ey-4315550785?position=3&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=mSWEdNWpLXdSHreTs7j0%2FQ%3D%3D",
      "post_date": "2025-10-17",
      "scraped_at": "2025-10-20T17:54:20.323838",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Data Analyst",
      "company": "Amber",
      "location": "Pune, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/data-analyst-at-amber-4315685925?position=4&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=%2Fh6MDoMTmc5O%2Fo00RZNEFQ%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T17:54:20.323838",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Data Analyst",
      "company": "Bits In Glass",
      "location": "Pune, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/data-analyst-at-bits-in-glass-4312271693?position=5&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=qfJTG%2BMQg31mbUvNv2bkvQ%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T17:54:20.325844",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Data Analyst (Tableau)",
      "company": "SailPoint",
      "location": "Pune, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/data-analyst-tableau-at-sailpoint-4266659165?position=6&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=T8yMj2Eyeu3VKxOY%2BUMi5g%3D%3D",
      "post_date": "2025-10-12",
      "scraped_at": "2025-10-20T17:54:20.325844",
      "source": "public_api",
      "description": "Why SailPoint?Love what you do. And love where you do it! Smart people, fun culture, innovative work, beautiful offices — that is what people say about SailPoint. We are known as the company where everyone wants to work, and we have the awards to prove it; most recently ranked as #17 on Glassdoor’s best places to work in 2025. If you are passionate about outsmarting cybercriminals and seek working at a company where you can truly have an impact with other good people, we want you to join our team. SailPoint empowers the largest, most complex organizations by putting identity at theCenter of Security and IT. Our 2,000+ customers include global financial institutions, government entities, pharmaceutical organizations, and more.Who You Are:You are an eager and highly motivated young professional looking to grow your skills by building your working relationships and quickly learning from peer interaction at all levels within an organization. You have worked indirectly and directly with data analytics teams and internal stakeholders to successfully complete analytics deliverables and coordinate meetings focused on performance metrics. You are an excellent communicator, with experience in planning for and achieving challenging deadlines, assessing and mitigating project risks, and proactively building elegant solutions that deliver results regardless of initial starting point or data maturity.What You will Do:As a Data Analyst within the professional services team, you will play a leading role in establishing and maintaining successful relationships across the business, focused on making the process of building and reporting analytics easier in support of better business decisions. This role requires collaboration across many teams to understand business needs, create and maintain solutions, and continually improve those solutions.Equally important, this position requires a balance of technical expertise and creative design skills—delivering not just accurate analytics, but also highly engaging, visually compelling, and user-friendly dashboards and reports. You will act as both an analyst and a designer, ensuring that insights are technically sound while also communicated through beautiful, intuitive, and impactful visual experiences.Responsibilities and Qualifications:Creativity: Develop visually stunning and intuitive dashboards, reports, and other deliverables that not only convey accurate data but also engage and inspire the audience. Apply visual design principles, color theory, and layout best practices to ensure content is polished, professional, and easy to interpret.Business Collaboration: Partner with cross-functional stakeholders to gather requirements, understand data needs, and translate complex business questions into actionable solution modifying existing solutions and/or creating net new.Team Support: Collaborate with Partner Delivery Enablement, Professional Services Enablement, and SailPoint Professional Services Operations teams to address their analytical needs.Dashboard Development: Assume ownership of existing Tableau dashboards, enhancing both functionality and design. Design, build, and maintain new interactive Tableau and Salesforce dashboards to support strategic decision-making.Data Quality Assurance: Ensure the accuracy, consistency, and integrity of data across all platforms and processes.Performance Monitoring: Monitor and fine-tune the performance of Tableau dashboards and underlying data sources to ensure optimal efficiency.Cross-Functional Training: Educate team members and stakeholders on Tableau functionality, data analysis techniques, and best practices to foster data literacy and independence.Continuous Learning: Stay informed on the latest trends, tools, and best practices in both data visualization design and analytics to continually improve processes with new capability.To excel in this role, plan to present the following qualifications during the interview process:A passion for data storytelling—able to combine technical analysis with strong design sensibility to create dashboards and reports that are not only functional, but also engaging, polished, and visually striking.Knowledge of visual design principles, UX/UI concepts, and data storytellingbest practices to make dashboards intuitive and user-friendly.Be prepared to share examples (portfolio, screenshots, or demos) of dashboards or reports that highlight both technical accuracy and creative design.Proven hands-on expertise in Tableau, SQL, and Excel /SmartSheets.Embody a strong sense of responsibility and proactive positive initiative to directly own project outcomes, drawing on wisdom gainedthrough previous referenceable project delivery experience.A history of successful project delivery including internal and/or external consultation work.Technical curiosity to quickly understand and proactively address needs in an elegant way, with an eye toward future maintainability, always working to advance simplified solutions to complex problems.A strong inherent attention to detail to ensure that data accuracy is maintained while also being able to see the larger business problems that we are working to solve.Exceptional interpersonal communication skills, with the ability to fluidly articulate complex technical solutions to non-technical audiences in English.You must qualify as a trusted representative of SailPoint, with a mature customer-centric attitude and unwavering commitment to company values. This is not a “nice to have,” but instead a required trait, necessary for building trust centered relationships.Education & Certification:Bachelor's degree or equivalent required with additional training.Demonstrated experience in visual design, UX/UI principles.Tableau and related certifications. Travel: SailPoint is a remote first company, however some travel may be required in your assigned region to meet with team members or to attend company sponsored events; estimated at 10-15%. Onboard Ramp:30 DaysComplete SailPoint bootcamp, learning about the organization's mission, values, and culture.Complete required security and compliance training.Understand the structure of the professional services department and key stakeholders.Gain an understanding of the organization’s data architecture, tools, and processes.Review and familiarize yourself with existing dashboards, reports, anddata workflows.Meet with key stakeholders to understand ongoing projects and business objectives.Shadow team members to learn about operational challenges and improvement opportunities.60 DaysTake ownership of existing dashboards, ensuring they meet stakeholder expectations.Begin creating and refining new dashboards and reports based on identified needs.Collaborate with data engineers to evaluate and enhance data pipelines with goal to transfer work to fully automated workflows managed by IT.Start identifying areas for automation in data workflows and reporting.Propose process improvements and initiate small-scale enhancements.90 DaysLead the design and implementation of advanced dashboards to provide strategic insights.Develop automated solutions for recurring data transformation and reporting tasks.Conduct training sessions for team members to improve Tableau proficiency and data analysis skills.Present a plan for long-term optimization of data visualization and analytics processes.Actively participate in team projects, driving measurable outcomes and improvements.Develop a plan for continuous improvement beyond the initial 90 days.SailPoint is an equal opportunity employer, and we welcome everyone to ourteam who is committed to living our four core values. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran statusSailPoint is an equal opportunity employer and we welcome all qualified candidates to apply to join our team.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other category protected by applicable law.  Alternative methods of applying for employment are available to individuals unable to submit an application through this site because of a disability. Contact applicationassistance@sailpoint.com or mail to 11120 Four Points Dr, Suite 100, Austin, TX 78726, to discuss reasonable accommodations.  NOTE: Any unsolicited resumes sent by candidates or agencies to this email will not be considered for current openings at SailPoint.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "SQL",
        "Tableau"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Data Analyst",
      "company": "PubMatic",
      "location": "Pune, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/data-analyst-at-pubmatic-4283162685?position=7&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=ZRw6I7Ks05g%2Bcm4XaeWmDQ%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T17:54:20.325844",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Data Analyst",
      "company": "Valkyrie People Consulting",
      "location": "Pune, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/data-analyst-at-valkyrie-people-consulting-4316331341?position=8&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=1QxheANURCH3D7w39IpyoA%3D%3D",
      "post_date": "2025-10-17",
      "scraped_at": "2025-10-20T17:54:20.325844",
      "source": "public_api",
      "description": "Job Title: Data AnalystLocation: Pune, IndiaIndustry: AutomotiveExperience: 3+ years of experience in data analysis, preferably within the automotive or manufacturing sector.Position Overview:The Data Analyst will be responsible for gathering, analyzing, and interpreting data to help the automotive company improve its operations, optimize supply chains, enhance customer satisfaction, and make informed business decisions. This role requires a strong background in data analysis techniques and tools, as well as a solid understanding of the automotive industry. The Data Analyst will work closely with cross-functional teams, including operations, marketing, sales, and finance, to provide insights that drive business performance and efficiency.Key Responsibilities:Data Collection & Management: Collect, clean, and manage data from various sources, including production data, sales data, customer feedback, and supply chain metrics.Data Analysis: Analyze large datasets to identify trends, patterns, and correlations. Use statistical tools to interpret data and provide actionable insights for process improvement and business decisions.Performance Monitoring: Develop and monitor key performance indicators (KPIs) related to production efficiency, sales performance, customer satisfaction, and other business operations.Reporting & Visualization: Create clear and concise reports, dashboards, and visualizations to communicate findings to business leaders and stakeholders.Predictive Analytics: Use predictive modeling and machine learning techniques to forecast demand, optimize inventory levels, and identify potential issues in production or supply chains.Collaboration: Work closely with production, supply chain, sales, and marketing teams to identify opportunities for efficiency improvements and support data-driven decision-making processes.Market & Customer Analysis: Analyze customer behavior and market trends to help improve product offerings, marketing strategies, and customer engagement.Automation & Process Improvement: Identify opportunities to automate repetitive data collection and reporting tasks, streamlining processes and improving data accuracy.Quality Control: Ensure the accuracy and reliability of data by conducting regular audits and validation checks.Qualifications & Requirements:Proven experience as a Data Analyst or in a similar role, preferably in the automotive or manufacturing industry.Proficiency in data analysis tools such as Excel, SQL, Python, R, or other relevant software.Experience with data visualization tools such as Power BI, Tableau, or similar platforms.Strong understanding of statistical analysis, predictive modeling, and machine learning techniques.Familiarity with automotive industry trends, supply chain processes, and production metrics is a plus.Excellent analytical and problem-solving skills, with a keen eye for detail.Ability to communicate complex data insights clearly to non-technical stakeholders.Bachelor’s degree in Data Science, Statistics, Computer Science, or a related field. A Master’s degree or relevant certifications is an advantage.Personal Attributes:Results-driven with a strong focus on delivering data-driven insights that impact business performance.Strong communication skills, able to translate data findings into actionable recommendations.Detail-oriented with a focus on accuracy and data integrity.Ability to work effectively in a team environment and manage multiple tasks simultaneously.Passion for the automotive industry and eagerness to stay updated on new data technologies and trends.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Tableau",
        "Power BI",
        "SQL",
        "R",
        "Python"
      ],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Business Data Analyst",
      "company": "Regal Rexnord",
      "location": "Chakan, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/business-data-analyst-at-regal-rexnord-4306357099?position=9&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=AO7r2VIfJ96UZBEboF7bSg%3D%3D",
      "post_date": "2025-09-29",
      "scraped_at": "2025-10-20T17:54:20.327851",
      "source": "public_api",
      "description": "WHAT YOU CAN EXPECT:Maintenance of the Backend system and modeling of the background data structure in collaboration with team members and corporate IT.Ensure stable operation of the ERP and CRM datasetsMaintenance and implementation of new data sources or additional required data in existing data sets and data flowsParticipation in the development of the \"Business Intelligence System\" for the analysis and proactive reporting of anomalies in business data in Microsoft Power-BI:Develop code to automatically track critical business data to report anomaliesImplementation of the BI system structure and new Dashboard and Report Releases for L2 and L1 management and across all departmentsDevelopment of dashboards and reportsDevelopment of dashboards for different business areas based on defined concepts.Use or implementation of artificial intelligence for data analysisWHAT YOU BRING TO THE TABLE:Experience in development in business intelligence software, especially Power-BI. Other tools (e.g. Snowflake) are an advantageExperience in data modeling, databases as well as ERP (e.g. Oracle) and CRM systems (e.g. Salesforce).Passion to present anomalies as well as connections within big data in a visually appealing and easy-to-understand waySuccessfully completed studies in a relevant field or technician training with several years of experience in the field of data analytics is an advantageExperience in dealing with Microsoft's Office365 package, especially the Power Platform as well as MS ExcelFluent in English\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    },
    {
      "title": "Analyst -",
      "company": "Wipro",
      "location": "Pune, Maharashtra, India",
      "url": "https://in.linkedin.com/jobs/view/analyst-at-wipro-4313740032?position=10&pageNum=0&refId=TNM3aGsPOOa7%2BgzK5qGIrQ%3D%3D&trackingId=g%2BKbNi8QRCh7PjlsWoRs6Q%3D%3D",
      "post_date": "2025-10-13",
      "scraped_at": "2025-10-20T17:54:20.327851",
      "source": "public_api",
      "description": "Job description:Job Description ͏ ͏ ͏ ͏  Reinvent your world. We are building a modern Wipro. We are an end-to-end digital transformation partner with the boldest ambitions. To realize them, we need people inspired by reinvention. Of yourself, your career, and your skills. We want to see the constant evolution of our business and our industry. It has always been in our DNA - as the world around us changes, so do we. Join a business powered by purpose and a place that empowers you to design your own reinvention. Come to Wipro. Realize your ambitions. Applications from people with disabilities are explicitly welcome.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "Not specified",
      "job_type": "Not specified",
      "experience_level": "Not specified"
    }
  ],
  "metadata": {
    "scraped_at": "2025-10-20T17:56:06.690161",
    "total_jobs": 10
  }
}