{
  "jobs": [
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4300043345?position=1&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=7ajGo7h%2FCUIH%2BGmY48rNEA%3D%3D",
      "post_date": "2025-09-12",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "Have you ever imagined a world with an infinite amount of storage available and accessible to everyone? A place where everyone in the world can easily access their data from anywhere at any time via any means (e.g., mobile phones, tablets, PCs, smart devices, etc.). Did you ever desire a universally accessible storage system to record all the knowledge known to mankind or to store all the data collected from all the scientists in the world for them to collaborate upon? Do you want to be part of a team that strives to bring these to reality?If so, the Microsoft Azure Storage team is what you are looking for. We are building Microsoft’s cloud storage solution - Microsoft Azure Storage, which is a massively scalable, highly distributed, ubiquitously accessible storage system, designed to scale out and serve the entire world. We continue to have tremendous hockey stick growth, we have many Exabyte’s of data stored, and are designing and building systems for Zettabyte scale to support demand growth for the coming years.As a SDET in the Azure Storage team, you will be involved in the testing and implementation of automated testing solutions for highly scalable, performant services that deliver highly reliable, secure and available access to storage for our customers. You will face challenges of monitoring, analyzing, and designing for ever-growing data needs of our customers and for ensuring data privacy, protection and compliance. This opportunity will allow you to develop your technical skills in cloud services and storage, accelerate career growth, and provide an opportunity to work in a highly dynamic, flexible, and globally distributed team.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesWe are looking for engineers who are self-starters with a passion for learning and bringing fresh ideas to build high quality products. You will have opportunities to work on fast-paced teams and make high impact changes on a daily basis as you build world class services.Responsibilities IncludeDesign and develop comprehensive test strategies, automation frameworks, and methodologies to ensure software quality and reliability. Build benchmarking tools and frameworks to evaluate system performance under real-world workloads. Design and implement end-to-end scenarios, performance testing, profiling, and optimization strategies for storage systems. Analyze system bottlenecks, latency issues, and resource utilization across compute, storage, and networking layers. Investigate and resolve performance regressions, identifying root causes through deep dive debugging. Create, maintain, and execute test cases, scripts, and scenarios for diverse software components. Identify, document, and track defects, issues, and potential areas of improvement in the development process. Perform root cause analysis of complex issues and work with component teams to resolve them and improve product quality. Define and track key metrics to measure software quality and test effectiveness. QualificationsRequired/Minimum Qualifications (RQs/MQs)Bachelor's Degree in Computer Science, or related technical discipline AND 1+ Year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Excellence in software engineering practices. Knowledge of software QA methodologies, tools, and processes. Additional Or Preferred Qualifications (PQs)Bachelor's Degree in Computer Science OR related technical field AND 2+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Develop or specify standards, methods, or procedures to determine product quality or release readiness. Experience in building quality products and services preferably in distributed systems. #AzurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "JavaScript",
          "Java",
          "Python",
          "Azure"
        ],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    },
    {
      "title": "Software Development Engineer II",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-development-engineer-ii-at-microsoft-4294611168?position=2&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=u0nXtSNO%2BhSj20r1Bx5CBg%3D%3D",
      "post_date": "2025-09-02",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "Have you ever imagined a world with an infinite amount of storage available and accessible to everyone? A place where everyone in the world can easily access their data from anywhere at any time via any means (e.g., mobile phones, tablets, PCs, smart devices, etc.). Did you ever desire a universally accessible storage system to record all the knowledge known to mankind or to store all the data collected from all the scientists in the world for them to collaborate upon? Do you want to be part of a team that strives to bring these to reality?If so, the Microsoft Azure Storage team is what you are looking for. We are building Microsoft’s cloud storage solution - Microsoft Azure Storage, which is a massively scalable, highly distributed, ubiquitously accessible storage system, designed to scale out and serve the entire world. We continue to have tremendous hockey stick growth, we have many Exabyte’s of data stored, and are designing and building systems for Zettabyte scale to support demand growth for the coming years.As a Software Engineer - Test and Senior SDET in the Azure Storage team, you will be involved in the testing and implementation of automated testing solutions for highly scalable, performant services that deliver highly reliable, secure and available access to storage for our customers. You will face challenges of monitoring, analyzing, and designing for ever-growing data needs of our customers and for ensuring data privacy, protection and compliance. This opportunity will allow you to develop your technical skills in cloud services and storage, accelerate career growth, and provide an opportunity to work in a highly dynamic, flexible, and globally distributed team.We are looking for a Software Engineer II who is a self-starter with enthusiasm for learning and bringing fresh ideas to build high quality products. You will have opportunities to work on fast-paced teams and make high impact changes on a daily basis as you build world class services.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesDesign and develop comprehensive test strategies, frameworks, and methodologies to ensure software quality and reliability, while collaborating with cross-functional teams to align on quality requirements.Define release planning and assess software readiness for production deployment.Implement and maintain automated testing frameworks, and create, maintain, and execute test cases, scripts, and scenarios across software components.Identify and document defects, issues, and areas for improvement in the software development process, and perform root cause analysis to resolve complex problems and enhance product quality.Diagnose performance bottlenecks by analyzing application logs, source code, and profiling data, and run experiments and benchmarks to evaluate distributed system performance.Work with component teams to identify pain points and provide technical guidance to improve their areas.Stay current with industry trends, emerging technologies, and QA best practices to continuously improve testing processes.QualificationsRequired Qualifications:Bachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, or PythonOR equivalent experience.1+ year(s) experience in software engineering practices, coding with strong testing, debugging and analytical skills.1+ year(s) proficiency of software Quality Assurance (QA) and Performance methodologies, tools, and processes.1+ year(s) of demonstrated ability to plan, schedule and deliver quality software. Other RequirementsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:  Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Preferred QualificationsBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, or Python.OR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, or Python OR equivalent experience. 1+ year(s) experience in building quality products and services preferably in distributed systems.Note : By applying to this open posiiton you will be assesed for multiple similar role which require similar competencies.#azurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Java",
          "Python",
          "Azure"
        ],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    },
    {
      "title": "Backend Developer Trainee",
      "company": "Gramik™",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/backend-developer-trainee-at-gramik%E2%84%A2-4232601133?position=3&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=6ARE9XuC8KAw4hqYnUeVdg%3D%3D",
      "post_date": "2025-05-22",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "Job Title: Backend Developer InternLocation: LucknowCompany: GRAMIKStipend: ₹7,000 – ₹8,000 per monthEmployment Type: Internship (Full-time)About GRAMIKGramik is an agri-tech startup focused on empowering farmers through technology and transparent last-mile delivery. We operate through a dual model—B2C via Village Level Entrepreneurs (VLEs) and B2B through retail partnerships—to deliver high-quality agri-inputs and cattle feed supplements, while enabling rural entrepreneurship.Internship OverviewWe are seeking a proactive and detail-oriented Backend Developer Intern to support our product and operations teams. This role is ideal for candidates looking to gain hands-on experience in backend operations and development within a growing startup environment.Key ResponsibilitiesUpload and manage product listings in the backend system (top priority).Assist with day-to-day backend operations and administrative tasks.Coordinate with other teams (product, design, ops) to ensure smooth execution of backend updates.Support database updates, content management, and other technical tasks as required.RequirementsBasic understanding of backend systems, databases, and content management.Familiarity with tools like Excel, CMS platforms, or simple backend interfaces.Attention to detail and strong organizational skills.Eagerness to learn and contribute to multiple areas within the backend team.What You’ll GetStipend of ₹7,000 – ₹8,000 per monthReal-world experience in backend workflows and digital operationsExposure to a fast-paced startup environment with mentoring from experienced team membersOpportunity to convert to a full-time role based on performance and company needs\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    },
    {
      "title": "Software Engineer II",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-ii-at-microsoft-4294197756?position=4&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=2tFQCvAQU7gbjMA%2BgtTGRA%3D%3D",
      "post_date": "2025-09-02",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "About The TeamAre you passionate about shaping the future of AI? Join us –Responsible AI group in Azure AI Platform.We ensure Microsoft ships AI systems that are safe, secure, and trustworthy—empowering every person and organization on the planet to achieve more. Our team sits at the intersection of cutting-edge AI research and planet-scale production systems, powering technologies like GitHub Copilot and Azure OpenAI.You’ll build Azure AI Content Safety and RAI service integrated into AI Studio, Azure OpenAI, AML, Cognitive Services, etc. Our mission is to empower developers and data scientists around the world and of all skill levels to easily add responsible AI capabilities to their applications.In this panel, you will have the opportunity to learn how we can protect our world, keep AI from harming everyone's lives, and apply the most advanced technologies to achieve our mission. You will focus on identifying, measuring, mitigating, and monitoring Responsible AI risks in AI-generated and human-generated content spanning text, image, audio, video, and multimodal content, as well as detecting abusive customers to prevent them from misusing Microsoft AI products.We are looking for talents who are passionate about building customer-facing AI services with excellent customer experience, scalable and sustainable architecture, implementation and with high performance, low latency, and high availability. Microsoft’s mission is to empower every person and every organization on the planet to achieve more, and we’re dedicated to this mission across every aspect of our company. Our culture is centered on embracing a growth mindset and encouraging teams and leaders to bring their best each day. Join us and help shape the future of the world.ResponsibilitiesAbout the roleCreates and implements code for a product, service, or feature, reusing code as applicable. Writes and learns to create code that is extensible and maintainable. Considers diagnosability, reliability, and maintainability with few defects, and understands when the code is ready to be shared and delivered. Applies coding patterns and best practices to write code. Contributes to efforts to ensure the correct processes are followed to achieve a high degree of security, privacy, safety, and accessibility. Checks for visible evidence to demonstrate compliance for product areas. Develops and holds an understanding of the implications of onboarding new technologies following expectations of compliance at Microsoft. Reviews code of a product feature to assure it meets the team's and Microsoft's quality standards, is reliable and accurate and is appropriate for the scale of the product feature. Applies feedback to current and future iterations. Participates in code reviews to ensure coding standards are followed. Considers diagnosability, reliability, and maintainability when reviewing code and understands when code is ready to be shared or delivered. Applies and screens for coding patterns and best practices in reviews. Supports efforts to apply debugging tools and examines logs, telemetry, and other methods to verify assumptions proactively before issues occur and reactively as issues occur for product features. Conducts retrospective debugging of solutions to identify root causes of problems. Contributes to the development of automation within production and deployment of a complex product feature. Runs code in simulated, or other non-production environments to confirm functionality and error-free runtime for products with little to no oversight. Reviews work items to deepen knowledge of product features in partnership with appropriate stakeholders (e.g., project managers) and executes project plans, release plans, and work items. Contributes to efforts to break down larger work items into smaller work items and provides estimation. Escalates any issues that would cause a delay. Identifies areas to efforts to integrate instrumentation for gathering telemetry data on system behavior such as performance, reliability, availability, usage, and safety mechanisms. Contributes to sustaining feedback loops from telemetry resulting in subsequent designs. Helps to create outputs of telemetry such as notifications or dashboards. Design and build complex high scale services for model serving, considering security, scalability, maintainability, and cost-effectiveness Code Review and Quality Assurance: Focus on delivering a high-quality product and ensuring compliance with standards that safeguard customer security & privacy and modelling the engineering culture we aspire to for other engineers on the team. Problem Solving: Solve complex technical issues to improve the service & our customer's experience. Production Service Support: Work as part of an on-call rotation to support the services within the team's ownership, mitigating customer impacting incidents, driving clarity, and providing guidance and leadership to other engineers on the team when handling incidents. Collaborate with cross-functional and cross-geo teams and stakeholders Embody our culture and values QualificationsRequired Qualification:Bachelor’s degree in Computer Science, a related technical discipline, or equivalent experience. 3+ years of experience in designing and developing high availability, reliability, and scalability products and services. Having experience writing production quality service in languages including but not limited to - C#, Go, Python, Java, C++, JavaScript. Experience in building pre-production quality assurance pipelines and product runtime monitoring systems. Experience in collaborating across disciplines and teams. Preferred Qualifications Knowledge of containerization technologies such as Kubernetes, Docker, etc. Knowledge of AI technology products and tools. Ability to generate clarity and direction in ambiguous situations. Comprehensive full stack development capabilities, with a strong emphasis on C#, Go, JavaScript, and React. Experience in developing cutting-edge AI products and applications, with a deep understanding of AI technology and customer requirements. Proven experience in developing SDKs, reusable platforms, or frameworks. #AIPLATFORMAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Go",
          "Python",
          "Azure",
          "Java",
          "Kubernetes",
          "Docker",
          "React",
          "JavaScript"
        ],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    },
    {
      "title": "Python Developer (Fresher)",
      "company": "Golden Gate Restaurant Group",
      "location": "Malihabad, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/python-developer-fresher-at-golden-gate-restaurant-group-4286649875?position=5&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=9HLe3i0lwfs9Pb8xNGn0Cw%3D%3D",
      "post_date": "2025-08-15",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "MÔ TẢ CÔNG VIỆCVị trí Python Developer – Fresher sẽ hỗ trợ nhóm phát triển trong việc xây dựng, bảo trì và tối ưu các ứng dụng Web/API sử dụng Python.Ứng viên sẽ được hướng dẫn tham gia đầy đủ các giai đoạn phát triển phần mềm từ thiết kế, lập trình, kiểm thử đến triển khai, dưới sự hỗ trợ của các lập trình viên giàu kinh nghiệm. Hỗ trợ phát triển ứng dụngTham gia viết và chỉnh sửa API phục vụ Web và Mobile App dưới sự hướng dẫn của Senior Developer.Học và áp dụng framework Python (Django, Flask) vào dự án thực tế. Làm việc với cơ sở dữ liệuViết và chạy các truy vấn SQL cơ bản trên PostgreSQL hoặc MySQL.Hỗ trợ kiểm tra và xử lý dữ liệu theo yêu cầu dự án. Kiểm thử và sửa lỗiThực hiện unit test đơn giản hoặc test API bằng Postman.Hỗ trợ phát hiện và sửa lỗi theo hướng dẫn của team. Nghiên cứu & học hỏi công nghệ mớiTìm hiểu các công cụ DevOps cơ bản (Git, Docker).Cập nhật tiến độ công việc và trao đổi thường xuyên với nhóm lập trình. Tuân thủ quy trình phát triển phần mềmViết code rõ ràng, tuân thủ coding convention của team.Tham gia họp nhóm và báo cáo công việc định kỳ.YÊU CẦU CÔNG VIỆCHọc vấnSinh viên năm cuối hoặc mới tốt nghiệp các ngành CNTT, Khoa học Máy tính, Kỹ thuật Phần mềm hoặc ngành liên quan.Có kiến thức cơ bản về lập trình Python và nguyên lý phát triển phần mềm.Từng tham gia dự án môn học hoặc dự án cá nhân là lợi thế.Kinh nghiệmKhông yêu cầu kinh nghiệm thực tế, ưu tiên ứng viên từng thực tập hoặc có project cá nhân liên quan đến Python.Có kinh nghiệm với Django hoặc Flask là lợi thế.Đã từng làm việc nhóm trong môi trường dự án phần mềm (trong trường hoặc bên ngoài) là điểm cộng.Kỹ năng chuyên mônThành thạo kiến thức cơ bản Python 3.x (biến, kiểu dữ liệu, vòng lặp, hàm, xử lý file).Hiểu RESTful API và cách hoạt động của backend.Sử dụng cơ bản Django hoặc Flask (routing, view, model).Sử dụng cơ bản PostgreSQL hoặc MySQL, viết được truy vấn SQL đơn giản.Dùng Postman để test API, hiểu unit test (unittest hoặc pytest).Biết sử dụng Git và hiểu cơ bản về Docker.Kỹ năng mềmHam học hỏi, tiếp thu nhanh công nghệ mới.Giao tiếp rõ ràng, hợp tác tốt trong nhóm.Cẩn thận, kiên nhẫn và có tinh thần trách nhiệm.Ưu tiênĐã từng code mini project hoặc website nhỏ với Python.Có kiến thức cơ bản về bảo mật (SQL Injection, XSS).QUYỀN LỢILương tháng 13 + thưởng cuối năm.Được đào tạo và hướng dẫn trực tiếp bởi Senior Developer.Cơ hội tham gia dự án thực tế của tập đoàn F&B hàng đầu Việt Nam.Lộ trình thăng tiến lên vị trí lập trình viên chính thức sau khi hoàn thành thời gian Fresher/Internship.Ưu đãi giảm giá khi sử dụng dịch vụ tại hệ thống nhà hàng Golden Gate.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "PostgreSQL",
          "Python",
          "MySQL",
          "Flask",
          "SQL",
          "Docker",
          "Django"
        ],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    },
    {
      "title": "Software Engineer II",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-ii-at-microsoft-4296633639?position=6&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=vAPv0PGBRLaTGUTVMrDLDw%3D%3D",
      "post_date": "2025-09-06",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "Are you passionate about architecting, building, and maintaining next-generation platforms for real-time data delivery that power Microsoft’s multi-billion-dollar advertising business? On our team, you’ll design and evolve complex systems, apply AI and next-gen technologies to solve modern engineering challenges, and collaborate with Ads and Bing teams to enable new scenarios. We’re a fast-paced, inclusive team that values innovation, learning, and impact. If you’re self-driven and excited to tackle deep technical problems at scale while shaping the future of intelligent, next-gen platforms, we’d love to work with you.We’re looking for a solid Software Engineer II to join our Monetize engineering team, where you’ll help shape the future of ad delivery and monetization. You’ll work on systems that process massive volumes of data with strict latency and reliability requirements. The problems you’ll tackle include designing scalable APIs, optimizing auction logic, improving system observability, and enhancing live site resilience. You’ll collaborate with product managers, data scientists, and engineers across disciplines to deliver impactful solutions that scale globally. We’re looking for engineers who are curious, collaborative, and passionate about solving complex technical challenges. If you thrive in fast-paced environments, care deeply about engineering excellence, and want to build systems that make a measurable impact—this is the team for you.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesDesign and lead the implementation of large-scale applications and infrastructure for real-time data delivery, diagnostics, and monitoring.  Continuously refine data pipelines and system architecture to improve performance, reliability, and cost efficiency. Analyze data, telemetry, and delivery logs to uncover insights that shape technical design, feature roadmaps, and long-term strategy.  Collaborate with Ads and Bing teams to enable new scenarios, integrate shared infrastructure, and deliver unified solutions.  Provide production support by fixing bugs and resolving live-site issues to ensure system availability and reliability. Use AI tools and techniques to enhance engineering workflows, automate processes, and unlock new capabilities. Support and mentor teams, foster collaboration, and uphold high standards of engineering professionalism and technical rigor. QualificationsRequired Qualifications:Bachelor's Degree in Computer ScienceOR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python.4+ years in golang, Java, Strong SQL expertise, Kafka, Hadoop and product development experience including memory management, multithreading, and performance optimization, cloud expertise, AI Proficiency in data structures and algorithms, with a solid grasp of system design principles. Hands-on experience with distributed systems, real-time data processing, and streaming platforms like Kafka or Event Hubs. Familiarity with cloud platforms (preferably Azure), including services for compute, storage, monitoring, and diagnostics. Experience with CI/CD pipelines, version control systems (e.g., Git), and build tools.Exposure to AI/ML tools and frameworks, with the ability to apply them to engineering workflows and data-driven decision-making. Knowledge of observability practices, including telemetry, structured logging, and alerting systems. Other RequirementsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.Preferred QualificationsA collaborative team player with curiosity, a growth mindset, and a strong sense of responsibility Working knowledge of any other cloud service Demonstrated ability to work in collaborative, cross-functional teams, and contribute to high-quality, maintainable codebases. Proven experience in shipping production-quality code in fast-paced environments. 4+ years of hands-on experience in realtime data delivery platforms, distributed systems, big data processing pipelines, or large-scale applications. Exposure to AI/ML concepts and practical application of AI tools to solve modern engineering challenges. #MicrosoftAIMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Kafka",
          "Python",
          "Azure",
          "Java",
          "Hadoop",
          "SQL",
          "JavaScript"
        ],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    },
    {
      "title": "Javascript Developer - Remote Work",
      "company": "BairesDev",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/javascript-developer-remote-work-at-bairesdev-4298618285?position=7&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=LrM%2Fd14Tug0FajlMGklYMw%3D%3D",
      "post_date": "2025-09-10",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "At BairesDev®, we've been leading the way in technology projects for over 15 years. We deliver cutting-edge solutions to giants like Google and the most innovative startups in Silicon Valley.Our diverse 4,000+ team, composed of the world's Top 1% of tech talent, works remotely on roles that drive significant impact worldwide.When you apply for this position, you're taking the first step in a process that goes beyond the ordinary. We aim to align your passions and skills with our vacancies, setting you on a path to exceptional career development and success.Javascript Developer at BairesDevWe are looking for a Javascript Developer to join our team and be responsible for the programming and development of applications and software. You will be working on our browser Tag technology's front lines that power measurement and real-time data acquisition.What You Will Do:- Design and develop new front-end applications for various platforms.- Develop new user-facing features.- Perform code analysis, requirements analysis, system risk analysis, and software reliability analysis- Be in charge of tuning, improvement, balancing, usability, and automation- Optimize applications for maximum speed and scalability.- Develop and maintain specifications and designs for complex applications.Here’s what we are looking for:- 5+ years of experience with multiple JavaScript-based technologies.- Familiarity with front-end build tools.- Knowledge of Container Tags, the HTTP protocol, Cookies, request patterns, and library-free JavaScript development. - Experience with a responsive design for desktop/mobile.- Advanced English level.How we do make your work (and your life) easier:- 100% remote work (from anywhere).- Excellent compensation in USD or your local currency if preferred- Hardware and software setup for you to work from home.- Flexible hours: create your own schedule.- Paid parental leaves, vacations, and national holidays.- Innovative and multicultural work environment: collaborate and learn from the global Top 1% of talent.- Supportive environment with mentorship, promotions, skill development, and diverse growth opportunities.Apply now and become part of a global team where your unique talents can truly thrive!\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "JavaScript",
          "Javascript"
        ],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    },
    {
      "title": "Core Java Developers",
      "company": "EBC Technologies",
      "location": "Kakori, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/core-java-developers-at-ebc-technologies-3598186057?position=8&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=G%2FG8zA0zoK6JSbpTEUot2Q%3D%3D",
      "post_date": "2023-05-05",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "Experience: Minimum 2 YearsKey Skill Requirements: Good knowledge of OOPS with Core Java. Strong knowledge of Data Structures/Algorithm. Hands on server side development experience using Core Java/ Multi threading / Spring/ Hibernate/Web Services(SOAP/REST). Strong experience in Object Oriented Design and applying various Design Patterns. Familiarity with basics of relational databases and SQL/MySQL.Roles & Responsibilities: Work closely with Team leader, Other team members to implement functionalities from business specifications. Get involved in entire life-cycle including analysis, development, fixing and monitoring of issues on the assigned delivery lines. Do hands-on coding, unit testing. Focus on clean high-quality code and established design patterns. Learn new technologies, implement those and share learning with other team members.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Spring",
          "Java",
          "SQL",
          "MySQL"
        ],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    },
    {
      "title": "Junior JavaScript Developer - Remote work | REF#283756",
      "company": "BairesDev",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/junior-javascript-developer-remote-work-ref%23283756-at-bairesdev-4258063396?position=9&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=4Ia%2Fk7QKaPbO138QUr5LQQ%3D%3D",
      "post_date": "2025-06-26",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "At BairesDev®, we've been leading the way in technology projects for over 15 years. We deliver cutting-edge solutions to giants like Google and the most innovative startups in Silicon Valley.Our diverse 4,000+ team, composed of the world's Top 1% of tech talent, works remotely on roles that drive significant impact worldwide.When you apply for this position, you're taking the first step in a process that goes beyond the ordinary. We aim to align your passions and skills with our vacancies, setting you on a path to exceptional career development and success.As a Junior JavaScript Developer at BairesDev, you will work on developing and maintaining web applications using JavaScript and related technologies. You'll collaborate with experienced developers to implement features, fix bugs, and enhance web solutions while growing your skills in modern JavaScript frameworks and libraries.What You Will Do Develop and maintain web applications using JavaScript and related technologies. Implement responsive user interfaces with HTML, CSS, and JavaScript frameworks. Write clean, maintainable, and efficient code following best practices. Collaborate with team members on code reviews and problem-solving. Debug issues and optimize web application performance. Learn and apply modern JavaScript frameworks and libraries.What We Are Looking For 1+ year of experience with JavaScript development. Good understanding of basic algorithms and data structures. Familiarity with HTML5, CSS3, and responsive design. Basic knowledge of version control systems, preferably Git. Ability to solve problems effectively and learn new technologies quickly. Good level of English.How we do make your work (and your life) easier: 100% remote work (from anywhere). Excellent compensation in USD or your local currency if preferred Hardware and software setup for you to work from home. Flexible hours: create your own schedule. Paid parental leaves, vacations, and national holidays. Innovative and multicultural work environment: collaborate and learn from the global Top 1% of talent. Supportive environment with mentorship, promotions, skill development, and diverse growth opportunities.Join a global team where your unique talents can truly thrive!\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "JavaScript"
        ],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    },
    {
      "title": "Software Engineer 2 – Machine Learning",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-2-%E2%80%93-machine-learning-at-microsoft-4301288203?position=10&pageNum=0&refId=2VLWRENWMs7IV%2BY6kiGQdQ%3D%3D&trackingId=qJ9iMgrfDIkT%2BBJ0nM2UgA%3D%3D",
      "post_date": "2025-09-16",
      "scraped_at": "2025-09-18T02:25:17.865376",
      "source": "public_api",
      "details": {
        "description": "The Microsoft CoreAI Post-Training team is dedicated to advancing post-training methods for both OpenAI and open-source models. Their work encompasses continual pre-training, large-scale deep reinforcement learning running on extensive GPU resources, and significant efforts to curate and synthesize training data. In addition, the team employs various fine-tuning approaches to support both research and product development.The team also develops advanced AI technologies that integrate language and multi-modality for a range of Microsoft products. The team is particularly active in developing code-specific models, including those used in Github Copilot and Visual Studio Code, such as code completion model and the software engineering (SWE) agent models. The team has also produced publications as by-products, including work such as LoRA, DeBerTa, Oscar, Rho-1, Florence, and the open-source Phi models.We are looking for a Software Engineer 2 - Machine Learning with significant experience in large-scale model training, data curation, and hands-on coding. You will help in developing LLMs, SLMs, multimodal, and coding models using both proprietary and open-source frameworks. Key responsibilities include improving model quality and training efficiency through advanced techniques and data strategies, and managing the full pipeline from data ingestion, evaluation, to inference.Our team values startup-style efficiency and practical problem-solving. We are seeking a curious, adaptable problem-solver who thrives on continuous learning, embraces changing priorities, and is motivated by creating meaningful impact. Candidates must be self-driven, able to write high-quality code and debug complex systems, document their work clearly, and demonstrate solid experience in shipping ML systems.ResponsibilitiesResponsibilitiesCollaborate with senior engineers and researchers to build and optimize training and inference pipelines for LLMs, SLMs, multimodal, and code-specific models. Contribute to the deployment and monitoring of models in production environments. Write clean, efficient, and maintainable code for ML systems. Help improve inference performance, reliability, and scalability. Participate in rapid experimentation cycles and support integration with Microsoft products. QualificationsRequired QualificationsBachelor’s or master’s degree in computer science, Engineering, or a related field, or equivalent practical experience. 3+ years of professional experience, including 2+ years with Python and ML frameworks such as PyTorch or TensorFlow. Hands-on experience with training or fine-tuning LLMs or multimodal models. Familiarity with production ML systems and concepts like model serving, caching, batching, and monitoring. Understanding of distributed systems and cloud-based infrastructure. Preferred QualificationsExperience with containerization tools (e.g., Docker, Kubernetes). Exposure to MLOps or DevOps practices (CI/CD, automated testing, deployment). Interest in generative AI and open-source model ecosystems. Ability to work in a fast-paced, collaborative environment with a growth mindset. Strong communication and documentation skills. #aip #aiplatform #aipidcAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
        "skills": [
          "Python",
          "Kubernetes",
          "PyTorch",
          "TensorFlow",
          "Docker"
        ],
        "salary": "Not specified",
        "job_type": "Not specified",
        "experience_level": "Not specified"
      }
    }
  ],
  "metadata": {
    "scraped_at": "2025-09-18T02:27:00.414768",
    "total_jobs": 10
  }
}