{
  "jobs": [
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4315143274?position=1&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=8kMRDk4gS8nEopBt%2BxnF5g%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "Microsoft is a company where passionate innovators come to collaborate, envision what can be and take their careers further. This is a world of more possibilities, more innovation, more openness, and the sky is the limit thinking in a cloud-enabled world.Microsoft’s Azure Data engineering team is leading the transformation of analytics in the world of data with products like databases, data integration, big data analytics, messaging & real-time analytics and business intelligence. The products our portfolio include Microsoft Fabric, Azure SQL DB, Azure Cosmos DB, Azure PostgreSQL, Azure Data Factory, Azure Synapse Analytics, Azure Service Bus, Azure Event Grid, and Power BI. Our mission is to build the data platform for the age of AI, powering a new class of data-first applications and driving a data culture.We do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better served.Within Azure Data, the databases team builds and maintains Microsoft's operational Database systems. We store and manage data in a structured way to enable multitude of applications across various industries. We are on a journey to enable developer friendly, mission-critical, AI enabled operational Databases across relational, non-relational and OSS offerings.Azure Cosmos DB is one of the fastest growing Azure services that provides globally distributed, low-latency, massively scalable, multi-model cloud database service. It is designed to enable developers to build planet-scale applications.We are hiring a Software Engineer to join the Azure Cosmos DB team, where you will be working on a large-scale distributed operational database. In this role, you will work on distributed systems problems and technologies to determine the future of our planet scale database.We do not just value differences or different perspectives. We seek them out and invite them in so we can tap into the collective power of everyone in the company. As a result, our customers are better servedResponsibilitiesDesign, implement and ship distributed database management system offerings effectively providing customer value in terms of security , performance, reliability, usability and manageability while ensuring business goals are met.Collaborate effectively with the team, make appropriate systems tradeoffs in design and implementation and ensure customer success in their use of the productWork in a culture of continuous improvement, adaptation, reflection, and growthEmbody our culture and valuesQualificationsRequired/Minimum Qualifications Bachelor's Degree in Computer Science/ Engineering/related fields OR equivalent industry experience 2+ years of software development experience in building and shipping production software or services with code in languages such as C, C++, C# or similar.Candidates with prior working experience on CosmosDB or MongoDB will be preferred.Good communication skills, both verbal and written Other RequirementsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter. Equal Opportunity Employer (EOP) /span>#azdat#azuredata#azdat #azuredata #cosmosdb #databasesMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "MongoDB",
        "SQL",
        "PostgreSQL",
        "Azure",
        "Power BI"
      ],
      "salary": "₹200,000.00\n            -\n            ₹1,500,000.00",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4315829882?position=2&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=HyH%2FZA21lZtrQkTKZbkBbg%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "The Microsoft 365 Copilot Mobile team in India is looking for a passionate and talented Software Engineer to build the next generation of AI-powered mobile experiences for iOS.The M365 Copilot App team is redefining productivity on mobile by delivering Copilot-powered experiences that combine the richness of Word, Excel, and PowerPoint with mobile-first design. Our mission is to enable seamless creation, consumption, and collaboration on the go.With 100M+ monthly active users and growing daily engagement, we’re building an app that is truly centered around the user, scaling across multiple digital identities to keep them productive anytime, anywhere. Achieving this requires faster experimentation, solid quality of experience, and coherence across platforms.Search and innovation is at the heart of this mission. We’re building intelligent, AI-driven search experiences that help users find what they need—documents, chats, emails, and more—quickly and effortlessly. Our goal is to make search context-aware, personalized, and lightning fast, leveraging the power of large language models and Microsoft Graph.We thrive on a fast-paced ideate → create → learn cycle and measure success through tangible value delivered to our customers. As we scale to the next level of growth, we’re looking for passionate, purposeful, and resilient engineers who embrace learning and bring a “can-do” attitude to solving complex challenges.The ideal Software Engineer will have a blend of technical chops in native (C/C++) language and good experience in Android and iOS development. Having a background or early exposure to experimentation and data science is a plus. If you don’t have that background, you will have the opportunity to immerse yourself in data driven engineering practice.As we scale to the next level of growth, we’re looking for highly motivated, self-starter engineers who thrive in a bottoms-up, fast-paced, highly technical environment, have a solid customer focus, and understand the importance of quality. If you’re passionate about building first-class productivity experiences, this is the place for you. Why Join Us? Impact at Scale: Build features that empower millions of users globally. Work on Cutting-Edge Tech: AI-first, mobile-first experiences across iOS and Android. Lead and Grow: Take ownership of features and lead small crews while learning from world-class engineers. Inclusive Culture: Collaborate in an environment that values innovation, diversity, and continuous learning. Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.   ResponsibilitiesDesign and implement end-to-end search experiences in the Copilot app, spanning query formulations with various treatments, ranking, and UX.Build high-performance, scalable search components optimized for mobile platforms.Collaborate across disciplines—partner with PMs, designers, and AI experts to deliver context-aware, personalized search.Design and implement end to end experiences on mobile spanning core data model, processing, and UX along with service integrations.Engineer features with solid attention to performance, robustness, and resource usage.Work independently and collaboratively within and across product teams.QualificationsRequired Qualifications:Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.Growth mindset and eagerness to learn new technologies.Frameworks & SDK: Solid experience with iOS SDK, SwiftUI, UIKit, Core Data, and Combine.Performance Optimization: Understanding of memory management, ARC, and performance tuning; experience with Instruments for profiling.Testing: Familiarity with XCTest for unit testing and XCUITest for UI automation.APIs & Data Handling: Experience with RESTful APIs, JSON, and optionally GraphQL.Deployment: Knowledge of App Store publishing, TestFlight, and app signing processes.Preferred QualificationsMaster's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR Bachelor's Degree in Computer Science or related technical field AND 1 to 3 years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.1–3 years of experience in mobile development (internships count!).Familiarity with data-driven engineering or experimentation (bonus).Interpersonal skills A sense of personal ownership is required, together with the ability to deliver timely and high quality while managing internal stakeholder expectations.Self-motivated and organized to deliver results. Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Java",
        "go",
        "Python",
        "JavaScript"
      ],
      "salary": "₹200,000.00\n            -\n            ₹1,500,000.00",
      "job_type": "",
      "experience_level": "Lead"
    },
    {
      "title": "Web Developer in Lucknow",
      "company": "Reno Platforms",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/web-developer-in-lucknow-at-reno-platforms-4312913000?position=3&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=%2FNmcigNHCr778yPS41zV6A%3D%3D",
      "post_date": "2025-10-10",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "Key Responsibilities Working on live projects and state-of-the-art web products at the forefront of the education industry Working on database management and operations. Develop and maintain web applications using React and Next.js. Collaborate with cross-functional teams to translate designs and wireframes into high-quality code. Optimize applications for maximum speed and scalability. Ensure the technical feasibility of UI/UX designs. Stay up-to-date with emerging trends in web development and apply them in our projects.About Company: Reno Platforms aims to build an entire operating system for premier education institutions in this country. Trusted by 100+ premier institutions, including IITs, IIMs, Ashoka University, Royal Global Group, GD Goenka Group, and many more! With a combined experience of 15+ years in the education industry and working with 100+ institutions, we bring our combined expertise to build revolutionary products that solve complex problems of education institutions at any scale.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "React"
      ],
      "salary": "₹140,000.00\n            -\n            ₹600,000.00",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4316317828?position=4&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=bJ3N%2BaNAv7L5q4co0MsDJw%3D%3D",
      "post_date": "2025-10-17",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "Microsoft Silicon, Cloud Hardware, and Infrastructure Engineering (SCHIE) is the team behind Microsoft’s expanding Cloud Infrastructure and responsible for powering Microsoft’s “Intelligent Cloud” mission. SCHIE delivers the core infrastructure and foundational technologies for Microsoft's over 200 online businesses including Bing, MSN, Office 365, Xbox Live, Teams, OneDrive, and the Microsoft Azure platform globally with our server and data center infrastructure, security and compliance, operations, globalization, and manageability solutions. Our focus is on smart growth, high efficiency, and delivering a trusted experience to customers and partners worldwide and we are looking for passionate, high-energy engineers to help achieve that mission.The Azure Data Processing Unit (DPU) team brings together state-of-the-art software and hardware expertise to create a highly programmable and high-performance chip with the capability to efficiently handle large data volumes. Thanks to its integrated design, this solution empowers Azure to develop solutions for solving the next generation problems with increased agility and performance leveraging the DPU’s compute, storage, and networking capabilities.As a Software Engineer in the DPU Networking software team, you will design, develop, deploy and support networking packet forwarding that enable high performant data processing within various network endpoints in Azure data centers. You will work as part of a dynamic, multi-talented team of engineers from across the world. This opportunity will allow you to develop new solutions for the Azure fleet, participate in the design of cutting-edge networking solutions and hone your design and performance optimization skills.As Microsoft's cloud business continues to grow the ability to deploy new offerings and hardware infrastructure on time, in high volume with high quality and lowest cost is of paramount importance. To achieve this goal, the DPU Networking Software team is instrumental in defining and delivering operational measures of success for quality, delivery, scale and sustainability related to Microsoft cloud software. We are looking for engineers with a dedicated passion for customer focused solutions, insight and industry knowledge to envision and implement future technical solutions that will manage and optimize the Cloud infrastructure.#azurehwjobsResponsibilitiesCollaborates with appropriate stakeholders to determine user requirements for a scenario. Drives identification of dependencies and the development of design documents for a product, application, service, or platform. Creates, implements, optimizes, debugs, refactors, and reuses code to establish and improve performance and maintainability, effectiveness, and return on investment (ROI). Acts as a Designated Responsible Individual (DRI), working on call to monitor system/product/service for degradation, downtime, or interruptions, alerting stakeholders about status and initiates actions to restore system/product/service for simple and complex problems when appropriate. Proactively seeks new knowledge and adapts to new trends, technical solutions, and patterns that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale. QualificationsRequiredExperience in software design and coding of Layer2/L3/L4 ethernet/IP networking packet forwarding functions. Minimum 2 years of programming experience in C or C++ Bachelor's degree in computer science or computer engineering, or related technical discipline AND 2+ years software development engineering experience  OR equivalent experience. PreferredExperience in developing packet forwarding features within SDN - Software Defined Networking – data path CI/CD Experience: Knowledge of Continuous Integration and Continuous Deployment (CI/CD) practices for streamlined software development and deployment processes. Scripting for Developer Tools: Proficiency in scripting languages to build and enhance developer tools, automating repetitive tasks and improving workflow efficiency. OtherAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Azure"
      ],
      "salary": "₹200,000.00\n            -\n            ₹1,500,000.00",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Backend Developer Trainee",
      "company": "Gramik™",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/backend-developer-trainee-at-gramik%E2%84%A2-4232601133?position=5&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=w61lMGm2J8HTh4ZLMO7JdQ%3D%3D",
      "post_date": "2025-05-22",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "Job Title: Backend Developer InternLocation: LucknowCompany: GRAMIKStipend: ₹7,000 – ₹8,000 per monthEmployment Type: Internship (Full-time)About GRAMIKGramik is an agri-tech startup focused on empowering farmers through technology and transparent last-mile delivery. We operate through a dual model—B2C via Village Level Entrepreneurs (VLEs) and B2B through retail partnerships—to deliver high-quality agri-inputs and cattle feed supplements, while enabling rural entrepreneurship.Internship OverviewWe are seeking a proactive and detail-oriented Backend Developer Intern to support our product and operations teams. This role is ideal for candidates looking to gain hands-on experience in backend operations and development within a growing startup environment.Key ResponsibilitiesUpload and manage product listings in the backend system (top priority).Assist with day-to-day backend operations and administrative tasks.Coordinate with other teams (product, design, ops) to ensure smooth execution of backend updates.Support database updates, content management, and other technical tasks as required.RequirementsBasic understanding of backend systems, databases, and content management.Familiarity with tools like Excel, CMS platforms, or simple backend interfaces.Attention to detail and strong organizational skills.Eagerness to learn and contribute to multiple areas within the backend team.What You’ll GetStipend of ₹7,000 – ₹8,000 per monthReal-world experience in backend workflows and digital operationsExposure to a fast-paced startup environment with mentoring from experienced team membersOpportunity to convert to a full-time role based on performance and company needs\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "₹200,000.00\n            -\n            ₹1,000,000.00",
      "job_type": "Full-Time",
      "experience_level": ""
    },
    {
      "title": "Python Developer (Fresher)",
      "company": "Golden Gate Restaurant Group",
      "location": "Malihabad, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/python-developer-fresher-at-golden-gate-restaurant-group-4286649875?position=6&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=Kf%2BTvrq9VUbWbCns2imE8Q%3D%3D",
      "post_date": "2025-08-15",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "MÔ TẢ CÔNG VIỆCVị trí Python Developer – Fresher sẽ hỗ trợ nhóm phát triển trong việc xây dựng, bảo trì và tối ưu các ứng dụng Web/API sử dụng Python.Ứng viên sẽ được hướng dẫn tham gia đầy đủ các giai đoạn phát triển phần mềm từ thiết kế, lập trình, kiểm thử đến triển khai, dưới sự hỗ trợ của các lập trình viên giàu kinh nghiệm. Hỗ trợ phát triển ứng dụngTham gia viết và chỉnh sửa API phục vụ Web và Mobile App dưới sự hướng dẫn của Senior Developer.Học và áp dụng framework Python (Django, Flask) vào dự án thực tế. Làm việc với cơ sở dữ liệuViết và chạy các truy vấn SQL cơ bản trên PostgreSQL hoặc MySQL.Hỗ trợ kiểm tra và xử lý dữ liệu theo yêu cầu dự án. Kiểm thử và sửa lỗiThực hiện unit test đơn giản hoặc test API bằng Postman.Hỗ trợ phát hiện và sửa lỗi theo hướng dẫn của team. Nghiên cứu & học hỏi công nghệ mớiTìm hiểu các công cụ DevOps cơ bản (Git, Docker).Cập nhật tiến độ công việc và trao đổi thường xuyên với nhóm lập trình. Tuân thủ quy trình phát triển phần mềmViết code rõ ràng, tuân thủ coding convention của team.Tham gia họp nhóm và báo cáo công việc định kỳ.YÊU CẦU CÔNG VIỆCHọc vấnSinh viên năm cuối hoặc mới tốt nghiệp các ngành CNTT, Khoa học Máy tính, Kỹ thuật Phần mềm hoặc ngành liên quan.Có kiến thức cơ bản về lập trình Python và nguyên lý phát triển phần mềm.Từng tham gia dự án môn học hoặc dự án cá nhân là lợi thế.Kinh nghiệmKhông yêu cầu kinh nghiệm thực tế, ưu tiên ứng viên từng thực tập hoặc có project cá nhân liên quan đến Python.Có kinh nghiệm với Django hoặc Flask là lợi thế.Đã từng làm việc nhóm trong môi trường dự án phần mềm (trong trường hoặc bên ngoài) là điểm cộng.Kỹ năng chuyên mônThành thạo kiến thức cơ bản Python 3.x (biến, kiểu dữ liệu, vòng lặp, hàm, xử lý file).Hiểu RESTful API và cách hoạt động của backend.Sử dụng cơ bản Django hoặc Flask (routing, view, model).Sử dụng cơ bản PostgreSQL hoặc MySQL, viết được truy vấn SQL đơn giản.Dùng Postman để test API, hiểu unit test (unittest hoặc pytest).Biết sử dụng Git và hiểu cơ bản về Docker.Kỹ năng mềmHam học hỏi, tiếp thu nhanh công nghệ mới.Giao tiếp rõ ràng, hợp tác tốt trong nhóm.Cẩn thận, kiên nhẫn và có tinh thần trách nhiệm.Ưu tiênĐã từng code mini project hoặc website nhỏ với Python.Có kiến thức cơ bản về bảo mật (SQL Injection, XSS).QUYỀN LỢILương tháng 13 + thưởng cuối năm.Được đào tạo và hướng dẫn trực tiếp bởi Senior Developer.Cơ hội tham gia dự án thực tế của tập đoàn F&B hàng đầu Việt Nam.Lộ trình thăng tiến lên vị trí lập trình viên chính thức sau khi hoàn thành thời gian Fresher/Internship.Ưu đãi giảm giá khi sử dụng dịch vụ tại hệ thống nhà hàng Golden Gate.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Docker",
        "Python",
        "SQL",
        "PostgreSQL",
        "Django",
        "MySQL",
        "Flask"
      ],
      "salary": "₹360,000.00\n            -\n            ₹540,000.00",
      "job_type": "Internship",
      "experience_level": "Senior"
    },
    {
      "title": "Manual Tester  @ Lucknow office",
      "company": "Digital Brain Media - Official",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/manual-tester-%40-lucknow-office-at-digital-brain-media-official-4306113541?position=7&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=wHYKIuGjcjlpw%2Bo%2B9qJlEQ%3D%3D",
      "post_date": "2025-09-30",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "Dear Candidates,We are looking candidates for Lucknow office,Review and analyze system specificationsCollaborate with QA engineers to develop effective strategies and test plansExecute test cases (manual or automated) and analyze resultsEvaluate product code according to specificationsCreate logs to document testing phases and defectsReport bugs and errors to development teamsHelp troubleshoot issuesConduct post-release/ post-implementation testingWork with cross-functional teams to ensure quality throughout the software development lifecyclemobile testing android and ios is must.automation testing on apium and selenium or jira is recomendedNote: This position is only for lucknow office, loorking for local candidates. Skills:- Mobile App Testing (QA), Android Testing, iOS Testing and API QA\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [],
      "salary": "Base pay range₹100,000.00/yr - ₹400,000.00/yr",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Software Engineer II",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-ii-at-microsoft-4315141370?position=8&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=6n%2Bfn47znb601YBcJ8A6mA%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "Azure is the fastest-growing business in Microsoft’s history and is the foundation of Microsoft’s commercial Cloud Services. We are a part of the Azure Core team that builds and manages the core platform across various services. We have an exciting opportunity for you to innovate and shape the world's computers, and we encourage you to apply and learn more!As a Software Engineer II you will lead high-impact research, build predictive models and will be responsible for collaborating to deliver the next generation of our cloud capacity management technologies, a critical investment area for Microsoft Azure. Your work will be relied upon by millions of customers globally and you will have learning opportunities and challenges around high-scale distributed systems. You’ll identify opportunities, design and scope new engineering projects to real-world challenges.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.ResponsibilitiesYou will research and maintain a deep knowledge of the industry, including trends and technologies, so that you can identify strategy opportunities and contribute to thought leadership best practices. You’ll also write extensible code that spans multiple features and develop expertise in proper debugging techniques.You will define business, customer, and solution strategy goals, and partner with other teams to identify and explore new opportunities.You’ll also apply a customer-oriented focus to understand their needs, and help drive realistic customer expectations.You will remains current in skills by investing time and effort into being informed of current developments that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.QualificationsRequired Qualifications:Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.2+ years of customer-facing, project-delivery, professional services, and/or consulting experience.Other RequirementsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Preferred QualificationsBachelor's Degree in Engineering or related technical field AND 5+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.#azurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Java",
        "Azure",
        "JavaScript"
      ],
      "salary": "₹120,000.00\n            -\n            ₹360,000.00",
      "job_type": "",
      "experience_level": "Lead"
    },
    {
      "title": "Software Developer",
      "company": "Soft Solutions",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-developer-at-soft-solutions-4306120377?position=9&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=od4iwMmDrSbeSR9DCMjd4Q%3D%3D",
      "post_date": "2025-09-30",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "The developer needs to have worked on NodeJS, DotNet and should be able to work independently. Working hours are mostly 9 hours a day and 5 days a week. Skills:- .NET, SQL, AngularJS (1.x), React.js, Spring Boot and NodeJS (Node.js)\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "SQL",
        "Node.js",
        "React",
        "Spring"
      ],
      "salary": "Base pay range₹400,000.00/yr - ₹700,000.00/yr",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Full Stack Developer - Lucknow",
      "company": "Indus Action",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-developer-lucknow-at-indus-action-4311629128?position=10&pageNum=0&refId=sPSMMSpfnM1xvNesZwQTxQ%3D%3D&trackingId=dHmIhuad%2B8aRtOqlM%2F9dmQ%3D%3D",
      "post_date": "2025-10-08",
      "scraped_at": "2025-10-20T18:35:17.618621",
      "source": "public_api",
      "description": "About Indus Action Founded in 2013, Indus Action is one of India’s leading policy implementation organisations dedicated to enabling sustainable access to social protection for vulnerable citizens. We aim to enable over 800 million vulnerable citizens in India to move irreversibly out of extreme poverty by facilitating access to critical government support to which they are entitled. We use inclusive, tech-enabled, citizen-centric social protection systems in partnership with government departments. Since inception, we have supported more than 1.9 million citizens in accessing welfare entitlements across workstreams of education, labour, food security, access to public services and pandemic relief.The AssignmentIndus Action, in partnership with the Uttar Pradesh Labour Department, is working to strengthen welfare delivery systems for construction and unorganised workers under the Building and Other Construction Workers’ (BoCW) Welfare Board. This collaboration, formalised through a three-year MoU, focuses on improving citizen-state experience in accessing entitlements, increasing transparency, reducing inclusion/exclusion errors, and integrating worker systems with the State’s Family ID initiative.A key part of this mandate is to maintain and enhance the UPBoCW portal, ensuring it can handle registrations, claims, renewals, cess collection, and scheme delivery efficiently. The portal is central to streamlining workflows, implementing validation protocols, and linking with other state databases for improved targeting and transparency.To support this effort, Indus Action is seeking to place a Full-Stack .NET Developer at the UPBoCW Board in Lucknow. This developer will work closely with the Board’s IT team, Indus Action, and external vendors to ensure the portal is stable, responsive to policy changes, and aligned with the broader digitisation roadmap under the MoU.Scope of WorkThe developer will: Maintain and Enhance the Portal: Ensure smooth functioning of the existing UPBoCW portal, proactively monitor performance, and resolve issues promptly.  Bug Fixes & Quality Assurance: Rectify bugs identified by the testing and operations teams to improve system reliability and citizen experience.  Policy Integration: Incorporate new processes, schemes, or validation protocols into the portal in line with Labour Department policy changes and Indus Action’s recommendations under the MoU.  Data Management: Handle ad-hoc and structured data requests, write SQL queries, and generate analytical reports to support programme monitoring, district performance tracking, and evaluation needs.  Support Digitisation Roadmap: Facilitate the integration of unique worker IDs with the state’s Family ID system, and support workflows aimed at reducing inclusion/exclusion errors and improving scheme auto-enrolment.  Vendor Coordination: Act as the technical bridge between the Board’s requirements, Indus Action’s process/wireframe designs, and the external technology vendor building the new BoCW portal.  Documentation & Reporting: Maintain clear documentation of updates, integrations, and workflow changes to strengthen institutional memory and system continuity. Deliverables Timely resolution of bugs and issues flagged by the testing/operations team.  Integration of approved new features and process changes in the portal.  Generation of accurate data reports and queries on demand.  Clear documentation of updates, changes, and integration work done.  Effective coordination with the external vendor on the new portal development. RequirementsEducational Qualifications Bachelor’s degree in Computer Science Engineering/IT, MCA, or MSc Computer Science (or equivalent).Technical Skills Strong proficiency in ASP.NET with C#.  Proficiency in HTML, JavaScript, jQuery, AJAX, and CSS.  Experience with Microsoft SQL Server and writing/optimizing Stored Procedures.  Familiarity with Entity Framework (EF) and ADO.NET.  Hands-on experience with .NET Framework 4.5 and above.  Experience in both frontend and backend development (Full-Stack). Experience Minimum 3–5 years of relevant experience in web application development and maintenance.  Prior experience working with government IT systems or large-scale portals will be an advantage. Other Competencies Strong problem-solving skills and ability to work independently.  Effective communication and documentation skills.  Ability to coordinate with multiple stakeholders (government officials, IT vendors, internal teams).  Willingness to learn new technologies. BenefitsTerms of Engagement  Location: Lucknow, Uttar Pradesh (based at the UPBoCW Welfare Board office).  Compensation: Up to INR 10 LPA (all-inclusive).  The candidate will need to bring their own laptop/device for work unless otherwise specified.  All data accessed during the assignment will be treated as confidential.  Contract Duration: 6 months, with the possibility of extension based on performance and project requirements.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "SQL",
        "JavaScript"
      ],
      "salary": "₹200,000.00\n            -\n            ₹1,000,000.00",
      "job_type": "Contract",
      "experience_level": ""
    },
    {
      "title": "Javascript Developer",
      "company": "TROOLOGY",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/javascript-developer-at-troology-4306123393?position=1&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=fLv3faWzotR2cSDMvIMQFQ%3D%3D",
      "post_date": "2025-09-30",
      "scraped_at": "2025-10-20T18:35:25.480605",
      "source": "public_api",
      "description": "Duties And ResponsibilitiesBuilding interactive consumer data from multiple systems and REST fully abstracting to the UI through an Angularjs developer backendDefine code architecture decisions to support a high-performance and scalable product with a minimal footprintAddress and improve any technical issuesCollaborate well with engineers, researchers, and data implementation specialists to design and create advanced, elegant, and efficient systemsRequirements And QualificationsPrevious working experience as an Angularjs developer for 2 yearsBachelor's degree in Computer Science or similar relevant fieldIn-depth knowledge of Angularjs developer, ExpressJS or RestifyExperience implementing applications using Angular 1 or ReactExperience creating front end applications using HTML5, Angular, LESS/SASSHands-on experience with JavaScript Development on both client and server-sideExperience with modern frameworks and design patterns, minimum one-year experience with MEAN Fullstack paradigmKnowledge of the following will be considered as an advantage:Consumer Web Development Experience for High-Traffic, Public Facing web applicationsExperience with cloud technologies is also a plusCreating secure RESTful-based web services in XML and JSON, Javascript, JQueryContinuous integration (Jenkins/Hudson) and version control (SVN, Git)Skills:- Javascript, HTML/CSS, AngularJS (1.x), MongoDB and React Native\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Jenkins",
        "MongoDB",
        "Javascript",
        "JavaScript",
        "Angular",
        "React"
      ],
      "salary": "Base pay range₹200,000.00/yr - ₹1,000,000.00/yr",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Core Java Developers",
      "company": "EBC Technologies",
      "location": "Kakori, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/core-java-developers-at-ebc-technologies-3598186057?position=2&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=JQ91o12Zeh4o41muxk5DLg%3D%3D",
      "post_date": "2023-05-05",
      "scraped_at": "2025-10-20T18:35:25.482614",
      "source": "public_api",
      "description": "Experience: Minimum 2 YearsKey Skill Requirements: Good knowledge of OOPS with Core Java. Strong knowledge of Data Structures/Algorithm. Hands on server side development experience using Core Java/ Multi threading / Spring/ Hibernate/Web Services(SOAP/REST). Strong experience in Object Oriented Design and applying various Design Patterns. Familiarity with basics of relational databases and SQL/MySQL.Roles & Responsibilities: Work closely with Team leader, Other team members to implement functionalities from business specifications. Get involved in entire life-cycle including analysis, development, fixing and monitoring of issues on the assigned delivery lines. Do hands-on coding, unit testing. Focus on clean high-quality code and established design patterns. Learn new technologies, implement those and share learning with other team members.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Java",
        "MySQL",
        "SQL",
        "Spring"
      ],
      "salary": "₹360,000.00\n            -\n            ₹540,000.00",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Software Engineer 2",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-2-at-microsoft-4308079825?position=3&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=bo1yumzRG55YonAI%2Fq8obQ%3D%3D",
      "post_date": "2025-09-29",
      "scraped_at": "2025-10-20T18:35:25.483124",
      "source": "public_api",
      "description": "The AI Platform organization at Microsoft builds the end-to-end Azure AI stack/PaaS and is core to Azure’s innovation and differentiation, as well as all of Microsoft’s flagship products, from Office to Teams, to Xbox. We are the team building Azure OpenAI, Azure ML, Cognitive Services, and the global Azure AI infrastructure for running the largest AI workloads on the planet.  Within AI Platform, the AI Foundry team enables data scientists and developers to quickly and easily build, train, deploy, manage, and consume machine learning model. Our AI Foundry OSS Model Customization Team is at the forefront of this mission, working on groundbreaking projects for customizing of OSS models. We collaborate closely with research institutions, industry leaders, and organizations worldwide to create innovative solutions that impact millions of usersResponsibilitiesResponsibilitiesAs a Software Engineer 2 in our team, you will:Write clean and concise code with unit tests  As a contributor in a customer-obsessed team, you will collaborate with data scientists and other developers on the team to create the necessary abstractions, infrastructure, interfaces and implement features to train, test, validate for machine learning algorithms including but not limited to data cleaning, model training, hyper parameter tuning at massive, distributed scale. You will also be working on scaling these features for big data using distributed systems. You will drive the incorporation of these customer-inspired innovations into our software. You will take holistic ownership of your features.Your responsibilities will include contributing to and/or backend stateful services written in C# hosted on Kubernetes clusters and Docker containers to provide meaningful features to the customers. You will also be working on improving Python SDK's existing features, designing new features, implementing them in our distributed, multi-component SDK, and owning the full lifecycle of the features including testing and release.QualificationsQualifications:4+ years of experience writing production code in building internet scale services and distributed systems.  Ability to debug, read code and work on a large and increasing codebase.Engineering knowledge of machine learning systems and data pipelines.Experience mentoring other developers, working partners and being a team player.Excellent communication and presentation skills#AzureAIPlatform, #AzureAIFoundry,Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Azure",
        "Python",
        "Docker",
        "Kubernetes"
      ],
      "salary": "₹200,000.00\n            -\n            ₹1,500,000.00",
      "job_type": "",
      "experience_level": "Mid Level"
    },
    {
      "title": "Junior JavaScript Developer - Remote work | REF#283756",
      "company": "BairesDev",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/junior-javascript-developer-remote-work-ref%23283756-at-bairesdev-4258063396?position=4&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=7OrzIRL7Yj6poswb%2BBjzag%3D%3D",
      "post_date": "2025-06-26",
      "scraped_at": "2025-10-20T18:35:25.483967",
      "source": "public_api",
      "description": "At BairesDev®, we've been leading the way in technology projects for over 15 years. We deliver cutting-edge solutions to giants like Google and the most innovative startups in Silicon Valley.Our diverse 4,000+ team, composed of the world's Top 1% of tech talent, works remotely on roles that drive significant impact worldwide.When you apply for this position, you're taking the first step in a process that goes beyond the ordinary. We aim to align your passions and skills with our vacancies, setting you on a path to exceptional career development and success.As a Junior JavaScript Developer at BairesDev, you will work on developing and maintaining web applications using JavaScript and related technologies. You'll collaborate with experienced developers to implement features, fix bugs, and enhance web solutions while growing your skills in modern JavaScript frameworks and libraries.What You Will Do Develop and maintain web applications using JavaScript and related technologies. Implement responsive user interfaces with HTML, CSS, and JavaScript frameworks. Write clean, maintainable, and efficient code following best practices. Collaborate with team members on code reviews and problem-solving. Debug issues and optimize web application performance. Learn and apply modern JavaScript frameworks and libraries.What We Are Looking For 1+ year of experience with JavaScript development. Good understanding of basic algorithms and data structures. Familiarity with HTML5, CSS3, and responsive design. Basic knowledge of version control systems, preferably Git. Ability to solve problems effectively and learn new technologies quickly. Good level of English.How we do make your work (and your life) easier: 100% remote work (from anywhere). Excellent compensation in USD or your local currency if preferred Hardware and software setup for you to work from home. Flexible hours: create your own schedule. Paid parental leaves, vacations, and national holidays. Innovative and multicultural work environment: collaborate and learn from the global Top 1% of talent. Supportive environment with mentorship, promotions, skill development, and diverse growth opportunities.Join a global team where your unique talents can truly thrive!\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "JavaScript"
      ],
      "salary": "₹300,000.00\n            -\n            ₹700,000.00",
      "job_type": "Remote",
      "experience_level": "Junior"
    },
    {
      "title": "Senior Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/senior-software-engineer-at-microsoft-4315621034?position=5&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=7m2z9yZKUrr6OJnEsRP2Yw%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:35:25.483967",
      "source": "public_api",
      "description": "The Azure Storage Data Processing Unit (DPU) organization is looking for a talented and highly motivated Senior Software Engineer to design and develop the next generation of our storage backend. We are building the next generation of Microsoft’s cloud storage solution - Microsoft Azure Storage, which is a massively scalable, highly distributed, ubiquitously accessible storage system, designed to scale out and serve the entire world. Drive innovation with the latest hardware and software technology for hyperscale cloud storage. Our team is building next generation storage solutions using Fungible DPUs with focus on security, reliability, performance, and efficiency.As a Senior Software Engineer on the Azure Storage DPU Infrastructure team, you will help enable Azure’s infrastructure to support, deploy, and integrate with DPU-based storage nodes. You will help drive integration efforts with existing and forward-looking datacenter control plane software. You will be involved in all phases of the software lifecycle: design, implementation, test, deployment, and support. This is a great opportunity to work on exciting new technology, grow your career, and sharpen your technical skills.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesCollaborates with appropriate stakeholders to determine user requirements for a scenario.Drives identification of dependencies and the development of design documents for a product, application, service, or platform.Creates, implements, optimizes, debugs, refactors, and reuses code to establish and improve performance and maintainability, effectiveness, and return on investment (ROI).Leverages subject-matter expertise of product features and partners with appropriate stakeholders (e.g., project managers) to drive a workgroup's project plans, release plans, and work items.Proactively seeks new knowledge and adapts to new trends, technical solutions, and patterns that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.Acts as a Designated Responsible Individual (DRI) and guides other engineers by developing and following the playbook, working on call to monitor system/product/service for degradation, downtime, or interruptions, alerting stakeholders about status and initiates actions to restore system/product/service for simple and complex problems when appropriate.QualificationsRequired Qualifications:Bachelor's Degree in Computer Science, or related technical discipline AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Other RequirementsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.Preferred QualificationsMaster's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. #AzurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Java",
        "Azure",
        "Python",
        "JavaScript"
      ],
      "salary": "",
      "job_type": "",
      "experience_level": "Senior"
    },
    {
      "title": "Javascript Developer - Remote Work",
      "company": "BairesDev",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/javascript-developer-remote-work-at-bairesdev-4314080544?position=6&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=5tAGMjHFR2E%2BexcCLo2PvQ%3D%3D",
      "post_date": "2025-10-13",
      "scraped_at": "2025-10-20T18:35:25.483967",
      "source": "public_api",
      "description": "At BairesDev®, we've been leading the way in technology projects for over 15 years. We deliver cutting-edge solutions to giants like Google and the most innovative startups in Silicon Valley.Our diverse 4,000+ team, composed of the world's Top 1% of tech talent, works remotely on roles that drive significant impact worldwide.When you apply for this position, you're taking the first step in a process that goes beyond the ordinary. We aim to align your passions and skills with our vacancies, setting you on a path to exceptional career development and success.Javascript Developer at BairesDevWe are looking for a Javascript Developer to join our team and be responsible for the programming and development of applications and software. You will be working on our browser Tag technology's front lines that power measurement and real-time data acquisition.What You Will Do:- Design and develop new front-end applications for various platforms.- Develop new user-facing features.- Perform code analysis, requirements analysis, system risk analysis, and software reliability analysis- Be in charge of tuning, improvement, balancing, usability, and automation- Optimize applications for maximum speed and scalability.- Develop and maintain specifications and designs for complex applications.Here’s what we are looking for:- 5+ years of experience with multiple JavaScript-based technologies.- Familiarity with front-end build tools.- Knowledge of Container Tags, the HTTP protocol, Cookies, request patterns, and library-free JavaScript development. - Experience with a responsive design for desktop/mobile.- Advanced English level.How we do make your work (and your life) easier:- 100% remote work (from anywhere).- Excellent compensation in USD or your local currency if preferred- Hardware and software setup for you to work from home.- Flexible hours: create your own schedule.- Paid parental leaves, vacations, and national holidays.- Innovative and multicultural work environment: collaborate and learn from the global Top 1% of talent.- Supportive environment with mentorship, promotions, skill development, and diverse growth opportunities.Apply now and become part of a global team where your unique talents can truly thrive!\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "JavaScript",
        "Javascript"
      ],
      "salary": "₹300,000.00\n            -\n            ₹700,000.00",
      "job_type": "Remote",
      "experience_level": "Mid Level"
    },
    {
      "title": "Software Engineer",
      "company": "Encardio Rite",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-encardio-rite-4300708794?position=7&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=LnexSVmzc8%2BQradhENYiww%3D%3D",
      "post_date": "2025-09-15",
      "scraped_at": "2025-10-20T18:35:25.485973",
      "source": "public_api",
      "description": "Key Responsibilities Design, develop, and maintain web applications using HTML, CSS, JavaScript, PHP, Laravel,and React JS. Build and optimize database structures using MySQL or other alternative databases likePostgreSQL and SQLite. Develop robust desktop applications using C/C++, Python, and the .NET framework. Collaborate with cross-functional teams to integrate software solutions with IoT devices andcloud platforms. Create responsive user interfaces using Tailwind CSS or similar CSS frameworks for aseamless user experience. Debug, troubleshoot, and resolve issues with applications, databases, and communicationprotocols such as HTTP, TCP/IP, FTP, and MQTT. Implement Agile and Scrum methodologies to ensure iterative and collaborative development. Write and maintain comprehensive documentation, including technical specifications, releasenotes, and system architecture.Key Deliverables Develop a scalable IoT Cloud Platform that integrates seamlessly with IoT devices and mobileapplications. Deliver a fully functional Desktop App linked to existing platforms within specified timelines. Ensure 95% uptime for cloud-based applications by proactively managing and resolvingperformance issues. Build and deliver APIs and middleware to facilitate data exchange between systems with100% accuracy. Maintain a bug resolution rate of 90% within the sprint cycle.QualificationsDegree/ P.G. in Computer Science, Data Science, Electronics, and Electrical etc.Technical Skills Expertise in HTML, CSS, JavaScript, PHP, Laravel, and React JS. Strong database management experience with MySQL and alternatives like PostgreSQL andSQLite. Proficiency in C/C++, Python, and .NET framework for desktop and backend development. Hands-on experience with Tailwind CSS or equivalent frameworks for UI development. Familiarity with generative AI tools like Claude AI, ChatGPT, and Google Gemini. Experience with web communication protocols (HTTP, TCP/IP, FTP, MQTT) and device-levelprotocols (UART, USB, MODBUS, Bluetooth, Ethernet). Proficient with tools like VS Code, FileZilla, Postman, Figma, cURL, GIT, and Jira. Knowledge of cloud deployment on AWS or Azure. Deep understanding of OOP concepts and problem-solving capabilities. Experience with Agile methodologies and tools for team collaboration and projectmanagement.Soft Skills Strong problem-solving and analytical thinking. Excellent communication and teamwork skills. Ability to manage time effectively and prioritize tasks. Flexibility and adaptability to work on multiple technologies and projects. Proactive learning and staying updated with emerging trends in software development.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Python",
        "AWS",
        "JavaScript",
        "PostgreSQL",
        "Azure",
        "MySQL",
        "React",
        "PHP"
      ],
      "salary": "₹100,000.00\n            -\n            ₹400,000.00",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Python Developer",
      "company": "ARDEM Incorporated",
      "location": "Kakori, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/python-developer-at-ardem-incorporated-4218882129?position=8&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=DjJcxeo8u1Hc15Ikw8SNRw%3D%3D",
      "post_date": "2025-04-30",
      "scraped_at": "2025-10-20T18:35:25.485973",
      "source": "public_api",
      "description": "REMOTEPython DeveloperARDEM Data Services Private LimitedUNIT No B-1/ 5th Floor 504 & 505 DLF MY PAD, Vibhuti Khand Gomti Nagar, Lucknow – 226010, IndiaTelephone: 915.130.3150Email: Recruitment_ARDEMDataServices@ardem.comLocation: IndiaType: RemoteFull-TimeSchedule: Monday to FridayShift: 6:00 PM to 3:00 AMShare This JobShareShare Share ShareWe are looking for an enthusiastic and skilled Python Developer with a passion for AI-based application development to join our growing technology team. This position offers the opportunity to work at the intersection of software engineering and data analytics, contributing to innovative AI-driven solutions that drive business impact. If you have a strong foundation in Python, a flair for problem-solving, and an eagerness to build intelligent systems, we would love to meet you!Key ResponsibilitiesDevelop and deploy AI-focused applications using Python and associated frameworks.Collaborate with Developers, Product Owners, and Business Analysts to design and implement machine learning pipelines.Create interactive dashboards and data visualizations for actionable insights.Automate data collection, transformation, and processing tasks.Utilize SQL for data extraction, manipulation, and database management.Apply statistical methods and algorithms to derive insights from large datasets.Required Skills And Qualifications2–3 years of experience as a Python Developer, with a strong portfolio of relevant projects.Bachelor’s degree in Computer Science, Data Science, or a related technical field.In-depth knowledge of Python, including frameworks and libraries such as NumPy, Pandas, SciPy, and PyTorch.Proficiency in front-end technologies like HTML, CSS, and JavaScript.Familiarity with SQL and NoSQL databases and their best practices.Excellent communication and team-building skills.Strong problem-solving abilities with a focus on innovation and self-learning.Knowledge of cloud platforms such as AWS is a plus.Technical RequirementsLaptop or Desktop: Windows (i5 or higher, 8GB RAM minimum)Screen: 14 inches, Full HD (1920×1080)Internet Speed: 100 Mbps or higherAbout ARDEMARDEM is a leading Business Process Outsourcing and Business Process Automation service provider. For over twenty years, ARDEM has successfully delivered business process outsourcing and business process automation services to our clients in the USA and Canada. We are growing rapidly. We are constantly innovating to become a better service provider for our customers. We continuously strive for excellence to become the Best Business Process Outsourcing and Business Process Automation company.NOTE!ARDEM will never ask for any personal information or banking information during the hiring process for any data entry/processing type of work. If you are contacted by any party claiming to represent ARDEM Incorporated offering work from home jobs – this is fraud. Please disregard and refer to ARDEM’s Careers page for all open job positions. We apologize for any inconvenience caused by such acts.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "PyTorch",
        "Python",
        "AWS",
        "JavaScript",
        "SQL"
      ],
      "salary": "₹360,000.00\n            -\n            ₹540,000.00",
      "job_type": "",
      "experience_level": "Mid Level"
    },
    {
      "title": "Full Stack Web Developer",
      "company": "St Trinity Property Group",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-web-developer-at-st-trinity-property-group-4306360170?position=9&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=WdJ1JVDDA4DQepjZQHR9jQ%3D%3D",
      "post_date": "2025-09-29",
      "scraped_at": "2025-10-20T18:35:25.485973",
      "source": "public_api",
      "description": "Are you a talented Full Stack Web Developer eager to join a fast-growing and leading technology e-commerce retailer? We are looking for a reliable self-starter with a strong focus on Javascript and PHP to develop and maintain software that drives a high-volume web store, interfacing with various systems and a wide range of integrated technologies. As a Full Stack Web Developer, you will be responsible for owning and maintaining features deployed across our Website stack, as well as implementing new features that accelerate the desired direction of the business. You will work in a cross-functional team with touchpoints from customer-facing web front-ends to setting up the backend systems. The ideal candidate will have strong debugging and troubleshooting skills, and experience working with various data sources, API integrations, and middleware. Additionally, they will have solid experience with the modern Javascript ecosystem, AWS and Digital Ocean knowledge, and a deep understanding of Relational Databases. Responsibilities: Build and Maintain features deployed across our web stack - WordPress, Shopify, PHP, Go High Level  Implement new features that accelerate the desired direction of the business  Design solutions that work efficiently with currently deployed systems  Keep the customer experience at the forefront when designing and implementing solutions  Work in a cross-functional team with touchpoints from customer-facing web front-ends to setting up the backend system  Maturing/refactoring currently active codebases and bringing them in line with industry-standard style, practice, and guidelines  Qualifications: Comfortable using various programming languages, relational databases  Strong debugging and troubleshooting skills  Strong written and verbal communication skills  Experience working with various data sources, API integrations, and middleware Requirements Strong full-stack development skills  Deep understanding of Relational Databases  Demonstrable experience with the modern JavaScript ecosystem – ES6, React/JSX, Angular, Vue, or similar, Nodejs, NPM/Yarn  Back-end/server-side JavaScript (Lambda/SAM, Serverless framework, Express APIs, etc)  AWS knowledge - SQS, EC2, Lambda, RDS, CloudFormation  Unix-based OS skills – OS maintenance, system upkeep, system configuration  Understanding of security principles and active design guidelines against potential threats  Ability to debug issues that manifest, from the customer level to the back-office  Solid understanding of standard data formats and serialisation, data schemas, and maintaining data integrity  Managing codebases using version control (Git), working with automated deployments and pipelines (continuous integration/delivery) Strongly Desired Experience: Working Cloudflare knowledge  Experience with E-commerce systems (Magento, Shopify, etc)  Experience working in an Agile environment: Kanban, Scrum, or similar frameworks  Ideal candidates will also have:   Java/JSP and related web application experience  Retail/POS experience  Microsoft 365 knowledge  Google Workspace knowledge  BenefitsIf you are passionate about Javascript, and PHP and have experience working with various programming languages, relational databases, and API integrations, we would love to hear from you. This is an exciting opportunity to join a growing team and effect change, adding real value to the evolving E-commerce stack.\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "AWS",
        "JavaScript",
        "Go",
        "Javascript",
        "Angular",
        "Java",
        "React",
        "PHP"
      ],
      "salary": "₹120,000.00\n            -\n            ₹360,000.00",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "ROP- SWE-2 and SSE",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/rop-swe-2-and-sse-at-microsoft-4304996013?position=10&pageNum=1&refId=6GRbZJvl73UM8eBr6hbg8g%3D%3D&trackingId=Cvdpsi2lSF2At%2FGomVMI6Q%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T18:35:25.487981",
      "source": "public_api",
      "description": "Do you want to contribute to Microsoft's vision of empowering every person and organization to achieve more, with the power of cloud computing? Are you eager to work at the forefront of Cloud Computing, Artificial Intelligence, and the broad spectrum of advanced technologies that drive modern cloud infrastructure and services?  Join the Azure Specialized team in India, where you can make a real difference by designing, delivering, and operating cloud-scale systems. We are responsible for building and offering specialized workloads, bare-metal and software capabilities on Azure, involving large-scale specialized solutions like VMWare, SAP, Oracle, Epic Healthcare systems, AI Infrastructure, and more. We are looking for customer-focused and passionate engineers from diverse computer science fields, like hardware, operating systems, networking, security, distributed design, and enterprise solutions, with focus on quality and sustainability.Your ability to be the customer advocate, focus on service first, and part of a team that tears down silos to deliver the best customer experience will be critical for team’s and your success. Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesCollaborate with internal business units and stakeholders to understand the requirements for efficient and effective delivery.Handle project features from design, implementation, to deployment.Independently develop a product, service or feature, taking code reusability, quality and security into consideration.Participate in breaking down requirements into smaller work items, to bring clarity and provide development and testing estimation.Make software services secure, reliable, highly available and fault resilient.Introduce automation for repetitive tasks to reduce implementation time and avoid failure due to human error.Take the helm in ensuring seamless service operations by addressing real-time challenges as they emerge, empowering you to directly enhance service reliability and customer satisfaction.Collaborate with other engineers, teams, partners and project managers to deliver mission critical workloads in a fast-paced environment, while ensuring value-to-customers and live-site excellence.Lead, mentor, and guide engineers in the team, bringing clarity, creating energy, and driving results.QualificationsRequired Qualifications:Bachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.2+ years of professional experience in designing, developing, and shipping software.1+ years hands-on experience with distributed systems and services in the cloud.1+ years experience/knowledge of cloud computing, enterprise computing, IaaS, and/or SaaS products.Other RequirementsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.Preferred QualificationsBachelor's Degree in Computer ScienceOR related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR PythonOR Master's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.Proven ability to solve complex technical issues for running online services.Excellent written and oral communication skills.Note : By applying to this role you will be assessed for multiple other roles which requires similar skills.#azurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n        \n            Show more\n          \n\n          \n\n\n\n        \n            Show less",
      "skills": [
        "Java",
        "Azure",
        "JavaScript"
      ],
      "salary": "₹120,000.00\n            -\n            ₹360,000.00",
      "job_type": "",
      "experience_level": "Lead"
    },
    {
      "title": "Application Developer-Java & Web Technologies",
      "company": "IBM",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/application-developer-java-web-technologies-at-ibm-4307581109?position=1&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=g8iu%2FpFxVh7KYNlfHM3NRQ%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:35:33.663976",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Senior Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/senior-software-engineer-at-microsoft-4279655478?position=2&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=Tc%2BROCa16eJMafiGSk65IQ%3D%3D",
      "post_date": "2025-10-08",
      "scraped_at": "2025-10-20T18:35:33.663976",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Application Developer-Java & Web Technologies",
      "company": "IBM",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/application-developer-java-web-technologies-at-ibm-4307571923?position=3&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=xmTyZtVktSNOdfZR0ndG0A%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:35:33.663976",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Software Developer - JAVA",
      "company": "CompuGroup Medical SE & Co. KGaA",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-developer-java-at-compugroup-medical-se-co-kgaa-4294888326?position=4&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=gwZ7E3qHx0FN4j%2FGe7Z%2B8A%3D%3D",
      "post_date": "2025-09-30",
      "scraped_at": "2025-10-20T18:35:33.665984",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "React.js Developer",
      "company": "Jithvar Consultancy Services",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/react-js-developer-at-jithvar-consultancy-services-4306112552?position=5&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=WHACceKsU2zvc4v9wGtoBg%3D%3D",
      "post_date": "2025-09-30",
      "scraped_at": "2025-10-20T18:35:33.667992",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "PHP Developer_Lucknow",
      "company": "Webkul",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/php-developer-lucknow-at-webkul-4293610832?position=6&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=c%2FDAelbcy%2FXI%2BTp0QfBVQg%3D%3D",
      "post_date": "2025-09-03",
      "scraped_at": "2025-10-20T18:35:33.667992",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Senior Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/senior-software-engineer-at-microsoft-4315138463?position=7&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=11uHS9GI4hhFveeF46exdA%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T18:35:33.670001",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Senior Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/senior-software-engineer-at-microsoft-4308075902?position=8&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=EmNHx4vLZSET7GP7vGuz2A%3D%3D",
      "post_date": "2025-09-29",
      "scraped_at": "2025-10-20T18:35:33.670001",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Full Stack Developer",
      "company": "Digital Prospects Consulting",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-developer-at-digital-prospects-consulting-4296228540?position=9&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=aWlqWGNl3B1965liHJ6Pew%3D%3D",
      "post_date": "2025-09-09",
      "scraped_at": "2025-10-20T18:35:33.670001",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Software Engineer (Full Stack) - 17853",
      "company": "Turing",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-full-stack-17853-at-turing-4315327332?position=10&pageNum=2&refId=qffJK7Nzz2uq5frJUqbJOw%3D%3D&trackingId=GE3j5nIdxR%2F8Ar%2F2etYDfw%3D%3D",
      "post_date": "2025-10-15",
      "scraped_at": "2025-10-20T18:35:33.672012",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Full-Stack Developer - 20414",
      "company": "Turing",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-developer-20414-at-turing-4313054950?position=1&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=GP7yBFzssZN9HlUJhC7atw%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:35:41.565193",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "PHP Developer",
      "company": "Webkul",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/php-developer-at-webkul-4258470251?position=2&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=5qR%2BpesCeWw4tIDW%2FvJM%2Fg%3D%3D",
      "post_date": "2025-06-27",
      "scraped_at": "2025-10-20T18:35:41.565193",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Software Developer (JavaScript / TypeScript) - 20414",
      "company": "Turing",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-developer-javascript-typescript-20414-at-turing-4315871270?position=3&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=DqQ%2Fwh0pPqpRYAs5gzAX%2Fw%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:35:41.565193",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Principal Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/principal-software-engineer-at-microsoft-4275647613?position=4&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=%2BtERzDmPCXl4vpFqEKfjwQ%3D%3D",
      "post_date": "2025-10-02",
      "scraped_at": "2025-10-20T18:35:41.567201",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Full stack Developer-PHP",
      "company": "Webkul",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-developer-php-at-webkul-4293607918?position=5&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=B6NKje3y56bNUnqWwP90ig%3D%3D",
      "post_date": "2025-09-03",
      "scraped_at": "2025-10-20T18:35:41.567201",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "PHP(Laravel)",
      "company": "Jamtech Technologies Pvt. Ltd.",
      "location": "Kakori, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/php-laravel-at-jamtech-technologies-pvt-ltd-4215093231?position=6&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=UCmsL1XWnBikZVtKE2NqFQ%3D%3D",
      "post_date": "2025-04-23",
      "scraped_at": "2025-10-20T18:35:41.567201",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Full-Stack Developer - 20414",
      "company": "Turing",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-developer-20414-at-turing-4313060670?position=7&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=f9HLGAQihedkbqw%2FNHSOrQ%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:35:41.569213",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Software Developer (JavaScript / TypeScript) - 20414",
      "company": "Turing",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-developer-javascript-typescript-20414-at-turing-4315869522?position=8&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=B3UGT4ENV5QPeDFqGVpHDQ%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:35:41.569213",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Software Developer (JavaScript / TypeScript) - 20414",
      "company": "Turing",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/software-developer-javascript-typescript-20414-at-turing-4315864837?position=9&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=iVfMZ4a4HelyG5RgOLpHBA%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:35:41.569213",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Full Stack Developer Trainer(Part Time)",
      "company": "42Peaks",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-developer-trainer-part-time-at-42peaks-4146318634?position=10&pageNum=3&refId=FU6Im35V65PmmRGqNrd%2Bvg%3D%3D&trackingId=BGyngrvrXfD1QuWoHmC%2BYA%3D%3D",
      "post_date": "2025-02-10",
      "scraped_at": "2025-10-20T18:35:41.571223",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Full Stack Developer Trainer(Full Time)",
      "company": "42Peaks",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-developer-trainer-full-time-at-42peaks-4173663009?position=1&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=kMwu0e6viO3uIJkbEi3L2A%3D%3D",
      "post_date": "2025-03-04",
      "scraped_at": "2025-10-20T18:35:49.505904",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Full-Stack Engineer (JavaScript/Typescript) - 20414",
      "company": "Turing",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-engineer-javascript-typescript-20414-at-turing-4313079014?position=2&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=W4rmxdfNE%2BXm1GwZobkOkA%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:35:49.508056",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Semi Senior Python Developer - Remote Work",
      "company": "BairesDev",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/semi-senior-python-developer-remote-work-at-bairesdev-4314202234?position=3&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=wFPzciKFG8pOceIkw%2F1Tzg%3D%3D",
      "post_date": "2025-10-14",
      "scraped_at": "2025-10-20T18:35:49.508056",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "SDE2",
      "company": "Amazon",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/sde2-at-amazon-4294612137?position=4&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=IT%2BTe%2F7sTo3%2BQn6HlTcODg%3D%3D",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-20T18:35:49.508056",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "PHP Developer",
      "company": "Gencosys",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/php-developer-at-gencosys-4269618833?position=5&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=z0Jkul6IiQ9HO4l%2F9jswLg%3D%3D",
      "post_date": "2025-07-24",
      "scraped_at": "2025-10-20T18:35:49.510066",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Fullstack Developer (Middle)",
      "company": "Golden Gate Restaurant Group",
      "location": "Malihabad, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/fullstack-developer-middle-at-golden-gate-restaurant-group-4286652669?position=6&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=TUTzsSgSFItP6dmFrMq0Tg%3D%3D",
      "post_date": "2025-08-15",
      "scraped_at": "2025-10-20T18:35:49.511079",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Staff Software Engineer - Front End (Gurugram Based)",
      "company": "Agoda",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/staff-software-engineer-front-end-gurugram-based-at-agoda-4312995476?position=7&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=dXfchXueurcXifbx6URaIw%3D%3D",
      "post_date": "2025-10-10",
      "scraped_at": "2025-10-20T18:35:49.511079",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Full Stack Developer",
      "company": "Trivial Works Solutions Private Limited",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/full-stack-developer-at-trivial-works-solutions-private-limited-4306111802?position=8&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=NGOD5H25CxFwaWIULfYMmg%3D%3D",
      "post_date": "2025-09-30",
      "scraped_at": "2025-10-20T18:35:49.511079",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Staff Software Engineer - Back End (Gurugram based)",
      "company": "Agoda",
      "location": "Lucknow, Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/staff-software-engineer-back-end-gurugram-based-at-agoda-4299758975?position=9&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=Zv3s1PD0S2i7kZbojOQDBQ%3D%3D",
      "post_date": "2025-10-03",
      "scraped_at": "2025-10-20T18:35:49.511079",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    },
    {
      "title": "Principal Software Engineer",
      "company": "Microsoft",
      "location": "Uttar Pradesh, India",
      "url": "https://in.linkedin.com/jobs/view/principal-software-engineer-at-microsoft-4308177436?position=10&pageNum=4&refId=DosxzUeskEt8I3xPpwoDyQ%3D%3D&trackingId=L6YVuOHxsRTe%2BiFq5TjSig%3D%3D",
      "post_date": "2025-09-30",
      "scraped_at": "2025-10-20T18:35:49.513088",
      "source": "public_api",
      "description": "",
      "skills": [],
      "salary": "",
      "job_type": "",
      "experience_level": ""
    }
  ],
  "metadata": {
    "scraped_at": "2025-10-20T18:38:53.453045",
    "total_jobs": 50
  }
}