{
  "jobs": [
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4316335244",
      "post_date": "2025-10-17",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "Microsoft Silicon, Cloud Hardware, and Infrastructure Engineering (SCHIE) is the team behind Microsoft’s expanding Cloud Infrastructure and responsible for powering Microsoft’s “Intelligent Cloud” mission. SCHIE delivers the core infrastructure and foundational technologies for Microsoft's over 200 online businesses including Bing, MSN, Office 365, Xbox Live, Teams, OneDrive, and the Microsoft Azure platform globally with our server and data center infrastructure, security and compliance, operations, globalization, and manageability solutions. Our focus is on smart growth, high efficiency, and delivering a trusted experience to customers and partners worldwide and we are looking for passionate, high-energy engineers to help achieve that mission.\nThe Azure Data Processing Unit (DPU) team brings together state-of-the-art software and hardware expertise to create a highly programmable and high-performance chip with the capability to efficiently handle large data volumes. Thanks to its integrated design, this solution empowers Azure to develop solutions for solving the next generation problems with increased agility and performance leveraging the DPU’s compute, storage, and networking capabilities.\nAs a Software Engineer in the DPU Networking software team, you will design, develop, deploy and support networking packet forwarding that enable high performant data processing within various network endpoints in Azure data centers. You will work as part of a dynamic, multi-talented team of engineers from across the world. This opportunity will allow you to develop new solutions for the Azure fleet, participate in the design of cutting-edge networking solutions and hone your design and performance optimization skills.\nAs Microsoft's cloud business continues to grow the ability to deploy new offerings and hardware infrastructure on time, in high volume with high quality and lowest cost is of paramount importance. To achieve this goal, the DPU Networking Software team is instrumental in defining and delivering operational measures of success for quality, delivery, scale and sustainability related to Microsoft cloud software. We are looking for engineers with a dedicated passion for customer focused solutions, insight and industry knowledge to envision and implement future technical solutions that will manage and optimize the Cloud infrastructure.\n#azurehwjobs\nResponsibilities\nCollaborates with appropriate stakeholders to determine user requirements for a scenario. \nDrives identification of dependencies and the development of design documents for a product, application, service, or platform. \nCreates, implements, optimizes, debugs, refactors, and reuses code to establish and improve performance and maintainability, effectiveness, and return on investment (ROI). \nActs as a Designated Responsible Individual (DRI), working on call to monitor system/product/service for degradation, downtime, or interruptions, alerting stakeholders about status and initiates actions to restore system/product/service for simple and complex problems when appropriate. \nProactively seeks new knowledge and adapts to new trends, technical solutions, and patterns that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale. \nQualifications\nRequired\nExperience in software design and coding of Layer2/L3/L4 ethernet/IP networking packet forwarding functions. \nMinimum 2 years of programming experience in C or C++ \nBachelor's degree in computer science or computer engineering, or related technical discipline AND 2+ years software development engineering experience \n OR equivalent experience. \nPreferred\nExperience in developing packet forwarding features within SDN - Software Defined Networking – data path \nCI/CD Experience: Knowledge of Continuous Integration and Continuous Deployment (CI/CD) practices for streamlined software development and deployment processes. \nScripting for Developer Tools: Proficiency in scripting languages to build and enhance developer tools, automating repetitive tasks and improving workflow efficiency. \nOther\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter.\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [
          "Azure",
          "Microsoft Azure"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4315834806",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "The Microsoft 365 Copilot Mobile team in India is looking for a passionate and talented Software Engineer to build the next generation of AI-powered mobile experiences for iOS.\nThe M365 Copilot App team is redefining productivity on mobile by delivering Copilot-powered experiences that combine the richness of Word, Excel, and PowerPoint with mobile-first design. Our mission is to enable seamless creation, consumption, and collaboration on the go.\nWith 100M+ monthly active users and growing daily engagement, we’re building an app that is truly centered around the user, scaling across multiple digital identities to keep them productive anytime, anywhere. Achieving this requires faster experimentation, solid quality of experience, and coherence across platforms.\nSearch and innovation is at the heart of this mission. We’re building intelligent, AI-driven search experiences that help users find what they need—documents, chats, emails, and more—quickly and effortlessly. Our goal is to make search context-aware, personalized, and lightning fast, leveraging the power of large language models and Microsoft Graph.\nWe thrive on a fast-paced ideate → create → learn cycle and measure success through tangible value delivered to our customers. As we scale to the next level of growth, we’re looking for passionate, purposeful, and resilient engineers who embrace learning and bring a “can-do” attitude to solving complex challenges.\nThe ideal \nSoftware Engineer\n will have a blend of technical chops in native (C/C++) language and good experience in Android and iOS development. Having a background or early exposure to experimentation and data science is a plus. If you don’t have that background, you will have the opportunity to immerse yourself in data driven engineering practice.\nAs we scale to the next level of growth, we’re looking for highly motivated, self-starter engineers who thrive in a bottoms-up, fast-paced, highly technical environment, have a solid customer focus, and understand the importance of quality. If you’re passionate about building first-class productivity experiences, this is the place for you.\n Why Join Us? \nImpact at Scale: Build features that empower millions of users globally. \nWork on Cutting-Edge Tech: AI-first, mobile-first experiences across iOS and Android. \nLead and Grow: Take ownership of features and lead small crews while learning from world-class engineers. \nInclusive Culture: Collaborate in an environment that values innovation, diversity, and continuous learning. \nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.   \nResponsibilities\nDesign and implement end-to-end search experiences in the Copilot app, spanning query formulations with various treatments, ranking, and UX.\nBuild high-performance, scalable search components optimized for mobile platforms.\nCollaborate across disciplines—partner with PMs, designers, and AI experts to deliver context-aware, personalized search.\nDesign and implement end to end experiences on mobile spanning core data model, processing, and UX along with service integrations.\nEngineer features with solid attention to performance, robustness, and resource usage.\nWork independently and collaboratively within and across product teams.\nQualifications\nRequired Qualifications:\nBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR equivalent experience.\nGrowth mindset and eagerness to learn new technologies.\nFrameworks & SDK: Solid experience with iOS SDK, SwiftUI, UIKit, Core Data, and Combine.\nPerformance Optimization: Understanding of memory management, ARC, and performance tuning; experience with Instruments for profiling.\nTesting: Familiarity with XCTest for unit testing and XCUITest for UI automation.\nAPIs & Data Handling: Experience with RESTful APIs, JSON, and optionally GraphQL.\nDeployment: Knowledge of App Store publishing, TestFlight, and app signing processes.\nPreferred Qualifications\nMaster's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\nOR Bachelor's Degree in Computer Science or related technical field AND 1 to 3 years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python \nOR equivalent experience.\n1–3 years of experience in mobile development (internships count!).\nFamiliarity with data-driven engineering or experimentation (bonus).\nInterpersonal skills \nA sense of personal ownership is required, together with the ability to deliver timely and high quality while managing internal stakeholder expectations.\nSelf-motivated and organized to deliver results. \nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        \n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [
          "Java",
          "Python",
          "JavaScript",
          "go"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Data Engineer (all genders)",
      "company": "HRS Group",
      "location": "Sahibzada Ajit Singh Nagar, Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/data-engineer-all-genders-at-hrs-group-4315821899",
      "post_date": "2025-10-16",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "Hrs As a Company\nHRS, a pioneer in business travel, aims to elevate every stay through innovative technology. With over 50 years of experience, their digital platform, driven by ProcureTech, TravelTech, and FinTech, transforms how companies and travelers Stay, Work, and Pay.\nProcureTech digitally revolutionizes lodging procurement, connecting corporations and suppliers in a cutting-edge ecosystem. This enables seamless efficiency and automation, surpassing travelers' expectations.\nTravelTech redefines the online lodging experience, offering personalized content from selection to check-in, ensuring an unparalleled journey for corporate travelers.\nIn FinTech, HRS introduces advancements like mobile banking and digital payments, turning corporate back offices into touchless lodging enablers, eliminating legacy cost barriers. The innovative 2-click book-to-pay feature streamlines interactions for travelers and hoteliers.\nCombining these technology propositions, HRS unlocks exponential catalyst effects. Their data-driven focus delivers value-added services and high-return network effects, creating substantial customer value.\nHRS's exponential growth since 1972 serves over 35% of the global Fortune 500 and leading hotel chains.\nJoin HRS to shape the future of business travel, empowered by a culture of growth and setting new industry standards worldwide.\nBUSINESS UNIT\nThe HRS Business Travel Club (BTC) is the Business Unit managing and developing the HRS E-Commerce platforms of the well-known hotel portal businesses of HRS.de and HOTEL.DE that gradually transform into much more than “just” a platform. BTC provides its members, individual business travelers and SMEs, with a distinct range of exclusive services, which shape tomorrow´s upgraded travel experience. The goal of BTC is to deliver growth as well as sustainable profitability over time by enhancing customer loyalty between the brand and its customers, enabling the Brands Repositioning in the marketplace and unlocking additional potentials via optimized supplier management. Thus, BTC and its products, plays an important role in HRS´s DACH strategy as it revolves around a disruption of the interplay between hotel and workplace supply and e-commerce and a domination of the Business Travel DACH market. Your mission is to further develop and shape the \"The HRS Business Travel Club\" and its solutions and make it the next innovation of the HRS Group together within a great team!\nPOSITION\nWe are looking for a Chandigarh/Mohali based GCP Data Engineer who helps building a next-generation Customer Data Platform enabling our customers to find their perfect hotel for every trip, and helping our hotel partners growing their business.\nCHALLENGE\nWork on understanding, challenging, implementing and documenting requirements towards the Customer Data Platform (CDP) within HRS Group together with business and steering teams from sales & marketing, as well as management ensuring continued development of the CDP to serve HRS Group’s strategic vision.\nDesign technical- and analytical solutions, ensure implementation and leverage state-of-the-art cloud technologies for data engineering and data science.\nEnsuring stability of load jobs in existing cloud infrastructure (within GCP) including running GDPR framework set ups.\nCollaborate with data engineers and data scientists across HRS Group to establish best-practices, exchange on latest trends and stay abreast of your area of responsibility.\nFOR THIS EXCITING MISSION YOU ARE EQUIPPED WITH...\n A degree in business computer science, mathematics or a comparable qualification.\n Minimum 3 years of Proven hands-on experience in data engineering or data science.\n Superior expertise in Python, SQL and GCP toolset (Cloud Functions, Cloud Run, BigQuery, etc.).\n General knowledge of cloud technologies such as AWS, GCP, Azure etc.\n Sound project campaign management capabilities, and commercial awareness.\n Ideally, experience with analytical CRM, CDPs, Marketing Automation, or integrated Sales & Marketing setups.\n Fluent in English.\nPERSPECTIVE\nAccess to a global network of a globally united and mutually responsible “Tribe of Intrapreneurs” that is passionately dedicated to renewing the travel industry and while doing so reinventing the ways how businesses stay, work and pay. Our entrepreneurial-driven environment of full ownership and execution focus offers you the playground to contribute to a greater mission while growing personally and professionally throughout this unique journey. You will continuously learn from a radical culture of retrospectives and continuous improvement and actively contribute to making business life better, smarter, and more sustainable.\nLOCATION, MOBILITY, INCENTIVE\nThe attractive remuneration is in line with the market and, in addition to a fixed monthly salary, all necessary work equipment and mobility, will also include an annual or multi-year bonus.\n        \n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "Azure",
          "AWS",
          "Python",
          "GCP"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Data Engineer",
      "company": "EXO Edge",
      "location": "Sahibzada Ajit Singh Nagar, Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/data-engineer-at-exo-edge-3956025903",
      "post_date": "2024-06-21",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "EXO Edge is looking for experienced Data Engineer to join our Data Analytics team. As a Data Engineer, you will design, develop, evaluate, and test data infrastructures. Source system analysis, data modeling, business measure development, and report/visualization formatting. Ensure compliance with policies and procedures, safety, state, and federal laws, regulations, and standards.\nIn your journey as a Data Engineer at EXO Edge, you will be:\nPrimarily Focused On\nConsolidating separate data and reporting suites\nEnsuring business users are enabled with carefully curated data visualizations with accurate, reliable, and consistent data to monitor contract performance and assist in decision making\nDetermining reporting needs, developing and building reports, training users and establishing reporting cadences and processes.\nFulfilling The Below Roles And Responsibilities\nTranslate logical designs into physical designs, taking account of business requirements, target environments, processes, performance requirements, existing systems and services, and any potential safety-related aspects\nAnalyze and organize rawdata.\nBuild data systems andpipelines.\nEvaluate business needs andobjectives.\nInterpret trends andpatterns.\nConduct complex data analysis and report onresults.\nPrepare data for prescriptive and predictivemodeling.\nBuild algorithms andprototypes.\nCombine raw information from differentsources.\nExplore ways to enhance data quality andreliability.\nIdentify opportunities for dataacquisition.\nDevelop analytical tools andprograms.\nCollaborate with data scientists and architects on multiple projects and technologies.\nBringing In The Below Technical Experience\n5+ years of hands-on experience in MS SQL Server writing complex T-SQL queries, stored procedures, functions etc.\n5+ years of ETL development using Azure Data Factory (experience with SSIS a plus)\n5+ years of experience with building data pipelines and analytics solution to stream and process datasets at low latencies.\n5+ years of experience with complex data modelling, ELT/ETL design, and using large databases in a business environment. Experience ingesting data from various source formats viz. Parquet, csv, SQL databases, SharePoint, APIs etc. to Azure SQL databases.\n3+ years of experience with SSAS (SQL Analysis Services) Tabular and Multi-Dimensional cubes/models. Experience writing DAX expressions a plus.\nExpertise in ELT/ETL optimization, designing, coding, and tuning big data processes using Azure Data Factory.\nAdvanced experience in SQL Server relational database management systems\nExtensive understanding and knowledge in data analytics and reporting (TSQL, SSRS, Power BI, etc.)\nStrong Knowledge of data warehousing frameworks and methodologies.\nKnowledge of Data Engineering and Data Operational Excellence using standard methodologies.\nKnowledge experience with CI/CD processes.\nKnowledge experience with Azure DevOps.\nKnowledge of QA tools (manual and automated)\nExperience in data mining, profiling, and analysis\nExperience with usage of source control within a team environment (Git, TFS etc.)\nA strong understanding of database design best practices\nExperience with Azure – setting up and monitoring databases, users access rights.\nExperience with Yardi system is a big plus.\nBased At\nMohali, Punjab\n\n\n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "Power BI",
          "Azure"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Data Engineer",
      "company": "Grazitti Interactive",
      "location": "Sahibzada Ajit Singh Nagar, Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/data-engineer-at-grazitti-interactive-4266777611",
      "post_date": "2025-07-15",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "Job Description\nWe’re looking for a skilled and experienced Data Engineer with 5–7 years of experience, including 3–4 years leading data engineering teams on Google Cloud Platform (GCP). The ideal candidate should have worked in premium consulting environments, led cloud migration projects, and possess strong communication skills to collaborate effectively with technical and business stakeholders.\nThis role is with our flagship product, SearchUnify, a recognized leader in AI-powered customer support and enterprise search.\nKey Skills\n3–4 years of experience leading Data Engineering teams developing enterprise-grade pipelines on Google Cloud.\nHands-on expertise in GCP services like BigQuery, Dataform, and Dataplex.\nProven track record in migrating ETL pipelines and data warehouses to the cloud.\n2–3 years of recent experience with premium consulting firms.\nProficiency in SQL and Python scripting.\nExperience designing secure, scalable ETL/ELT pipelines.\nStrong understanding of data modeling and working with fact/dimension tables.\nKnowledge of reporting tools such as Looker, Tableau, or Power BI.\nAbility to translate GCP knowledge across AWS or Azure environments.\nExcellent communication and stakeholder management skills.\nFamiliarity with customer support or self-service analytics.\nExperience working with sales and marketing data domains.\nExposure to AI-driven platforms and large language models (LLMs).\nBackground in developing solutions for SaaS platforms.\nUnderstanding of data governance and cataloging best practices.\nExperience with cross-functional, geographically distributed teams.\nRoles & Responsibilities\nLead the architecture, design, and implementation of cloud-native data solutions using GCP.\nDesign and deliver high-performance data pipelines for SearchUnify’s cognitive platform.\nOwn data migration projects, ensuring secure and optimized delivery.\nCollaborate with engineering, AI/ML, and product teams to support evolving data needs.\nPrepare high-level and low-level design documentation.\nReview work by junior engineers and provide technical guidance.\nEnsure project milestones are met with quality and efficiency.\nDrive innovation and best practices in data engineering across the team.\n\n\n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "AWS",
          "Azure",
          "Power BI",
          "Python",
          "Looker",
          "Tableau",
          "Google Cloud Platform",
          "GCP"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "SQL Data Analyst",
      "company": "The Future University",
      "location": "Sahibzada Ajit Singh Nagar, Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/sql-data-analyst-at-the-future-university-4271583061",
      "post_date": "2025-07-24",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "About The Opportunity\nJoin a dynamic leader in the education sector that leverages advanced data analytics to drive institutional excellence. Operating in a technology-driven environment, this high-growth organization empowers its teams with a comprehensive data strategy. As a critical part of the on-site team based in India, you will help transform data into actionable insights that support strategic decision-making.\nRole & Responsibilities\nDevelop, optimize, and maintain complex SQL queries to support data extraction and reporting.\nAnalyze large datasets to identify trends, correlations, and actionable insights to drive business decisions.\nDesign and implement data models and warehousing solutions to improve reporting accuracy and performance.\nCollaborate with cross-functional teams to understand data requirements and translate business needs into technical solutions.\nCreate and maintain dashboards and visual reports to present insights to stakeholders.\nEnsure data integrity and implement best practices for data cleaning and transformation.\nSkills & Qualifications\nMust-Have: Proficiency in SQL with proven experience in writing efficient queries and managing large datasets.\nMust-Have: 1-3 years of hands-on experience in data analysis and developing data models in a high-paced environment.\nMust-Have: Strong analytical skills \nBenefits & Culture Highlights\nWork in a collaborative and innovative on-site environment with opportunities for professional growth.\nBe part of a mission-driven team that values data-driven insights and continuous learning.\nHealth Insurance\nProvident Fund\nIf you are a detail-oriented SQL Data Analyst ready to leverage your analytical expertise in a vibrant, on-site setting in India, we encourage you to apply and join our transformative team.\nSkills: data analysis,sql,data warehousing,analytical skills,reporting,data cleaning,data visualization,data modeling\n        \n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "sql"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Position title Data Engineer",
      "company": "Grazitti Interactive",
      "location": "Sahibzada Ajit Singh Nagar, Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/position-title-data-engineer-at-grazitti-interactive-4269932786",
      "post_date": "2025-07-19",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "Data Engineer\nLocation:\n Mohali, India\nPosted on:\n July 20, 2023\nDescription\nAs a Data Engineer, you will be responsible for collecting, managing, and converting raw data into information that can be interpreted by data scientists and business analysts. Data accessibility is your ultimate goal, which is to enable organizations to utilize data for performance evaluation and optimization.\nAt Grazitti, we are actively seeking a Data Engineer, with 4 years of experience combining data from different sources and strong coding skills in Python or PySpark. Besides, the ideal candidate should be familiar with Spark, Big Data technologies, ETL, SQL/NoSQL DB, Linux/Unix, and Streaming technologies like Kafka or Kinesis, Apache Airflow, Data Modelling, and Persistence Optimization.\nSkills\n \nKey Skills\nProficiency in Amazon AWS or Microsoft Azure.\nHands-on experience with Apache Airflow for workflow management.\nSound understanding of Data Modeling & Persistence Optimization.\nExperience with analytics platforms such as Tableau, POWER BI, AWS, GCP, etc.\nWorking experience with Marketing & Sales data.\nStrong analytical skills, attention to detail, and excellent writing skills.\nExcellent logical reasoning, time management, and listening skills.\nCoding background with hands-on experience in Python/PySpark.\nClear understanding of statistics and probability concepts.\nAbility to act as a liaison between different teams and handle multiple parallel projects.\nTech-savvy, highly motivated, a self-starter, and a team player.\nAbility to perform under pressure.\nAnalytical & critical thinking capabilities.\nOOPS programming competencies.\nMathematical skills.\nExcellent communication skills.\nResponsibilities\n \nRoles and Responsibilities\nConsult with data management teams to understand the company's data storage needs.\nDesign and code the data warehouse system based on company specifications.\nConduct preliminary testing of the warehousing environment before data extraction.\nExtract and transfer company data into the new warehousing environment.\nTest the new storage system thoroughly after data transfer.\nTroubleshoot and resolve any issues that may arise during the process.\nProvide maintenance support for the data warehousing system.\nAdhere to internal QMS (Quality Management System) procedures and Information Security Controls as per the implemented ISMS (Information Security Management System) of the Organization.\nReport incidents to the immediate Reporting Manager/Supervisor promptly.\nContacts\nEmail:\n careers@grazitti.com\nAddress\nGrazitti Interactive 2nd floor, Landmark Plaza, F3 Towers QuarkCity SEZ, A-40A, 160059, Mohali, Sector 62, Sahibzada Ajit Singh Nagar, Punjab, India\n        \n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "AWS",
          "Microsoft Azure",
          "Python",
          "Tableau",
          "Spark",
          "Airflow",
          "POWER BI",
          "GCP",
          "Kafka"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Lead/Associate/Sr. ETL & DWH Engineer / Data Analyst",
      "company": "Grazitti Interactive",
      "location": "Sahibzada Ajit Singh Nagar, Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/lead-associate-sr-etl-dwh-engineer-data-analyst-at-grazitti-interactive-4263267170",
      "post_date": "2025-07-07",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "Job Description\nWe are looking for an experienced and results-driven ETL & DWH Engineer/Data Analyst with over 8 years of experience in data integration, warehousing, and analytics. The ideal candidate will have deep technical expertise in ETL tools, strong data modeling knowledge, and the ability to lead complex data engineering projects from design to deployment.\nKey Skills\n4+ years of hands-on experience with ETL tools like SSIS, Informatica, DataStage, or Talend.\nProficient in relational databases such as SQL Server and MySQL.\nStrong understanding of Data Mart/EDW methodologies.\nExperience in designing star schemas, snowflake schemas, fact and dimension tables.\nExperience with Snowflake or BigQuery.\nKnowledge of reporting and analytics tools like Tableau and Power BI.\nScripting and programming proficiency using Python.\nFamiliarity with cloud platforms such as AWS or Azure.\nAbility to lead recruitment, estimation, and project execution.\nExposure to Sales and Marketing data domains.\nExperience with cross-functional and geographically distributed teams.\nAbility to translate complex data problems into actionable insights.\nStrong communication and client management skills.\nSelf-starter with a collaborative attitude and problem-solving mindset.\nRoles & Responsibilities\nDeliver high-level and low-level design documents for middleware and ETL architecture.\nDesign and review data integration components, ensuring adherence to standards and best practices.\nOwn delivery quality and timeliness across one or more complex projects.\nProvide functional and non-functional assessments for global data implementations.\nOffer technical problem-solving guidance and support to junior team members.\nDrive QA for deliverables and validate progress against project timelines.\nLead issue escalation, status tracking, and continuous improvement initiatives.\nSupport planning, estimation, and resourcing across data engineering efforts.\n\n\n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "Azure",
          "AWS",
          "Power BI",
          "Python",
          "snowflake",
          "Tableau",
          "Snowflake",
          "MySQL"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Software Engineer",
      "company": "Ariel Software Solutions Pvt. Ltd.",
      "location": "Sahibzada Ajit Singh Nagar, Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/software-engineer-at-ariel-software-solutions-pvt-ltd-3815116822",
      "post_date": "2024-01-25",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "NET or ASP.NET Developer’s Job Analysis (MVC.NET Framework) (1 year to 4 years)\nAn ASP.NET developer with an MVC.NET framework to be responsible for designing and monitoring applications. The responsibilities of MVC.NET developers include writing code, designing solutions for applications, and improving functionality.\nNET or ASP.NET (MVC.NET Framework) Developer’s Job Description (Roles and Responsibilities):\nCreating top-quality applications.\nIntegrating and collaborating with front-end developers.\nEnsuring that junior staff delivers according to standards.\nDesigning and building application layers.\nEnsuring a required level of performance.\nWriting test-backed server-side code.\nAnalyzing requirements and designing new functionality.\nSupporting and fixing existing functionality.\nSelecting and using the most appropriate and efficient technologies for a particular application.\nNET or ASP.NET (MVC.NET Framework) Developer’s Job Specifications (Requirements and Qualifications):\nA keen eye for detail.\nStrong communication skills.\nPrevious experience as a developer.\nExtensive working knowledge of coding using .NET languages (C#, VB, NET).\nFamiliarity with .NET framework MVC.NET.\nExperience in writing web applications using .net MVC 4.0/4.5, C#, Entity Framework.\nExperience in HTML, CSS, JavaScript, AJAX, and JQuery. \nExperience on Web API is preferred Knowledge of Bootstrap, AngularJS, and ReactJS. \nSound knowledge of SQL Server 2008/12, MYSQL, MongoDB, PostgreSQL \nGood understanding of multi-tier architecture application development.\nProficiency in C#.\nExperience using .NET 4.5+ | Core.\nSenior knowledge of Entity Framework 6.* | EF Core | NHibernate | ADO.NET.\nDatabase design including indexes and data integrity, if RDBMS is required.\nDependency injection pattern and IOC containers using at least one of Autofac, Unity, Ninject, and/or SimpleIoc.\nWriting tests with NUnit | XUnit | MSTest.\nImplementing enterprise application patterns.\nUnderstanding of HTML, JS, and CSS.\nFamiliarity with the client side framework jQuery | Angular 1.* | Angular 2.*+ | React js.\nFamiliarity with Kendo UI | DevExpress | Syncfusion.\nQualifications: M.tech, B.tech, MCA, BCA\nCandidate’s Soft Skills\nExcellent written and verbal communication skills are essential\nMust be dynamic, flexible, and possess perseverance skills\nShould have an understanding of business objectives and organization structure\nThe candidate must have strong work ethics and trustworthiness\nThe candidate should possess attention to detail and also maintain confidentiality and integrity\nMust be highly collaborative and be a team player with a commitment to excellence\nSelf-motivated, fast learner with the ability to operate independently\nAbility to work under pressure to achieve multiple daily deadlines for client deliverables with a mature approach.\nProficiency in MS Office.\nExcellent multitasking skills.\nAbility to prioritize tasks.\nAbility to present and explain ideas to a variety of audiences.\nStrong organizational and time management skills.\nAbility to maintain a high level of professionalism and confidentiality.\nJob Type:\n Full Time, Permanent, Regular\nSchedule: \nMorning Shift (9 am to 6 pm)\nLocation:\n Plot no.968, Sector-82, JLPL Industrial Area, Mohali, Punjab (140306)\nSupplement Pay:\n Yearly Bonus, Performance bonus, Overtime pay, and others.\nBenefits:\n Personality Development, Training & Development, Paid leave, Mensuration leave, and other special leaves.\n        \n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [
          "SQL",
          "JavaScript",
          "MYSQL",
          "MongoDB",
          "PostgreSQL",
          "Angular",
          "React"
        ],
        "industry": "Not specified"
      }
    },
    {
      "title": "Jr. Data Mining Executive",
      "company": "Netsmartz",
      "location": "Sahibzada Ajit Singh Nagar, Punjab, India",
      "url": "https://in.linkedin.com/jobs/view/jr-data-mining-executive-at-netsmartz-4249621612",
      "post_date": "2025-06-12",
      "scraped_at": "2025-10-21T13:54:03.266463",
      "source": "public_api",
      "details": {
        "description": "We are actively seeking a motivated Data Mining Executive to join our team immediately. This position is perfect for those who are fresh out of college and are looking to make a big impact in a fast-paced environment.\nResponsibilities\n Extracting and analyzing data using Excel, pivot table, v lookup, h lookup, and x lookup.\n Communicate findings or translate the data into an understandable document.\n Collect, interpret and analyze data trends.\n Identify new opportunities for process improvement.\n Provide quality assurance of imported data, working with quality assurance analysts if necessary.\n Processing confidential data and information according to guidelines.\nRequirements\n Bachelor's degree from a reputable institution.\n Solid understanding of data mining techniques.\n Proficiency in Excel including pivot table, v lookup, h lookup, and x lookup.\n Strong communication skills, both written and verbal.\n Able to work under pressure and meet deadlines.\n Ability to analyze large datasets.\n Ability to write comprehensive reports.\n Detail-oriented and exceptional organizational skills.\nNote: The candidate must be ready to start immediately.\nIf you believe you have the necessary skills and experience, we would love to hear from you. Please send your CV, cover letter, and academic documents to our HR department.\n        \n\n\n\n\n\n        \n            Show more\n          \n\n          \n\n\n\n\n\n\n\n        \n            Show less",
        "skills": [],
        "industry": "Not specified"
      }
    }
  ],
  "metadata": {
    "scraped_at": "2025-10-21T13:54:48.304404",
    "total_jobs": 10,
    "total_with_details": 10
  }
}